zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rcc.h
/**
  ******************************************************************************
  * @file    stm32mp2xx_hal_rcc.h
  * @author  MCD Application Team
  * @brief   Header file of RCC HAL  module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32MP2xx_HAL_RCC_H
#define STM32MP2xx_HAL_RCC_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp2xx_hal_def.h"
#include "stm32mp2xx_ll_rcc.h"

/** @addtogroup STM32MP2xx_HAL_Driver
  * @{
  */

/** @addtogroup RCC
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup RCC_Exported_Types RCC Exported Types
  * @{
  */

/**
  * @brief  RCC Internal/External Oscillator (HSE, HSI, MSI, LSE and LSI) configuration structure definition
  */
typedef struct
{
  uint32_t OscillatorType;       /*!< The oscillators to be configured.
                                      This parameter can be a value of @ref RCC_Oscillator_Type                   */

  uint32_t HSEState;             /*!< The new state of the HSE.
                                      This parameter can be a value of @ref RCC_HSE_Config                        */

  uint32_t LSEState;             /*!< The new state of the LSE.
                                      This parameter can be a value of @ref RCC_LSE_Config                        */

  uint32_t HSIState;             /*!< The new state of the HSI.
                                      This parameter can be a value of @ref RCC_HSI_Config                        */

  uint32_t HSICalibrationValue;  /*!< The calibration trimming value (default is RCC_HSICALIBRATION_DEFAULT).
                                      This parameter must be a number between Min_Data = 0x00 and Max_Data = 0x7F
                                      on the other devices */

  uint32_t LSIState;             /*!< The new state of the LSI.
                                      This parameter can be a value of @ref RCC_LSI_Config                        */

  uint32_t MSIState;             /*!< The new state of the MSI.
                                      This parameter can be a value of @ref RCC_MSI_Config                        */

  uint32_t MSICalibrationValue;  /*!< The calibration trimming value (default is RCC_MSICALIBRATION_DEFAULT).
                                      This parameter must be a number between Min_Data = 0x00 and Max_Data = 0xFF */

  uint32_t MSIFrequency;         /*!< The MSI frequency can be 4 or 16 MHz. */

  uint32_t LSEDriveValue;        /*!< The LSE drive value (default is RCC_LSEDRIVE_MEDIUMLOW).
                                      This parameter can be a value of @ref RCC_LSEDrive_Config                   */

} RCC_OscInitTypeDef;

/**
  * @brief Flexgen structure definition.
  */
typedef struct
{
  uint32_t      XBAR_Channel; /* crossbar Channel */
  uint32_t      XBAR_ClkSrc;  /* crossbar input Clock */
  uint32_t      Div;
} RCC_FlexgenTypeDef;

/**
  * @brief Bus clock configuration structure definition.
  */
typedef struct
{
  uint32_t                      ClockType;
  RCC_FlexgenTypeDef            ICN_HS_MCU;
  RCC_FlexgenTypeDef            ICN_SDMMC;
  RCC_FlexgenTypeDef            ICN_DDR;
  RCC_FlexgenTypeDef            ICN_DISPLAY;
  RCC_FlexgenTypeDef            ICN_HCL;
  RCC_FlexgenTypeDef            ICN_NIC;
  RCC_FlexgenTypeDef            ICN_VID;
  uint32_t                      ICN_LSMCU_Div;
  uint32_t                      APB1_Div;
  uint32_t                      APB2_Div;
  uint32_t                      APB3_Div;
  uint32_t                      APB4_Div;
#if defined(RCC_APB5DIVR_APB5DIV)
  uint32_t                      APB5_Div;
#endif /* RCC_APB5DIVR_APB5DIV */
  uint32_t                      APBDBG_Div;
  uint32_t                      RTC_Div;
  uint32_t                      RTC_Src;
  uint32_t                      RTCState;
} RCC_ClkInitTypeDef;

/**
  * @brief Mux configuration structure definition.
  */
typedef struct
{
  uint32_t id;
  uint32_t source;
} RCC_MuxCfgTypeDef;

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup RCC_Exported_Constants RCC Exported Constants
  * @{
  */

/** @defgroup RCC_Clock_Type RCC_Clock_Type
  * @{
  */
#define RCC_CLOCKTYPE_ICN_HS_MCU        0x00000001U
#define RCC_CLOCKTYPE_ICN_LS_MCU        0x00000002U
#define RCC_CLOCKTYPE_ICN_SDMMC         0x00000004U
#define RCC_CLOCKTYPE_ICN_DDR           0x00000008U
#define RCC_CLOCKTYPE_ICN_DISPLAY       0x00000010U
#define RCC_CLOCKTYPE_ICN_HCL           0x00000020U
#define RCC_CLOCKTYPE_ICN_NIC           0x00000040U
#define RCC_CLOCKTYPE_ICN_VID           0x00000080U
#define RCC_CLOCKTYPE_ICN_APB1          0x00000100U
#define RCC_CLOCKTYPE_ICN_APB2          0x00000200U
#define RCC_CLOCKTYPE_ICN_APB3          0x00000400U
#define RCC_CLOCKTYPE_ICN_APB4          0x00000800U
#if defined(RCC_APB5DIVR_APB5DIV)
#define RCC_CLOCKTYPE_ICN_APB5          0x00001000U
#define RCC_CLOCKTYPE_ICN_APBDBG        0x00002000U
#define RCC_CLOCKTYPE_RTC               0x00004000U
#else
#define RCC_CLOCKTYPE_ICN_APBDBG        0x00001000U
#define RCC_CLOCKTYPE_RTC               0x00002000U
#endif /* RCC_APB5DIVR_APB5DIV */

#if defined(RCC_CLOCKTYPE_ICN_APB5)
#define IS_RCC_CLOCKTYPE(CLOCK)    ((((CLOCK) & RCC_CLOCKTYPE_ICN_HS_MCU)  == RCC_CLOCKTYPE_ICN_HS_MCU)    || \
                                    (((CLOCK) & RCC_CLOCKTYPE_ICN_LS_MCU) == RCC_CLOCKTYPE_ICN_LS_MCU)     || \
                                    (((CLOCK) & RCC_CLOCKTYPE_ICN_SDMMC)  == RCC_CLOCKTYPE_ICN_SDMMC)      || \
                                    (((CLOCK) & RCC_CLOCKTYPE_ICN_DDR) == RCC_CLOCKTYPE_ICN_DDR)           || \
                                    (((CLOCK) & RCC_CLOCKTYPE_ICN_DISPLAY) == RCC_CLOCKTYPE_ICN_DISPLAY)   || \
                                    (((CLOCK) & RCC_CLOCKTYPE_ICN_HCL) == RCC_CLOCKTYPE_ICN_HCL)           || \
                                    (((CLOCK) & RCC_CLOCKTYPE_ICN_NIC) == RCC_CLOCKTYPE_ICN_NIC)           || \
                                    (((CLOCK) & RCC_CLOCKTYPE_ICN_VID) == RCC_CLOCKTYPE_ICN_VID)           || \
                                    (((CLOCK) & RCC_CLOCKTYPE_ICN_APB1) == RCC_CLOCKTYPE_ICN_APB1)         || \
                                    (((CLOCK) & RCC_CLOCKTYPE_ICN_APB2) == RCC_CLOCKTYPE_ICN_APB2)         || \
                                    (((CLOCK) & RCC_CLOCKTYPE_ICN_APB3) == RCC_CLOCKTYPE_ICN_APB3)         || \
                                    (((CLOCK) & RCC_CLOCKTYPE_ICN_APB4) == RCC_CLOCKTYPE_ICN_APB4)         || \
                                    (((CLOCK) & RCC_CLOCKTYPE_ICN_APB5) == RCC_CLOCKTYPE_ICN_APB5)         || \
                                    (((CLOCK) & RCC_CLOCKTYPE_ICN_APBDBG) == RCC_CLOCKTYPE_ICN_APBDBG)     || \
                                    (((CLOCK) & RCC_CLOCKTYPE_RTC) == RCC_CLOCKTYPE_RTC))
#else
#define IS_RCC_CLOCKTYPE(CLOCK)    ((((CLOCK) & RCC_CLOCKTYPE_ICN_HS_MCU)  == RCC_CLOCKTYPE_ICN_HS_MCU)    || \
                                    (((CLOCK) & RCC_CLOCKTYPE_ICN_LS_MCU) == RCC_CLOCKTYPE_ICN_LS_MCU)     || \
                                    (((CLOCK) & RCC_CLOCKTYPE_ICN_SDMMC)  == RCC_CLOCKTYPE_ICN_SDMMC)      || \
                                    (((CLOCK) & RCC_CLOCKTYPE_ICN_DDR) == RCC_CLOCKTYPE_ICN_DDR)           || \
                                    (((CLOCK) & RCC_CLOCKTYPE_ICN_DISPLAY) == RCC_CLOCKTYPE_ICN_DISPLAY)   || \
                                    (((CLOCK) & RCC_CLOCKTYPE_ICN_HCL) == RCC_CLOCKTYPE_ICN_HCL)           || \
                                    (((CLOCK) & RCC_CLOCKTYPE_ICN_NIC) == RCC_CLOCKTYPE_ICN_NIC)           || \
                                    (((CLOCK) & RCC_CLOCKTYPE_ICN_VID) == RCC_CLOCKTYPE_ICN_VID)           || \
                                    (((CLOCK) & RCC_CLOCKTYPE_ICN_APB1) == RCC_CLOCKTYPE_ICN_APB1)         || \
                                    (((CLOCK) & RCC_CLOCKTYPE_ICN_APB2) == RCC_CLOCKTYPE_ICN_APB2)         || \
                                    (((CLOCK) & RCC_CLOCKTYPE_ICN_APB3) == RCC_CLOCKTYPE_ICN_APB3)         || \
                                    (((CLOCK) & RCC_CLOCKTYPE_ICN_APB4) == RCC_CLOCKTYPE_ICN_APB4)         || \
                                    (((CLOCK) & RCC_CLOCKTYPE_ICN_APBDBG) == RCC_CLOCKTYPE_ICN_APBDBG)     || \
                                    (((CLOCK) & RCC_CLOCKTYPE_RTC) == RCC_CLOCKTYPE_RTC))

