zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rcc.h
#endif /* RCC_CLOCKTYPE_ICN_APB5 */
/**
  * @}
  */


/** @defgroup RCC_Xbar_Source RCC_Xbar_source
  * @{
  */
#define RCC_XBAR_CLKSRC_PLL4    0U
#define RCC_XBAR_CLKSRC_PLL5    1U
#define RCC_XBAR_CLKSRC_PLL6    2U
#define RCC_XBAR_CLKSRC_PLL7    3U
#define RCC_XBAR_CLKSRC_PLL8    4U
#define RCC_XBAR_CLKSRC_HSI     5U
#define RCC_XBAR_CLKSRC_HSE     6U
#define RCC_XBAR_CLKSRC_MSI     7U
#define RCC_XBAR_CLKSRC_HSI_KER 8U
#define RCC_XBAR_CLKSRC_HSE_KER 9U
#define RCC_XBAR_CLKSRC_MSI_KER 10U
#define RCC_XBAR_CLKSRC_SPDIF   11U
#define RCC_XBAR_CLKSRC_I2S     12U
#define RCC_XBAR_CLKSRC_LSI     13U
#define RCC_XBAR_CLKSRC_LSE     14U
/**
  * @}
  */

/** @defgroup RCC_APBx_Dividers RCC_APBx_Dividers
  * @{
  */
#define RCC_APB1_DIV1           0U
#define RCC_APB1_DIV2           1U
#define RCC_APB1_DIV4           2U
#define RCC_APB1_DIV8           3U
#define RCC_APB1_DIV16          4U

#define RCC_APB2_DIV1           0U
#define RCC_APB2_DIV2           1U
#define RCC_APB2_DIV4           2U
#define RCC_APB2_DIV8           3U
#define RCC_APB2_DIV16          4U

#define RCC_APB3_DIV1           0U
#define RCC_APB3_DIV2           1U
#define RCC_APB3_DIV4           2U
#define RCC_APB3_DIV8           3U
#define RCC_APB3_DIV16          4U

#define RCC_APB4_DIV1           0U
#define RCC_APB4_DIV2           1U
#define RCC_APB4_DIV4           2U
#define RCC_APB4_DIV8           3U
#define RCC_APB4_DIV16          4U
#if defined(RCC_APB5DIVR_APB5DIV)
#define RCC_APB5_DIV1           0U
#define RCC_APB5_DIV2           1U
#define RCC_APB5_DIV4           2U
#define RCC_APB5_DIV8           3U
#define RCC_APB5_DIV16          4U
#endif /* RCC_APB5DIVR_APB5DIV */
#define RCC_APBDBG_DIV1         0U
#define RCC_APBDBG_DIV2         1U
#define RCC_APBDBG_DIV4         2U
#define RCC_APBDBG_DIV8         3U
#define RCC_APBDBG_DIV16        4U

#define RCC_LSMCU_DIV1          0U
#define RCC_LSMCU_DIV2          1U
/**
  * @}
  */


#define HSE_TIMEOUT_VALUE          HSE_STARTUP_TIMEOUT
#define HSI_TIMEOUT_VALUE          (2U)    /* 2 ms (minimum Tick + 1) */
#define MSI_TIMEOUT_VALUE          (2U)    /* 2 ms (minimum Tick + 1) */
#define XBAR_TIMEOUT_VALUE         (2U)    /* 2 ms (minimum Tick + 1) */
#define DBP_TIMEOUT_VALUE          ((uint32_t)100U)


/** @defgroup RCC_Timeout_Value Timeout Values
  * @{
  */
#define RCC_LSE_TIMEOUT_VALUE          LSE_STARTUP_TIMEOUT
/**
  * @}
  */

/** @defgroup RCC_Oscillator_Type Oscillator Type
  * @{
  */
#define RCC_OSCILLATORTYPE_NONE        0x0UL    /*!< Oscillator configuration unchanged */
#define RCC_OSCILLATORTYPE_HSI         0x1UL    /*!< HSI to configure */
#define RCC_OSCILLATORTYPE_HSE         0x2UL    /*!< HSE to configure */
#define RCC_OSCILLATORTYPE_MSI         0x4UL    /*!< MSI to configure */
#define RCC_OSCILLATORTYPE_LSE         0x8UL    /*!< LSE to configure */
#define RCC_OSCILLATORTYPE_LSI         0x10UL   /*!< LSI to configure */
#define IS_RCC_HSI(HSI) (((HSI) == RCC_HSI_OFF) || ((HSI) == RCC_HSI_ON))
/**
  * @}
  */

/** @defgroup RCC_HSE_Config HSE Config
  * @{
  */
#define RCC_HSE_OFF                    0x00000000U                                                            /*!< HSE clock deactivation */
#define RCC_HSE_ON                     RCC_OCENSETR_HSEON                                                     /*!< HSE clock activation */
#define RCC_HSE_BYPASS                 (RCC_OCENSETR_HSEBYP | RCC_OCENSETR_HSEON)                             /*!< Analog External clock source for HSE clock */
#define RCC_HSE_BYPASS_DIGITAL         (RCC_OCENSETR_HSEDIGBYP | RCC_OCENSETR_HSEBYP | RCC_OCENSETR_HSEON)    /*!< Digital External clock source for HSE clock */

#define IS_RCC_HSE(HSE) (((HSE) == RCC_HSE_OFF) || ((HSE) == RCC_HSE_ON) || \
                         ((HSE) == RCC_HSE_BYPASS) || ((HSE) == RCC_HSE_BYPASS_DIGITAL))
/**
  * @}
  */

/** @defgroup RCC_LSE_Config LSE Config
  * @{
  */
#define RCC_LSE_OFF                    0U                                                              /*!< LSE clock deactivation */
#define RCC_LSE_ON                     RCC_BDCR_LSEON                                                  /*!< LSE clock activation  */
#define RCC_LSE_BYPASS                 (RCC_BDCR_LSEBYP | RCC_BDCR_LSEON)                              /*!< Analog External clock source for LSE clock */
#define RCC_LSE_BYPASS_DIGITAL         (RCC_BDCR_LSEDIGBYP | RCC_BDCR_LSEBYP | RCC_BDCR_LSEON)         /*!< Digital External clock source for LSE clock */

#define IS_RCC_LSE(LSE) (((LSE) == RCC_LSE_OFF) || ((LSE) == RCC_LSE_ON) || \
                         ((LSE) == RCC_LSE_BYPASS) || ((LSE) == RCC_LSE_BYPASS_DIGITAL))
/**
  * @}
  */

/** @defgroup RCC_HSI_Config HSI Config
  * @{
  */
#define RCC_HSI_OFF                    0x00000000U            /*!< HSI clock deactivation */
#define RCC_HSI_ON                     RCC_OCENSETR_HSION     /*!< HSI clock activation */
#define RCC_HSICALIBRATION_DEFAULT     0x00U                  /* Default HSI calibration trimming value */
/**
  * @}
  */

/** @defgroup RCC_LSI_Config LSI Config
  * @{
  */
#define RCC_LSI_OFF                    0x00000000U        /*!< LSI clock deactivation */

#if defined(RCC_BDCR_LSION)
#define RCC_LSI_ON                     RCC_BDCR_LSION     /*!< LSI clock activation */
#else
#define RCC_LSI_ON                     RCC_LSICR_LSION     /*!< LSI clock activation */
#endif /* RCC_BDCR_LSION */
#define IS_RCC_LSI(LSI) (((LSI) == RCC_LSI_OFF) || ((LSI) == RCC_LSI_ON))
/**
  * @}
  */

/** @defgroup RCC_MSI_Config MSI Config
  * @{
  */
#define RCC_MSI_OFF                    0x00000000U             /*!< MSI clock deactivation */
#if defined(RCC_D3DCR_MSION)
#define RCC_MSI_ON                     RCC_D3DCR_MSION         /*!< MSI clock activation */
#else
#define RCC_MSI_ON                     RCC_OCENSETR_MSION         /*!< MSI clock activation */
#endif /* RCC_D3DCR_MSION */
#define IS_RCC_MSI(MSI) (((MSI) == RCC_MSI_OFF) || ((MSI) == RCC_MSI_ON))
#define RCC_MSICALIBRATION_DEFAULT     0x10U                   /*!< Default MSI calibration trimming value */
#define RCC_MSI_4MHZ                   4000000U
#define RCC_MSI_16MHZ                  16000000U
/**
  * @}
  */

/** @defgroup RCC_RTC_State  RCC RTC State
  * @{
  */
#define RCC_RTC_OFF                  0x00000000U
#define RCC_RTC_ON                   0x00000001U
/**
  * @}
  */

/** @defgroup RCC_MCO_Index MCO Index
  * @{
  */

