zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rcc.h
/* @cond */
/* 32     28      20       16      0
   --------------------------------
   | MCO   | GPIO  | GPIO  | GPIO  |
   | Index |  AF   | Port  |  Pin  |
   -------------------------------*/

#define RCC_MCO_GPIOPORT_POS   16U
#define RCC_MCO_GPIOPORT_MASK  (0xFUL << RCC_MCO_GPIOPORT_POS)
#define RCC_MCO_GPIOAF_POS     20U
#define RCC_MCO_GPIOAF_MASK    (0xFFUL << RCC_MCO_GPIOAF_POS)
#define RCC_MCO_INDEX_POS      28U
#define RCC_MCO_INDEX_MASK     (0x1UL << RCC_MCO_INDEX_POS)

#define RCC_MCO1_INDEX         (0x0UL << RCC_MCO_INDEX_POS)            /*!< MCO1 index */
#define RCC_MCO2_INDEX         (0x1UL << RCC_MCO_INDEX_POS)            /*!< MCO2 index */
/* @endcond */
#define RCC_MCO1_PC9           (RCC_MCO1_INDEX |\
                                ((uint32_t)GPIO_AF1_MCO1 << RCC_MCO_GPIOAF_POS) |\
                                ((uint32_t)GPIO_GET_INDEX(GPIOC) << RCC_MCO_GPIOPORT_POS) | GPIO_PIN_9)
#define RCC_MCO1_PF11          (RCC_MCO1_INDEX |\
                                ((uint32_t)GPIO_AF1_MCO1 << RCC_MCO_GPIOAF_POS) |\
                                ((uint32_t)GPIO_GET_INDEX(GPIOF) << RCC_MCO_GPIOPORT_POS) | GPIO_PIN_11)
#define RCC_MCO1_PI6           (RCC_MCO1_INDEX |\
                                ((uint32_t)GPIO_AF1_MCO1 << RCC_MCO_GPIOAF_POS) |\
                                ((uint32_t)GPIO_GET_INDEX(GPIOI) << RCC_MCO_GPIOPORT_POS) | GPIO_PIN_6)
#define RCC_MCO1_PZ5           (RCC_MCO1_INDEX |\
                                ((uint32_t)GPIO_AF1_MCO1 << RCC_MCO_GPIOAF_POS) |\
                                ((uint32_t)GPIO_GET_INDEX(GPIOZ) << RCC_MCO_GPIOPORT_POS) | GPIO_PIN_5)
#define RCC_MCO1               RCC_MCO1_PC9         /*!< Alias to be compliant with other families with 1 Pin per MCO output */

#define RCC_MCO2_PF10          (RCC_MCO2_INDEX |\
                                ((uint32_t)GPIO_AF1_MCO2 << RCC_MCO_GPIOAF_POS) |\
                                ((uint32_t)GPIO_GET_INDEX(GPIOF) << RCC_MCO_GPIOPORT_POS) | GPIO_PIN_10)
#define RCC_MCO2_PZ4           (RCC_MCO2_INDEX |\
                                ((uint32_t)GPIO_AF2_MCO2 << RCC_MCO_GPIOAF_POS) |\
                                ((uint32_t)GPIO_GET_INDEX(GPIOZ) << RCC_MCO_GPIOPORT_POS) | GPIO_PIN_4)
#define RCC_MCO2_PZ9           (RCC_MCO2_INDEX |\
                                ((uint32_t)GPIO_AF1_MCO2 << RCC_MCO_GPIOAF_POS) |\
                                ((uint32_t)GPIO_GET_INDEX(GPIOZ) << RCC_MCO_GPIOPORT_POS) | GPIO_PIN_9)
#define RCC_MCO2               RCC_MCO2_PF10        /*!< Alias to be compliant with other families with 1 Pin per MCO output */

#define RCC_MCO                RCC_MCO1             /*!< Alias to be compliant with other families with 1 MCO */

#define IS_RCC_MCO(__MCOX__) (((__MCOX__) == RCC_MCO1_PC9) || \
                              ((__MCOX__) == RCC_MCO1_PF11) || \
                              ((__MCOX__) == RCC_MCO1_PI6) || \
                              ((__MCOX__) == RCC_MCO1_PZ5) || \
                              ((__MCOX__) == RCC_MCO2_PF10) || \
                              ((__MCOX__) == RCC_MCO2_PZ4) || \
                              ((__MCOX__) == RCC_MCO2_PZ9))

/**
  * @}
  */

/** @defgroup RCC_MCO1_Clock_Source MCO1 Clock Source
  * @{
  */
#define RCC_MCO1SOURCE_NOCLOCK         0x00000000U                              /*!< MCO1 output disabled, no clock on MCO1 */
#define RCC_MCO1SOURCE_CLKOBS          0x000000FFU                              /*!< Clock Observer 0 selected as MCO1 Source */
#define RCC_MCO1SOURCE_PLL4            (0x00000100U | RCC_XBAR_CLKSRC_PLL4)     /*!< PLL4 selected as MCO1 Source */
#define RCC_MCO1SOURCE_PLL5            (0x00000100U | RCC_XBAR_CLKSRC_PLL5)     /*!< PLL5 selected as MCO1 Source */
#define RCC_MCO1SOURCE_PLL6            (0x00000100U | RCC_XBAR_CLKSRC_PLL6)     /*!< PLL6 selected as MCO1 Source */
#define RCC_MCO1SOURCE_PLL7            (0x00000100U | RCC_XBAR_CLKSRC_PLL7)     /*!< PLL7 selected as MCO1 Source */
#define RCC_MCO1SOURCE_PLL8            (0x00000100U | RCC_XBAR_CLKSRC_PLL8)     /*!< PLL8 selected as MCO1 Source */
#define RCC_MCO1SOURCE_HSI             (0x00000100U | RCC_XBAR_CLKSRC_HSI)      /*!< HSI selected as MCO1 Source */
#define RCC_MCO1SOURCE_HSE             (0x00000100U | RCC_XBAR_CLKSRC_HSE)      /*!< HSE selected as MCO1 Source */
#define RCC_MCO1SOURCE_MSI             (0x00000100U | RCC_XBAR_CLKSRC_MSI)      /*!< MSI selected as MCO1 Source */
#define RCC_MCO1SOURCE_HSI_KER         (0x00000100U | RCC_XBAR_CLKSRC_HSI_KER)  /*!< HSI_KER selected as MCO1 Source */
#define RCC_MCO1SOURCE_HSE_KER         (0x00000100U | RCC_XBAR_CLKSRC_HSE_KER)  /*!< HSE_KER selected as MCO1 Source */
#define RCC_MCO1SOURCE_MSI_KER         (0x00000100U | RCC_XBAR_CLKSRC_MSI_KER)  /*!< MSI_KER selected as MCO1 Source */
#define RCC_MCO1SOURCE_SPDIF           (0x00000100U | RCC_XBAR_CLKSRC_SPDIF)    /*!< SPDIF selected as MCO1 Source */
#define RCC_MCO1SOURCE_I2S             (0x00000100U | RCC_XBAR_CLKSRC_I2S)      /*!< I2S selected as MCO1 Source */
#define RCC_MCO1SOURCE_LSI             (0x00000100U | RCC_XBAR_CLKSRC_LSI)      /*!< LSI selected as MCO1 Source */
#define RCC_MCO1SOURCE_LSE             (0x00000100U | RCC_XBAR_CLKSRC_LSE)      /*!< LSE selected as MCO1 Source */

#define IS_RCC_MCO1SOURCE(__SOURCE__)  (((__SOURCE__) == RCC_MCO1SOURCE_NOCLOCK) || \
                                        ((__SOURCE__) == RCC_MCO1SOURCE_CLKOBS) || \
                                        ((__SOURCE__) == RCC_MCO1SOURCE_PLL4) || \
                                        ((__SOURCE__) == RCC_MCO1SOURCE_HSE) || \
                                        ((__SOURCE__) == RCC_MCO1SOURCE_PLL5) || \
                                        ((__SOURCE__) == RCC_MCO1SOURCE_PLL6) || \
                                        ((__SOURCE__) == RCC_MCO1SOURCE_PLL7) || \
                                        ((__SOURCE__) == RCC_MCO1SOURCE_PLL8) || \
                                        ((__SOURCE__) == RCC_MCO1SOURCE_HSI) || \
                                        ((__SOURCE__) == RCC_MCO1SOURCE_HSE) || \
                                        ((__SOURCE__) == RCC_MCO1SOURCE_MSI) || \
                                        ((__SOURCE__) == RCC_MCO1SOURCE_HSI_KER) || \
                                        ((__SOURCE__) == RCC_MCO1SOURCE_HSE_KER) || \
                                        ((__SOURCE__) == RCC_MCO1SOURCE_MSI_KER) || \
                                        ((__SOURCE__) == RCC_MCO1SOURCE_SPDIF) || \
                                        ((__SOURCE__) == RCC_MCO1SOURCE_I2S) || \
                                        ((__SOURCE__) == RCC_MCO1SOURCE_LSI) || \
                                        ((__SOURCE__) == RCC_MCO1SOURCE_LSE))

/**
  * @}
  */

