zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rcc.h
/** @defgroup RCC_MCO2_Clock_Source MCO2 Clock Source
  * @{
  */
#define RCC_MCO2SOURCE_NOCLOCK         0x00000000U                              /*!< MCO2 output disabled, no clock on MCO2 */
#define RCC_MCO2SOURCE_CLKOBS          0x000000FFU                              /*!< Clock Observer 1 selected as MCO2 Source */
#define RCC_MCO2SOURCE_PLL4            (0x00000100U | RCC_XBAR_CLKSRC_PLL4)     /*!< PLL4 selected as MCO2 Source */
#define RCC_MCO2SOURCE_PLL5            (0x00000100U | RCC_XBAR_CLKSRC_PLL5)     /*!< PLL5 selected as MCO2 Source */
#define RCC_MCO2SOURCE_PLL6            (0x00000100U | RCC_XBAR_CLKSRC_PLL6)     /*!< PLL6 selected as MCO2 Source */
#define RCC_MCO2SOURCE_PLL7            (0x00000100U | RCC_XBAR_CLKSRC_PLL7)     /*!< PLL7 selected as MCO2 Source */
#define RCC_MCO2SOURCE_PLL8            (0x00000100U | RCC_XBAR_CLKSRC_PLL8)     /*!< PLL8 selected as MCO2 Source */
#define RCC_MCO2SOURCE_HSI             (0x00000100U | RCC_XBAR_CLKSRC_HSI)      /*!< HSI selected as MCO2 Source */
#define RCC_MCO2SOURCE_HSE             (0x00000100U | RCC_XBAR_CLKSRC_HSE)      /*!< HSE selected as MCO2 Source */
#define RCC_MCO2SOURCE_MSI             (0x00000100U | RCC_XBAR_CLKSRC_MSI)      /*!< MSI selected as MCO2 Source */
#define RCC_MCO2SOURCE_HSI_KER         (0x00000100U | RCC_XBAR_CLKSRC_HSI_KER)  /*!< HSI_KER selected as MCO2 Source */
#define RCC_MCO2SOURCE_HSE_KER         (0x00000100U | RCC_XBAR_CLKSRC_HSE_KER)  /*!< HSE_KER selected as MCO2 Source */
#define RCC_MCO2SOURCE_MSI_KER         (0x00000100U | RCC_XBAR_CLKSRC_MSI_KER)  /*!< MSI_KER selected as MCO2 Source */
#define RCC_MCO2SOURCE_SPDIF           (0x00000100U | RCC_XBAR_CLKSRC_SPDIF)    /*!< SPDIF selected as MCO2 Source */
#define RCC_MCO2SOURCE_I2S             (0x00000100U | RCC_XBAR_CLKSRC_I2S)      /*!< I2S selected as MCO2 Source */
#define RCC_MCO2SOURCE_LSI             (0x00000100U | RCC_XBAR_CLKSRC_LSI)      /*!< LSI selected as MCO2 Source */
#define RCC_MCO2SOURCE_LSE             (0x00000100U | RCC_XBAR_CLKSRC_LSE)      /*!< LSE selected as MCO2 Source */

#define IS_RCC_MCO2SOURCE(__SOURCE__)  (((__SOURCE__) == RCC_MCO2SOURCE_NOCLOCK) || \
                                        ((__SOURCE__) == RCC_MCO2SOURCE_CLKOBS) || \
                                        ((__SOURCE__) == RCC_MCO2SOURCE_PLL4) || \
                                        ((__SOURCE__) == RCC_MCO2SOURCE_HSE) || \
                                        ((__SOURCE__) == RCC_MCO2SOURCE_PLL5) || \
                                        ((__SOURCE__) == RCC_MCO2SOURCE_PLL6) || \
                                        ((__SOURCE__) == RCC_MCO2SOURCE_PLL7) || \
                                        ((__SOURCE__) == RCC_MCO2SOURCE_PLL8) || \
                                        ((__SOURCE__) == RCC_MCO2SOURCE_HSI) || \
                                        ((__SOURCE__) == RCC_MCO2SOURCE_HSE) || \
                                        ((__SOURCE__) == RCC_MCO2SOURCE_MSI) || \
                                        ((__SOURCE__) == RCC_MCO2SOURCE_HSI_KER) || \
                                        ((__SOURCE__) == RCC_MCO2SOURCE_HSE_KER) || \
                                        ((__SOURCE__) == RCC_MCO2SOURCE_MSI_KER) || \
                                        ((__SOURCE__) == RCC_MCO2SOURCE_SPDIF) || \
                                        ((__SOURCE__) == RCC_MCO2SOURCE_I2S) || \
                                        ((__SOURCE__) == RCC_MCO2SOURCE_LSI) || \
                                        ((__SOURCE__) == RCC_MCO2SOURCE_LSE))

/**
  * @}
  */

/** @defgroup RCC_MCOx_Clock_Prescaler MCO1 Clock Prescaler
  * @{
  */

#define IS_RCC_MCODIV                   IS_RCC_XBARDIV    /* MCO Dividers are actually XBAR dividers */

/**
  * @}
  */

/** @defgroup RCC_Interrupt Interrupts
  * @{
  */
#define RCC_C1IT_LSIRDY       RCC_C1CIFCLRR_LSIRDYF
#define RCC_C1IT_LSERDY       RCC_C1CIFCLRR_LSERDYF
#define RCC_C1IT_HSIRDY       RCC_C1CIFCLRR_HSIRDYF
#define RCC_C1IT_HSERDY       RCC_C1CIFCLRR_HSERDYF
#define RCC_C1IT_MSIRDY       RCC_C1CIFCLRR_MSIRDYF
#define RCC_C1IT_PLL1RDY      RCC_C1CIFCLRR_PLL1RDYF
#define RCC_C1IT_PLL2RDY      RCC_C1CIFCLRR_PLL2RDYF
#if defined(RCC_C1CIFCLRR_PLL3RDYF)
#define RCC_C1IT_PLL3RDY      RCC_C1CIFCLRR_PLL3RDYF
#endif /* RCC_C1CIFCLRR_PLL3RDYF */
#define RCC_C1IT_PLL4RDY      RCC_C1CIFCLRR_PLL4RDYF
#define RCC_C1IT_PLL5RDY      RCC_C1CIFCLRR_PLL5RDYF
#define RCC_C1IT_PLL6RDY      RCC_C1CIFCLRR_PLL6RDYF
#define RCC_C1IT_PLL7RDY      RCC_C1CIFCLRR_PLL7RDYF
#define RCC_C1IT_PLL8RDY      RCC_C1CIFCLRR_PLL8RDYF
#define RCC_C1IT_LSECSS       RCC_C1CIFCLRR_LSECSSF
#define RCC_C1IT_WKUP         RCC_C1CIFCLRR_WKUPF
#define RCC_C2IT_LSIRDY       RCC_C2CIFCLRR_LSIRDYF
#define RCC_C2IT_LSERDY       RCC_C2CIFCLRR_LSERDYF
#define RCC_C2IT_HSIRDY       RCC_C2CIFCLRR_HSIRDYF
#define RCC_C2IT_HSERDY       RCC_C2CIFCLRR_HSERDYF
#define RCC_C2IT_MSIRDY       RCC_C2CIFCLRR_MSIRDYF
#define RCC_C2IT_PLL1RDY      RCC_C2CIFCLRR_PLL1RDYF
#define RCC_C2IT_PLL2RDY      RCC_C2CIFCLRR_PLL2RDYF
#if defined(RCC_C2CIFCLRR_PLL3RDYF)
#define RCC_C2IT_PLL3RDY      RCC_C2CIFCLRR_PLL3RDYF
#endif /* RCC_C2CIFCLRR_PLL3RDYF */
#define RCC_C2IT_PLL4RDY      RCC_C2CIFCLRR_PLL4RDYF
#define RCC_C2IT_PLL5RDY      RCC_C2CIFCLRR_PLL5RDYF
#define RCC_C2IT_PLL6RDY      RCC_C2CIFCLRR_PLL6RDYF
#define RCC_C2IT_PLL7RDY      RCC_C2CIFCLRR_PLL7RDYF
#define RCC_C2IT_PLL8RDY      RCC_C2CIFCLRR_PLL8RDYF
#define RCC_C2IT_LSECSS       RCC_C2CIFCLRR_LSECSSF
#define RCC_C2IT_WKUP         RCC_C2CIFCLRR_WKUPF
/**
  * @}
  */

/** @defgroup RCC_Flag Flags
  *        Elements values convention: XXXYYYYYb
  *           - YYYYY  : Flag position in the register
  *           - XXX  : Register index
  *                 - 001: CR register
  *                 - 010: BDCR register
  *                 - 011: CSR register
  *                 - 100: CRRCR register
  * @{
  */
#define RCC_FLAG_MASK                   0x1FUL
#define RCC_HWRSTSCLRR_FLAGS_ID         1UL
#define RCC_C1HWRSTSCLRR_FLAGS_ID       2UL
#define RCC_C2HWRSTSCLRR_FLAGS_ID       3UL
#define RCC_OCRDYR_FLAGS_ID             4UL
#if defined(RCC_D3DCR_MSION)
#define RCC_D3DCR_FLAGS_ID              5UL
#else
#define RCC_LSICR_FLAGS_ID              5UL
#endif /* RCC_D3DCR_MSION */
#define RCC_BDCR_FLAGS_ID               6UL
#define RCC_FLAG_PORRST                 ((RCC_HWRSTSCLRR_FLAGS_ID   << 5UL) | RCC_HWRSTSCLRR_PORRSTF_Pos)
#define RCC_FLAG_BORRST                 ((RCC_HWRSTSCLRR_FLAGS_ID   << 5UL) | RCC_HWRSTSCLRR_BORRSTF_Pos)
#define RCC_FLAG_PADRST                 ((RCC_HWRSTSCLRR_FLAGS_ID   << 5UL) | RCC_HWRSTSCLRR_PADRSTF_Pos)
#define RCC_FLAG_HCSSRST                ((RCC_HWRSTSCLRR_FLAGS_ID   << 5UL) | RCC_HWRSTSCLRR_HCSSRSTF_Pos)
#define RCC_FLAG_VCORERST               ((RCC_HWRSTSCLRR_FLAGS_ID   << 5UL) | RCC_HWRSTSCLRR_VCORERSTF_Pos)
#define RCC_FLAG_VCPURSTF               ((RCC_C1HWRSTSCLRR_FLAGS_ID << 5UL) | RCC_C1HWRSTSCLRR_VCPURSTF_Pos)
#define RCC_FLAG_SYSC1RSTF              ((RCC_HWRSTSCLRR_FLAGS_ID   << 5UL) | RCC_HWRSTSCLRR_SYSC1RSTF_Pos)
#define RCC_FLAG_SYSC2RSTF              ((RCC_HWRSTSCLRR_FLAGS_ID   << 5UL) | RCC_HWRSTSCLRR_SYSC2RSTF_Pos)
#define RCC_FLAG_IWDG1RSTF              ((RCC_HWRSTSCLRR_FLAGS_ID   << 5UL) | RCC_HWRSTSCLRR_IWDG1SYSRSTF_Pos)
#define RCC_FLAG_IWDG2RSTF              ((RCC_HWRSTSCLRR_FLAGS_ID   << 5UL) | RCC_HWRSTSCLRR_IWDG2SYSRSTF_Pos)
#define RCC_FLAG_IWDG3RSTF              ((RCC_HWRSTSCLRR_FLAGS_ID   << 5UL) | RCC_HWRSTSCLRR_IWDG3SYSRSTF_Pos)
#define RCC_FLAG_IWDG4RSTF              ((RCC_HWRSTSCLRR_FLAGS_ID   << 5UL) | RCC_HWRSTSCLRR_IWDG4SYSRSTF_Pos)
#if defined(RCC_HWRSTSCLRR_IWDG5SYSRSTF_Pos)
#define RCC_FLAG_IWDG5RSTF              ((RCC_HWRSTSCLRR_FLAGS_ID   << 5UL) | RCC_HWRSTSCLRR_IWDG5SYSRSTF_Pos)
#endif /* RCC_HWRSTSCLRR_IWDG5SYSRSTF_Pos */
#define RCC_FLAG_C1RSTF                 ((RCC_C1HWRSTSCLRR_FLAGS_ID << 5UL) | RCC_C1HWRSTSCLRR_C1RSTF_Pos)
#define RCC_FLAG_C2RSTF                 ((RCC_C2HWRSTSCLRR_FLAGS_ID << 5UL) | RCC_C2HWRSTSCLRR_C2RSTF_Pos)
#define RCC_FLAG_C1P1RSTF               ((RCC_C1HWRSTSCLRR_FLAGS_ID << 5UL) | RCC_C1HWRSTSCLRR_C1P1RSTF_Pos)
#define RCC_FLAG_RETCRCERRRSTF          ((RCC_HWRSTSCLRR_FLAGS_ID   << 5UL) | RCC_HWRSTSCLRR_RETCRCERRRSTF_Pos)
#define RCC_FLAG_RETECCFAILCRCRSTF      ((RCC_HWRSTSCLRR_FLAGS_ID   << 5UL) | RCC_HWRSTSCLRR_RETECCFAILCRCRSTF_Pos)
#define RCC_FLAG_RETECCFAILRESTRSTF     ((RCC_HWRSTSCLRR_FLAGS_ID   << 5UL) | RCC_HWRSTSCLRR_RETECCFAILRESTRSTF_Pos)

#define RCC_FLAG_HSIRDY                 ((RCC_OCRDYR_FLAGS_ID       << 5UL) | RCC_OCRDYR_HSIRDY_Pos)
#if defined(RCC_D3DCR_FLAGS_ID)
#define RCC_FLAG_MSIRDY                 ((RCC_D3DCR_FLAGS_ID        << 5UL) | RCC_D3DCR_MSIRDY_Pos)
#elif defined(RCC_OCRDYR_FLAGS_ID)
#define RCC_FLAG_MSIRDY                 ((RCC_OCRDYR_FLAGS_ID       << 5UL) | RCC_OCRDYR_MSIRDY_Pos)
#endif /* RCC_OCRDYR_FLAGS_ID */
#define RCC_FLAG_HSERDY                 ((RCC_OCRDYR_FLAGS_ID       << 5UL) | RCC_OCRDYR_HSERDY_Pos)
#define RCC_FLAG_LSERDY                 ((RCC_BDCR_FLAGS_ID         << 5UL) | RCC_BDCR_LSERDY_Pos)
#if defined(RCC_BDCR_LSIRDY_Pos)
#define RCC_FLAG_LSIRDY                 ((RCC_BDCR_FLAGS_ID         << 5UL) | RCC_BDCR_LSIRDY_Pos)
#elif defined(RCC_LSICR_LSIRDY_Pos)
#define RCC_FLAG_LSIRDY                 ((RCC_LSICR_FLAGS_ID        << 5UL) | RCC_LSICR_LSIRDY_Pos)
#endif /* RCC_BDCR_LSIRDY_Pos */
#define RCC_FLAG_CKREST                 ((RCC_OCRDYR_FLAGS_ID       << 5UL) | RCC_OCRDYR_CKREST_Pos)

/**
  * @}
  */

/** @defgroup RCC_LSEDrive_Config LSE Drive Config
  * @{
  */
#define RCC_LSEDRIVE_LOW                 LL_RCC_LSEDRIVE_LOW        /*!< LSE low drive capability */
#define RCC_LSEDRIVE_MEDIUMHIGH          LL_RCC_LSEDRIVE_MEDIUMHIGH /*!< LSE medium high drive capability */
#define RCC_LSEDRIVE_MEDIUMLOW           LL_RCC_LSEDRIVE_MEDIUMLOW  /*!< LSE medium low drive capability */
#define RCC_LSEDRIVE_HIGH                LL_RCC_LSEDRIVE_HIGH       /*!< LSE high drive capability */
/**
  * @}
  */

