zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rcc.h
/** @defgroup RCC_Exported_Macros RCC Exported Macros
  * @{
  */
#if defined(RCC_D3DCR_FLAGS_ID)
#define __HAL_RCC_GET_FLAG(__FLAG__) (((((((__FLAG__) >> 5UL) == RCC_HWRSTSCLRR_FLAGS_ID  ) ? RCC->HWRSTSCLRR : \
                                         ((((__FLAG__) >> 5UL) == RCC_C1HWRSTSCLRR_FLAGS_ID) ? RCC->C1HWRSTSCLRR : \
                                          ((((__FLAG__) >> 5UL) == RCC_C2HWRSTSCLRR_FLAGS_ID) ? RCC->C2HWRSTSCLRR : \
                                           ((((__FLAG__) >> 5UL) == RCC_OCRDYR_FLAGS_ID      ) ? RCC->OCRDYR : \
                                            ((((__FLAG__) >> 5UL) == RCC_D3DCR_FLAGS_ID       ) ? RCC->D3DCR : \
                                             ((((__FLAG__) >> 5UL) == RCC_BDCR_FLAGS_ID        ) ? RCC->BDCR : \
                                              0U)))))) & (1UL << ((__FLAG__) & RCC_FLAG_MASK))) != 0U) ? SET : RESET)
#else
#define __HAL_RCC_GET_FLAG(__FLAG__) (((((((__FLAG__) >> 5UL) == RCC_HWRSTSCLRR_FLAGS_ID  ) ? RCC->HWRSTSCLRR : \
                                         ((((__FLAG__) >> 5UL) == RCC_C1HWRSTSCLRR_FLAGS_ID) ? RCC->C1HWRSTSCLRR : \
                                          ((((__FLAG__) >> 5UL) == RCC_C2HWRSTSCLRR_FLAGS_ID) ? RCC->C2HWRSTSCLRR : \
                                           ((((__FLAG__) >> 5UL) == RCC_OCRDYR_FLAGS_ID      ) ? RCC->OCRDYR : \
                                            ((((__FLAG__) >> 5UL) == RCC_LSICR_FLAGS_ID       ) ? RCC->LSICR : \
                                             ((((__FLAG__) >> 5UL) == RCC_BDCR_FLAGS_ID        ) ? RCC->BDCR : \
                                              0U)))))) & (1UL << ((__FLAG__) & RCC_FLAG_MASK))) != 0U) ? SET : RESET)
#endif /* RCC_D3DCR_FLAGS_ID */

#if defined(RCC_LSICR_LSION)
#define __HAL_RCC_LSI_ENABLE()  SET_BIT(RCC->LSICR, RCC_LSICR_LSION)
#define __HAL_RCC_LSI_DISABLE() CLEAR_BIT(RCC->LSICR, RCC_LSICR_LSION)
#elif defined(RCC_BDCR_LSION)
#define __HAL_RCC_LSI_ENABLE()  SET_BIT(RCC->BDCR, RCC_BDCR_LSION)
#define __HAL_RCC_LSI_DISABLE() CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSION)
#endif /* RCC_LSICR_LSION */
#define __HAL_RCC_HSI_CALIBRATIONVALUE_ADJUST(__HSICalibrationValue__) \
  MODIFY_REG(RCC->HSICFGR, RCC_HSICFGR_HSITRIM, \
             (uint32_t)(__HSICalibrationValue__) << RCC_HSICFGR_HSITRIM_Pos)
#define __HAL_RCC_MSI_CALIBRATIONVALUE_ADJUST(__MSICalibrationValue__) \
  MODIFY_REG(RCC->MSICFGR, RCC_MSICFGR_MSITRIM, \
             (uint32_t)(__MSICalibrationValue__) << RCC_MSICFGR_MSITRIM_Pos)
/**
  * @}
  */

/** @defgroup RCC_items RCC items
  * @brief RCC items to configure attributes on
  * @{
  */
#define RCC_HSI                        RCC_SECCFGR_HSISEC
#define RCC_HSE                        RCC_SECCFGR_HSESEC
#define RCC_MSI                        RCC_SECCFGR_MSISEC
#define RCC_LSI                        RCC_SECCFGR_LSISEC
#define RCC_LSE                        RCC_SECCFGR_LSESEC
#define RCC_SYSCLK                     RCC_SECCFGR_SYSCLKSEC
#define RCC_PRESC                      RCC_SECCFGR_PRESCSEC
#define RCC_PLL1                       RCC_SECCFGR_PLL1SEC
#define RCC_PLL2                       RCC_SECCFGR_PLL2SEC
#if defined(RCC_PLL3CFGR1_PLLEN)
#define RCC_PLL3                       RCC_SECCFGR_PLL3SEC
#endif /* RCC_PLL3CFGR1_PLLEN */
#define RCC_CLK48M                     RCC_SECCFGR_CLK48MSEC
#define RCC_HSI48                      RCC_SECCFGR_HSI48SEC
#define RCC_RMVF                       RCC_SECCFGR_RMVFSEC
#if defined(RCC_PLL3CFGR1_PLLEN)
#define RCC_ALL                        (RCC_HSI|RCC_HSE|RCC_MSI|RCC_LSI|RCC_LSE|RCC_HSI48| \
                                        RCC_SYSCLK|RCC_PRESC|RCC_PLL1|RCC_PLL2| \
                                        RCC_PLL3|RCC_CLK48M|RCC_RMVF)
#else
#define RCC_ALL                        (RCC_HSI|RCC_HSE|RCC_MSI|RCC_LSI|RCC_LSE|RCC_HSI48| \
                                        RCC_SYSCLK|RCC_PRESC|RCC_PLL1|RCC_PLL2| \
                                        RCC_CLK48M|RCC_RMVF)
#endif /* RCC_PLL3CFGR1_PLLEN */
/**
  * @}
  */

/** @defgroup RCC_HAL_EC_RIF_LOCALRES_ACCESS RCC HAL Filtering of Local Resource Access
  * @{
  */
/****************************************************************************/
/* WARNING about LEGACY constants !                                         */
/* FOR AVOIDING CONFUSION IN SECURITY & PRIVILEGE ACCESS FILTERING          */
/* - "NSEC" stands for "No Security Filtering for Local Resource Access",   */
/*   which means that not only "secure" but also "non-secure" accesses are  */
/*   allowed.                                                               */
/* - "NPRIV" stands for "No Privilege Filtering for Local Resource Access", */
/*   which means that not only "privileged" but also "not-privileged"       */
/*   accesses are allowed.                                                  */
/****************************************************************************/

#define RCC_LOCALRES_PRIV    0x00000E00U   /*!< Privilege attribute for Local Resource Access Filtering */
#define RCC_LOCALRES_NPRIV   0x00000300U   /*!< No Privilege attribute for Local Resource Access Filtering */
#define RCC_LOCALRES_NOPRIV  0x00000300U   /*!< No Privilege attribute for Local Resource Access Filtering */

#define RCC_LOCALRES_SEC     0x00005000U   /*!< Secure attribute for Local Resource Access Filtering */
#define RCC_LOCALRES_NSEC    0x00002000U   /*!< Unsecure/No Security attribute for Local Resource Access Filtering */
#define RCC_LOCALRES_NOSEC   0x00002000U   /*!< Unsecure/No Security attribute for Local Resource Access Filtering */

#define RCC_LOCALRES_LOCKED  0xDD000000U   /*!< Lock attribute for configuration of Local Resource Access Filtering */
/**
  * @}
  */

/** @defgroup RCC_HAL_EC_RIF_LOCALRES_ATTRIBUTES RCC HAL Attributes for Local Resource Access Filtering
  * @{
  */
#define RCC_LOCALRES_ATTR_NONE     0x00000000U   /*!< No Attribute value for Local Resource Access Filtering */
#define RCC_LOCALRES_ATTR_INVALID  0x2200008CU   /*!< Invalid Attribute value for Local Resource Access Filtering */

#define RCC_LOCALRES_ATTR_CID_TYPE_POS      (0U)
#define RCC_LOCALRES_ATTR_CID_TYPE_MSK      (0x3UL << RCC_LOCALRES_ATTR_CID_TYPE_POS)
#define RCC_LOCALRES_ATTR_STATIC_CID_POS    (4U)
#define RCC_LOCALRES_ATTR_STATIC_CID_MSK    (0x7UL << RCC_LOCALRES_ATTR_STATIC_CID_POS)
#define RCC_LOCALRES_ATTR_PRIV_POS          (8U)
#define RCC_LOCALRES_ATTR_PRIV_MSK          (0xFUL << RCC_LOCALRES_ATTR_PRIV_POS)
#define RCC_LOCALRES_ATTR_SEC_POS           (12U)
#define RCC_LOCALRES_ATTR_SEC_MSK           (0xFUL << RCC_LOCALRES_ATTR_SEC_POS)
#define RCC_LOCALRES_ATTR_DYNAMIC_CID_POS   (16U)
#define RCC_LOCALRES_ATTR_DYNAMIC_CID_MSK   (0xFFUL << RCC_LOCALRES_ATTR_DYNAMIC_CID_POS)
#define RCC_LOCALRES_ATTR_LOCK_POS          (24U)
#define RCC_LOCALRES_ATTR_LOCK_MSK          (0xFFUL << RCC_LOCALRES_ATTR_LOCK_POS)
/**
  * @}
  */
/**
  * @}
 */

/* Exported macros -----------------------------------------------------------*/

