zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rcc.h
/** @defgroup RCC_Exported_Macros RCC Exported Macros
  * @{
  */
#if defined(RCC_VDERAMCFGR_VDERAMEN)
#define __HAL_RCC_VDERAM_CLK_ENABLE()             SET_BIT(RCC->VDERAMCFGR, RCC_VDERAMCFGR_VDERAMEN)
#endif /* RCC_VDERAMCFGR_VDERAMEN */

#if defined(RCC_SERCCFGR_SERCEN)
#define __HAL_RCC_SERC_CLK_ENABLE()               SET_BIT(RCC->SERCCFGR, RCC_SERCCFGR_SERCEN)
#endif /* RCC_SERCCFGR_SERCEN */

#if defined(RCC_OSPIIOMCFGR_OSPIIOMEN)
#define __HAL_RCC_OSPIIOM_CLK_ENABLE()            SET_BIT(RCC->OSPIIOMCFGR, RCC_OSPIIOMCFGR_OSPIIOMEN)
#endif /*  */

#if defined(RCC_ETHSWCFGR_ETHSWMACEN)
#define __HAL_RCC_ETHSW_CLK_ENABLE()              SET_BIT(RCC->ETHSWCFGR, RCC_ETHSWCFGR_ETHSWMACEN|\
                                                          RCC_ETHSWCFGR_ETHSWEN|RCC_ETHSWCFGR_ETHSWREFEN)
#endif /* RCC_ETHSWCFGR_ETHSWMACEN */

#if defined(RCC_VDECCFGR_VDECEN)
#define __HAL_RCC_VDEC_CLK_ENABLE()               SET_BIT(RCC->VDECCFGR, RCC_VDECCFGR_VDECEN)
#endif /* RCC_VDECCFGR_VDECEN */

#if defined(RCC_VENCCFGR_VENCEN)
#define __HAL_RCC_VENC_CLK_ENABLE()               SET_BIT(RCC->VENCCFGR, RCC_VENCCFGR_VENCEN)
#endif /* RCC_VENCCFGR_VENCEN */

#if defined(RCC_C3CFGR_C3EN)
#define __HAL_RCC_C3_CLK_ENABLE()                 SET_BIT(RCC->C3CFGR, RCC_C3CFGR_C3EN)
#endif /* RCC_C3CFGR_C3EN */

#if defined(RCC_SYSRAMCFGR_SYSRAMEN)
#define __HAL_RCC_SYSRAM_CLK_ENABLE()             SET_BIT(RCC->SYSRAMCFGR, RCC_SYSRAMCFGR_SYSRAMEN)
#endif /* RCC_SYSRAMCFGR_SYSRAMEN */

#if defined(RCC_SRAM1CFGR_SRAM1EN)
#define __HAL_RCC_SRAM1_CLK_ENABLE()              SET_BIT(RCC->SRAM1CFGR, RCC_SRAM1CFGR_SRAM1EN)
#endif /* RCC_SRAM1CFGR_SRAM1EN */

#if defined(RCC_SRAM2CFGR_SRAM2EN)
#define __HAL_RCC_SRAM2_CLK_ENABLE()              SET_BIT(RCC->SRAM2CFGR, RCC_SRAM2CFGR_SRAM2EN)
#endif /* RCC_SRAM2CFGR_SRAM2EN */

#if defined(RCC_RETRAMCFGR_RETRAMEN)
#define __HAL_RCC_RETRAM_CLK_ENABLE()             SET_BIT(RCC->RETRAMCFGR, RCC_RETRAMCFGR_RETRAMEN)
#endif /* RCC_RETRAMCFGR_RETRAMEN */

#if defined(RCC_BKPSRAMCFGR_BKPSRAMEN)
#define __HAL_RCC_BKPSRAM_CLK_ENABLE()            SET_BIT(RCC->BKPSRAMCFGR, RCC_BKPSRAMCFGR_BKPSRAMEN)
#endif /* RCC_BKPSRAMCFGR_BKPSRAMEN */

#if defined(RCC_LPSRAM1CFGR_LPSRAM1EN)
#define __HAL_RCC_LPSRAM1_CLK_ENABLE()            SET_BIT(RCC->LPSRAM1CFGR, RCC_LPSRAM1CFGR_LPSRAM1EN)
#endif /* RCC_LPSRAM1CFGR_LPSRAM1EN */

#if defined(RCC_LPSRAM2CFGR_LPSRAM2EN)
#define __HAL_RCC_LPSRAM2_CLK_ENABLE()            SET_BIT(RCC->LPSRAM2CFGR, RCC_LPSRAM2CFGR_LPSRAM2EN)
#endif /* RCC_LPSRAM2CFGR_LPSRAM2EN */

#if defined(RCC_LPSRAM3CFGR_LPSRAM3EN)
#define __HAL_RCC_LPSRAM3_CLK_ENABLE()            SET_BIT(RCC->LPSRAM3CFGR, RCC_LPSRAM3CFGR_LPSRAM3EN)
#endif /* RCC_LPSRAM3CFGR_LPSRAM3EN */

#if defined(RCC_OSPI1CFGR_OSPI1EN)
#define __HAL_RCC_OSPI1_CLK_ENABLE()              SET_BIT(RCC->OSPI1CFGR, RCC_OSPI1CFGR_OSPI1EN)
#endif /* RCC_OSPI1CFGR_OSPI1EN */

#if defined(RCC_OSPI2CFGR_OSPI2EN)
#define __HAL_RCC_OSPI2_CLK_ENABLE()              SET_BIT(RCC->OSPI2CFGR, RCC_OSPI2CFGR_OSPI2EN)
#endif /* RCC_OSPI2CFGR_OSPI2EN */

#if defined(RCC_STMCFGR_STMEN)
#define __HAL_RCC_STM_CLK_ENABLE()             SET_BIT(RCC->STMCFGR, RCC_STMCFGR_STMEN)
#endif /* RCC_STMCFGR_STMEN */

#if defined(RCC_ETRCFGR_ETREN)
#define __HAL_RCC_ETR_CLK_ENABLE()                SET_BIT(RCC->ETRCFGR, RCC_ETRCFGR_ETREN)
#endif /* RCC_ETRCFGR_ETREN */

#if defined(RCC_GPIOACFGR_GPIOxEN)
#define __HAL_RCC_GPIOA_CLK_ENABLE()              SET_BIT(RCC->GPIOACFGR, RCC_GPIOACFGR_GPIOxEN)
#endif /* RCC_GPIOACFGR_GPIOxEN */

#if defined(RCC_GPIOBCFGR_GPIOxEN)
#define __HAL_RCC_GPIOB_CLK_ENABLE()              SET_BIT(RCC->GPIOBCFGR, RCC_GPIOBCFGR_GPIOxEN)
#endif /* RCC_GPIOBCFGR_GPIOxEN */

#if defined(RCC_GPIOCCFGR_GPIOxEN)
#define __HAL_RCC_GPIOC_CLK_ENABLE()              SET_BIT(RCC->GPIOCCFGR, RCC_GPIOCCFGR_GPIOxEN)
#endif /* RCC_GPIOCCFGR_GPIOxEN */

#if defined(RCC_GPIODCFGR_GPIOxEN)
#define __HAL_RCC_GPIOD_CLK_ENABLE()              SET_BIT(RCC->GPIODCFGR, RCC_GPIODCFGR_GPIOxEN)
#endif /* RCC_GPIODCFGR_GPIOxEN */

#if defined(RCC_GPIOECFGR_GPIOxEN)
#define __HAL_RCC_GPIOE_CLK_ENABLE()              SET_BIT(RCC->GPIOECFGR, RCC_GPIOECFGR_GPIOxEN)
#endif /* RCC_GPIOECFGR_GPIOxEN */

#if defined(RCC_GPIOFCFGR_GPIOxEN)
#define __HAL_RCC_GPIOF_CLK_ENABLE()              SET_BIT(RCC->GPIOFCFGR, RCC_GPIOFCFGR_GPIOxEN)
#endif /* RCC_GPIOFCFGR_GPIOxEN */

#if defined(RCC_GPIOGCFGR_GPIOxEN)
#define __HAL_RCC_GPIOG_CLK_ENABLE()              SET_BIT(RCC->GPIOGCFGR, RCC_GPIOGCFGR_GPIOxEN)
#endif /* RCC_GPIOGCFGR_GPIOxEN */

#if defined(RCC_GPIOHCFGR_GPIOxEN)
#define __HAL_RCC_GPIOH_CLK_ENABLE()              SET_BIT(RCC->GPIOHCFGR, RCC_GPIOHCFGR_GPIOxEN)
#endif /* RCC_GPIOHCFGR_GPIOxEN */

#if defined(RCC_GPIOICFGR_GPIOxEN)
#define __HAL_RCC_GPIOI_CLK_ENABLE()              SET_BIT(RCC->GPIOICFGR, RCC_GPIOICFGR_GPIOxEN)
#endif /* RCC_GPIOICFGR_GPIOxEN */

#if defined(RCC_GPIOJCFGR_GPIOxEN)
#define __HAL_RCC_GPIOJ_CLK_ENABLE()              SET_BIT(RCC->GPIOJCFGR, RCC_GPIOJCFGR_GPIOxEN)
#endif /* RCC_GPIOJCFGR_GPIOxEN */

#if defined(RCC_GPIOKCFGR_GPIOxEN)
#define __HAL_RCC_GPIOK_CLK_ENABLE()              SET_BIT(RCC->GPIOKCFGR, RCC_GPIOKCFGR_GPIOxEN)
#endif /* RCC_GPIOKCFGR_GPIOxEN */

#if defined(RCC_GPIOZCFGR_GPIOZEN)
#define __HAL_RCC_GPIOZ_CLK_ENABLE()              SET_BIT(RCC->GPIOZCFGR, RCC_GPIOZCFGR_GPIOZEN)
#endif /* RCC_GPIOZCFGR_GPIOZEN */

#if defined(RCC_HPDMA1CFGR_HPDMA1EN)
#define __HAL_RCC_HPDMA1_CLK_ENABLE()             SET_BIT(RCC->HPDMA1CFGR, RCC_HPDMA1CFGR_HPDMA1EN)
#endif /* RCC_HPDMA1CFGR_HPDMA1EN */

#if defined(RCC_HPDMA2CFGR_HPDMA2EN)
#define __HAL_RCC_HPDMA2_CLK_ENABLE()             SET_BIT(RCC->HPDMA2CFGR, RCC_HPDMA2CFGR_HPDMA2EN)
#endif /* RCC_HPDMA2CFGR_HPDMA2EN */

#if defined(RCC_HPDMA3CFGR_HPDMA3EN)
#define __HAL_RCC_HPDMA3_CLK_ENABLE()             SET_BIT(RCC->HPDMA3CFGR, RCC_HPDMA3CFGR_HPDMA3EN)
#endif /* RCC_HPDMA3CFGR_HPDMA3EN */

#if defined(RCC_LPDMACFGR_LPDMAEN)
#define __HAL_RCC_LPDMA_CLK_ENABLE()              SET_BIT(RCC->LPDMACFGR, RCC_LPDMACFGR_LPDMAEN)
#endif /* RCC_LPDMACFGR_LPDMAEN */

#if defined(RCC_HSEMCFGR_HSEMEN)
#define __HAL_RCC_HSEM_CLK_ENABLE()               SET_BIT(RCC->HSEMCFGR, RCC_HSEMCFGR_HSEMEN)
#endif /* RCC_HSEMCFGR_HSEMEN */

#if defined(RCC_IPCC1CFGR_IPCC1EN)
#define __HAL_RCC_IPCC1_CLK_ENABLE()              SET_BIT(RCC->IPCC1CFGR, RCC_IPCC1CFGR_IPCC1EN)
#endif /* RCC_IPCC1CFGR_IPCC1EN */

#if defined(RCC_IPCC2CFGR_IPCC2EN)
#define __HAL_RCC_IPCC2_CLK_ENABLE()              SET_BIT(RCC->IPCC2CFGR, RCC_IPCC2CFGR_IPCC2EN)
#endif /* RCC_IPCC2CFGR_IPCC2EN */

#if defined(RCC_RTCCFGR_RTCEN)
#define __HAL_RCC_RTC_CLK_ENABLE()                SET_BIT(RCC->RTCCFGR, RCC_RTCCFGR_RTCEN)
#endif /* RCC_RTCCFGR_RTCEN */

#if defined(RCC_SYSCPU1CFGR_SYSCPU1EN)
#define __HAL_RCC_SYSCPU1_CLK_ENABLE()            SET_BIT(RCC->SYSCPU1CFGR, RCC_SYSCPU1CFGR_SYSCPU1EN)
#endif /* RCC_SYSCPU1CFGR_SYSCPU1EN */

#if defined(RCC_IS2MCFGR_IS2MEN)
#define __HAL_RCC_IS2M_CLK_ENABLE()               SET_BIT(RCC->IS2MCFGR, RCC_IS2MCFGR_IS2MEN)
#endif /* RCC_IS2MCFGR_IS2MEN */

#if defined(RCC_TIM1CFGR_TIM1EN)
#define __HAL_RCC_TIM1_CLK_ENABLE()               SET_BIT(RCC->TIM1CFGR, RCC_TIM1CFGR_TIM1EN)
#endif /* RCC_TIM1CFGR_TIM1EN */

#if defined(RCC_TIM2CFGR_TIM2EN)
#define __HAL_RCC_TIM2_CLK_ENABLE()               SET_BIT(RCC->TIM2CFGR, RCC_TIM2CFGR_TIM2EN)
#endif /* RCC_TIM2CFGR_TIM2EN */

#if defined(RCC_TIM3CFGR_TIM3EN)
#define __HAL_RCC_TIM3_CLK_ENABLE()               SET_BIT(RCC->TIM3CFGR, RCC_TIM3CFGR_TIM3EN)
#endif /* RCC_TIM3CFGR_TIM3EN */

#if defined(RCC_TIM4CFGR_TIM4EN)
#define __HAL_RCC_TIM4_CLK_ENABLE()               SET_BIT(RCC->TIM4CFGR, RCC_TIM4CFGR_TIM4EN)
#endif /* RCC_TIM4CFGR_TIM4EN */

#if defined(RCC_TIM5CFGR_TIM5EN)
#define __HAL_RCC_TIM5_CLK_ENABLE()               SET_BIT(RCC->TIM5CFGR, RCC_TIM5CFGR_TIM5EN)
#endif /* RCC_TIM5CFGR_TIM5EN */

#if defined(RCC_TIM6CFGR_TIM6EN)
#define __HAL_RCC_TIM6_CLK_ENABLE()               SET_BIT(RCC->TIM6CFGR, RCC_TIM6CFGR_TIM6EN)
#endif /* RCC_TIM6CFGR_TIM6EN */

#if defined(RCC_TIM7CFGR_TIM7EN)
#define __HAL_RCC_TIM7_CLK_ENABLE()               SET_BIT(RCC->TIM7CFGR, RCC_TIM7CFGR_TIM7EN)
#endif /* RCC_TIM7CFGR_TIM7EN */

