zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rcc.h
#if defined(RCC_TIM8CFGR_TIM8EN)
#define __HAL_RCC_TIM8_CLK_ENABLE()               SET_BIT(RCC->TIM8CFGR, RCC_TIM8CFGR_TIM8EN)
#endif /* RCC_TIM8CFGR_TIM8EN */

#if defined(RCC_TIM10CFGR_TIM10EN)
#define __HAL_RCC_TIM10_CLK_ENABLE()              SET_BIT(RCC->TIM10CFGR, RCC_TIM10CFGR_TIM10EN)
#endif /* RCC_TIM10CFGR_TIM10EN */

#if defined(RCC_TIM11CFGR_TIM11EN)
#define __HAL_RCC_TIM11_CLK_ENABLE()              SET_BIT(RCC->TIM11CFGR, RCC_TIM11CFGR_TIM11EN)
#endif /* RCC_TIM11CFGR_TIM11EN */

#if defined(RCC_TIM12CFGR_TIM12EN)
#define __HAL_RCC_TIM12_CLK_ENABLE()              SET_BIT(RCC->TIM12CFGR, RCC_TIM12CFGR_TIM12EN)
#endif /* RCC_TIM12CFGR_TIM12EN */

#if defined(RCC_TIM13CFGR_TIM13EN)
#define __HAL_RCC_TIM13_CLK_ENABLE()              SET_BIT(RCC->TIM13CFGR, RCC_TIM13CFGR_TIM13EN)
#endif /* RCC_TIM13CFGR_TIM13EN */

#if defined(RCC_TIM14CFGR_TIM14EN)
#define __HAL_RCC_TIM14_CLK_ENABLE()              SET_BIT(RCC->TIM14CFGR, RCC_TIM14CFGR_TIM14EN)
#endif /* RCC_TIM14CFGR_TIM14EN */

#if defined(RCC_TIM15CFGR_TIM15EN)
#define __HAL_RCC_TIM15_CLK_ENABLE()              SET_BIT(RCC->TIM15CFGR, RCC_TIM15CFGR_TIM15EN)
#endif /* RCC_TIM15CFGR_TIM15EN */

#if defined(RCC_TIM16CFGR_TIM16EN)
#define __HAL_RCC_TIM16_CLK_ENABLE()              SET_BIT(RCC->TIM16CFGR, RCC_TIM16CFGR_TIM16EN)
#endif /* RCC_TIM16CFGR_TIM16EN */

#if defined(RCC_TIM17CFGR_TIM17EN)
#define __HAL_RCC_TIM17_CLK_ENABLE()              SET_BIT(RCC->TIM17CFGR, RCC_TIM17CFGR_TIM17EN)
#endif /* RCC_TIM17CFGR_TIM17EN */

#if defined(RCC_TIM20CFGR_TIM20EN)
#define __HAL_RCC_TIM20_CLK_ENABLE()              SET_BIT(RCC->TIM20CFGR, RCC_TIM20CFGR_TIM20EN)
#endif /* RCC_TIM20CFGR_TIM20EN */

#define __HAL_RCC_LPTIM1_CLK_ENABLE()             SET_BIT(RCC->LPTIM1CFGR, RCC_LPTIM1CFGR_LPTIM1EN)
#define __HAL_RCC_LPTIM2_CLK_ENABLE()             SET_BIT(RCC->LPTIM2CFGR, RCC_LPTIM2CFGR_LPTIM2EN)
#define __HAL_RCC_LPTIM3_CLK_ENABLE()             SET_BIT(RCC->LPTIM3CFGR, RCC_LPTIM3CFGR_LPTIM3EN)
#define __HAL_RCC_LPTIM4_CLK_ENABLE()             SET_BIT(RCC->LPTIM4CFGR, RCC_LPTIM4CFGR_LPTIM4EN)
#define __HAL_RCC_LPTIM5_CLK_ENABLE()             SET_BIT(RCC->LPTIM5CFGR, RCC_LPTIM5CFGR_LPTIM5EN)
#define __HAL_RCC_SPI1_CLK_ENABLE()               SET_BIT(RCC->SPI1CFGR, RCC_SPI1CFGR_SPI1EN)
#define __HAL_RCC_SPI2_CLK_ENABLE()               SET_BIT(RCC->SPI2CFGR, RCC_SPI2CFGR_SPI2EN)
#define __HAL_RCC_SPI3_CLK_ENABLE()               SET_BIT(RCC->SPI3CFGR, RCC_SPI3CFGR_SPI3EN)
#define __HAL_RCC_SPI4_CLK_ENABLE()               SET_BIT(RCC->SPI4CFGR, RCC_SPI4CFGR_SPI4EN)
#define __HAL_RCC_SPI5_CLK_ENABLE()               SET_BIT(RCC->SPI5CFGR, RCC_SPI5CFGR_SPI5EN)
#define __HAL_RCC_SPI6_CLK_ENABLE()               SET_BIT(RCC->SPI6CFGR, RCC_SPI6CFGR_SPI6EN)

#if defined(RCC_SPI7CFGR_SPI7EN)
#define __HAL_RCC_SPI7_CLK_ENABLE()               SET_BIT(RCC->SPI7CFGR, RCC_SPI7CFGR_SPI7EN)
#endif /* RCC_SPI7CFGR_SPI7EN */

#if defined(RCC_SPI8CFGR_SPI8EN)
#define __HAL_RCC_SPI8_CLK_ENABLE()               SET_BIT(RCC->SPI8CFGR, RCC_SPI8CFGR_SPI8EN)
#endif /* RCC_SPI7CFGR_SPI8EN */

#define __HAL_RCC_SPDIFRX_CLK_ENABLE()            SET_BIT(RCC->SPDIFRXCFGR, RCC_SPDIFRXCFGR_SPDIFRXEN)
#define __HAL_RCC_USART1_CLK_ENABLE()             SET_BIT(RCC->USART1CFGR, RCC_USART1CFGR_USART1EN)
#define __HAL_RCC_USART2_CLK_ENABLE()             SET_BIT(RCC->USART2CFGR, RCC_USART2CFGR_USART2EN)
#define __HAL_RCC_USART3_CLK_ENABLE()             SET_BIT(RCC->USART3CFGR, RCC_USART3CFGR_USART3EN)
#define __HAL_RCC_UART4_CLK_ENABLE()              SET_BIT(RCC->UART4CFGR, RCC_UART4CFGR_UART4EN)
#define __HAL_RCC_UART5_CLK_ENABLE()              SET_BIT(RCC->UART5CFGR, RCC_UART5CFGR_UART5EN)
#define __HAL_RCC_USART6_CLK_ENABLE()             SET_BIT(RCC->USART6CFGR, RCC_USART6CFGR_USART6EN)
#define __HAL_RCC_UART7_CLK_ENABLE()              SET_BIT(RCC->UART7CFGR, RCC_UART7CFGR_UART7EN)

#if defined(RCC_UART8CFGR_UART8EN)
#define __HAL_RCC_UART8_CLK_ENABLE()              SET_BIT(RCC->UART8CFGR, RCC_UART8CFGR_UART8EN)
#endif /* RCC_UART8CFGR_UART8EN  */

#if defined(RCC_UART9CFGR_UART9EN)
#define __HAL_RCC_UART9_CLK_ENABLE()              SET_BIT(RCC->UART9CFGR, RCC_UART9CFGR_UART9EN)
#endif /*  RCC_UART9CFGR_UART9EN */

#define __HAL_RCC_LPUART1_CLK_ENABLE()            SET_BIT(RCC->LPUART1CFGR, RCC_LPUART1CFGR_LPUART1EN)
#define __HAL_RCC_I2C1_CLK_ENABLE()               SET_BIT(RCC->I2C1CFGR, RCC_I2C1CFGR_I2C1EN)
#define __HAL_RCC_I2C2_CLK_ENABLE()               SET_BIT(RCC->I2C2CFGR, RCC_I2C2CFGR_I2C2EN)
#define __HAL_RCC_I2C3_CLK_ENABLE()               SET_BIT(RCC->I2C3CFGR, RCC_I2C3CFGR_I2C3EN)

#if defined(RCC_I2C4CFGR_I2C4EN)
#define __HAL_RCC_I2C4_CLK_ENABLE()               SET_BIT(RCC->I2C4CFGR, RCC_I2C4CFGR_I2C4EN)
#endif /*  RCC_I2C4CFGR_I2C4EN */

#if defined(RCC_I2C5CFGR_I2C5EN)
#define __HAL_RCC_I2C5_CLK_ENABLE()               SET_BIT(RCC->I2C5CFGR, RCC_I2C5CFGR_I2C5EN)
#endif /* RCC_I2C5CFGR_I2C5EN  */

#if defined(RCC_I2C6CFGR_I2C6EN)
#define __HAL_RCC_I2C6_CLK_ENABLE()               SET_BIT(RCC->I2C6CFGR, RCC_I2C6CFGR_I2C6EN)
#endif /* RCC_I2C6CFGR_I2C6EN  */

#if defined(RCC_I2C7CFGR_I2C7EN)
#define __HAL_RCC_I2C7_CLK_ENABLE()               SET_BIT(RCC->I2C7CFGR, RCC_I2C7CFGR_I2C7EN)
#endif /* RCC_I2C7CFGR_I2C7EN  */

#if defined(RCC_I2C8CFGR_I2C8EN)
#define __HAL_RCC_I2C8_CLK_ENABLE()               SET_BIT(RCC->I2C8CFGR, RCC_I2C8CFGR_I2C8EN)
#endif /* RCC_I2C8CFGR_I2C8EN  */

#define __HAL_RCC_SAI1_CLK_ENABLE()               SET_BIT(RCC->SAI1CFGR, RCC_SAI1CFGR_SAI1EN)
#define __HAL_RCC_SAI2_CLK_ENABLE()               SET_BIT(RCC->SAI2CFGR, RCC_SAI2CFGR_SAI2EN)
#define __HAL_RCC_SAI3_CLK_ENABLE()               SET_BIT(RCC->SAI3CFGR, RCC_SAI3CFGR_SAI3EN)
#define __HAL_RCC_SAI4_CLK_ENABLE()               SET_BIT(RCC->SAI4CFGR, RCC_SAI4CFGR_SAI4EN)
#define __HAL_RCC_MDF1_CLK_ENABLE()               SET_BIT(RCC->MDF1CFGR, RCC_MDF1CFGR_MDF1EN)
#define __HAL_RCC_ADF1_CLK_ENABLE()               SET_BIT(RCC->ADF1CFGR, RCC_ADF1CFGR_ADF1EN)
#define __HAL_RCC_FDCAN_CLK_ENABLE()              SET_BIT(RCC->FDCANCFGR, RCC_FDCANCFGR_FDCANEN)
#define __HAL_RCC_HDP_CLK_ENABLE()                SET_BIT(RCC->HDPCFGR, RCC_HDPCFGR_HDPEN)

