zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rcc.h
#if defined(RCC_ADC1CFGR_ADC1EN)
#define __HAL_RCC_ADC1_CLK_ENABLE()               SET_BIT(RCC->ADC1CFGR, RCC_ADC1CFGR_ADC1EN)
#endif /* RCC_ADC1CFGR_ADC1EN */

#if defined(RCC_ADC2CFGR_ADC2EN)
#define __HAL_RCC_ADC2_CLK_ENABLE()               SET_BIT(RCC->ADC2CFGR, RCC_ADC2CFGR_ADC2EN)
#endif /* RCC_ADC12CFGR_ADC3EN */

#if defined(RCC_ADC12CFGR_ADC12EN)
#define __HAL_RCC_ADC12_CLK_ENABLE()              SET_BIT(RCC->ADC12CFGR, RCC_ADC12CFGR_ADC12EN)
#endif /* RCC_ADC12CFGR_ADC12EN */

#if defined(RCC_ADC3CFGR_ADC3EN)
#define __HAL_RCC_ADC3_CLK_ENABLE()               SET_BIT(RCC->ADC3CFGR, RCC_ADC3CFGR_ADC3EN)
#endif /* RCC_ADC3CFGR_ADC3EN */

#define __HAL_RCC_ETH1_CLK_ENABLE()               SET_BIT(RCC->ETH1CFGR, RCC_ETH1CFGR_ETH1EN)
#define __HAL_RCC_ETH1MAC_CLK_ENABLE()            SET_BIT(RCC->ETH1CFGR, RCC_ETH1CFGR_ETH1MACEN)
#define __HAL_RCC_ETH1TX_CLK_ENABLE()             SET_BIT(RCC->ETH1CFGR, RCC_ETH1CFGR_ETH1TXEN)
#define __HAL_RCC_ETH1RX_CLK_ENABLE()             SET_BIT(RCC->ETH1CFGR, RCC_ETH1CFGR_ETH1RXEN)
#define __HAL_RCC_ETH2_CLK_ENABLE()               SET_BIT(RCC->ETH2CFGR, RCC_ETH2CFGR_ETH2EN)
#define __HAL_RCC_ETH2MAC_CLK_ENABLE()            SET_BIT(RCC->ETH2CFGR, RCC_ETH2CFGR_ETH2MACEN)
#define __HAL_RCC_ETH2TX_CLK_ENABLE()             SET_BIT(RCC->ETH2CFGR, RCC_ETH2CFGR_ETH2TXEN)
#define __HAL_RCC_ETH2RX_CLK_ENABLE()             SET_BIT(RCC->ETH2CFGR, RCC_ETH2CFGR_ETH2RXEN)


#if defined(RCC_USBHCFGR_USBHEN)
#define __HAL_RCC_USBH_CLK_ENABLE()               SET_BIT(RCC->USBHCFGR, RCC_USBHCFGR_USBHEN)
#endif /* RCC_USBHCFGR_USBHEN */

#define __HAL_RCC_USB2PHY1_CLK_ENABLE()           SET_BIT(RCC->USB2PHY1CFGR, RCC_USB2PHY1CFGR_USB2PHY1EN)
#define __HAL_RCC_USB2PHY2_CLK_ENABLE()           SET_BIT(RCC->USB2PHY2CFGR, RCC_USB2PHY2CFGR_USB2PHY2EN)

#if defined(RCC_OTGCFGR_OTGEN)
#define __HAL_RCC_OTG_CLK_ENABLE()                SET_BIT(RCC->OTGCFGR, RCC_OTGCFGR_OTGEN)
#endif /* RCC_OTGCFGR_OTGEN */

#if defined(RCC_USB3DRDCFGR_USB3DRDEN)
#define __HAL_RCC_USB3DRD_CLK_ENABLE()            SET_BIT(RCC->USB3DRDCFGR, RCC_USB3DRDCFGR_USB3DRDEN)
#endif /* RCC_USB3DRDCFGR_USB3DRDEN */

#if defined(RCC_USB3PCIEPHYCFGR_USB3PCIEPHYEN)
#define __HAL_RCC_USB3PCIEPHY_CLK_ENABLE()        SET_BIT(RCC->USB3PCIEPHYCFGR, RCC_USB3PCIEPHYCFGR_USB3PCIEPHYEN)
#endif /* RCC_USB3PCIEPHYCFGR_USB3PCIEPHYEN */

#if defined(RCC_PCIECFGR_PCIEEN)
#define __HAL_RCC_PCIE_CLK_ENABLE()               SET_BIT(RCC->PCIECFGR, RCC_PCIECFGR_PCIEEN)
#endif /* RCC_PCIECFGR_PCIEEN */

#if defined(RCC_UCPDCFGR_UCPDEN)
#define __HAL_RCC_UCPD1_CLK_ENABLE()              SET_BIT(RCC->UCPDCFGR, RCC_UCPDCFGR_UCPDEN)
#endif /* RCC_UCPDCFGR_UCPDEN */

#define __HAL_RCC_FMC_CLK_ENABLE()                SET_BIT(RCC->FMCCFGR, RCC_FMCCFGR_FMCEN)
#define __HAL_RCC_SDMMC1_CLK_ENABLE()             SET_BIT(RCC->SDMMC1CFGR, RCC_SDMMC1CFGR_SDMMC1EN)
#define __HAL_RCC_SDMMC2_CLK_ENABLE()             SET_BIT(RCC->SDMMC2CFGR, RCC_SDMMC2CFGR_SDMMC2EN)
#define __HAL_RCC_SDMMC3_CLK_ENABLE()             SET_BIT(RCC->SDMMC3CFGR, RCC_SDMMC3CFGR_SDMMC3EN)
#define __HAL_RCC_GPU_CLK_ENABLE()                SET_BIT(RCC->GPUCFGR, RCC_GPUCFGR_GPUEN)
#define __HAL_RCC_LTDC_CLK_ENABLE()               SET_BIT(RCC->LTDCCFGR, RCC_LTDCCFGR_LTDCEN)

#if defined(RCC_DSICFGR_DSIEN)
#define __HAL_RCC_DSI_CLK_ENABLE()                SET_BIT(RCC->DSICFGR, RCC_DSICFGR_DSIEN)
#endif /* RCC_DSICFGR_DSIEN */

#define __HAL_RCC_LVDS_CLK_ENABLE()               SET_BIT(RCC->LVDSCFGR, RCC_LVDSCFGR_LVDSEN)

#if defined(RCC_CSICFGR_CSIEN)
#define __HAL_RCC_CSI_CLK_ENABLE()                SET_BIT(RCC->CSICFGR, RCC_CSICFGR_CSIEN)
#endif /* RCC_CSICFGR_CSIEN */

#if defined(RCC_CSI2CFGR_CSI2EN)
#define __HAL_RCC_CSI2_CLK_ENABLE()               SET_BIT(RCC->CSI2CFGR, RCC_CSI2CFGR_CSI2EN)
#endif /* RCC_CSI2CFGR_CSI2EN */

#define __HAL_RCC_DCMIPP_CLK_ENABLE()             SET_BIT(RCC->DCMIPPCFGR, RCC_DCMIPPCFGR_DCMIPPEN)

#if defined(RCC_DCMIPSSICFGR_DCMIPSSIEN)
#define __HAL_RCC_DCMIPSSI_CLK_ENABLE()           SET_BIT(RCC->DCMIPSSICFGR, RCC_DCMIPSSICFGR_DCMIPSSIEN)
#endif /* RCC_DCMIPSSICFGR_DCMIPSSIEN */

#if defined(RCC_CCICFGR_CCIEN)
#define __HAL_RCC_CCI_CLK_ENABLE()                SET_BIT(RCC->CCICFGR, RCC_CCICFGR_CCIEN)
#endif /* RCC_CCICFGR_CCIEN */

#if defined(RCC_RNGCFGR_RNGEN)
#define __HAL_RCC_RNG_CLK_ENABLE()                SET_BIT(RCC->RNGCFGR, RCC_RNGCFGR_RNGEN)
#endif /* RCC_RNGCFGR_RNGEN */

#if defined(RCC_RNG1CFGR_RNG1EN)
#define __HAL_RCC_RNG1_CLK_ENABLE()               SET_BIT(RCC->RNG1CFGR, RCC_RNG1CFGR_RNG1EN)
#endif /* RCC_RNG1CFGR_RNG1EN */

#if defined(RCC_RNG2CFGR_RNG2EN)
#define __HAL_RCC_RNG2_CLK_ENABLE()               SET_BIT(RCC->RNG2CFGR, RCC_RNG2CFGR_RNG2EN)
#endif /* RCC_RNG2CFGR_RNG2EN */

#define __HAL_RCC_PKA_CLK_ENABLE()                SET_BIT(RCC->PKACFGR, RCC_PKACFGR_PKAEN)
#define __HAL_RCC_SAES_CLK_ENABLE()               SET_BIT(RCC->SAESCFGR, RCC_SAESCFGR_SAESEN)

#if defined(RCC_HASHCFGR_HASHEN)
#define __HAL_RCC_HASH_CLK_ENABLE()               SET_BIT(RCC->HASHCFGR, RCC_HASHCFGR_HASHEN)
#endif /* RCC_HASHCFGR_HASHEN */

#if defined(RCC_HASH1CFGR_HASH1EN)
#define __HAL_RCC_HASH1_CLK_ENABLE()              SET_BIT(RCC->HASH1CFGR, RCC_HASH1CFGR_HASH1EN)
#endif /* RCC_HASH1CFGR_HASH1EN */

#if defined (RCC_HASH2CFGR_HASH2EN)
#define __HAL_RCC_HASH2_CLK_ENABLE()              SET_BIT(RCC->HASH2CFGR, RCC_HASH2CFGR_HASH2EN)
#endif /* RCC_HASH2CFGR_HASH2EN */

#define __HAL_RCC_CRYP1_CLK_ENABLE()              SET_BIT(RCC->CRYP1CFGR, RCC_CRYP1CFGR_CRYP1EN)
#define __HAL_RCC_CRYP2_CLK_ENABLE()              SET_BIT(RCC->CRYP2CFGR, RCC_CRYP2CFGR_CRYP2EN)
#define __HAL_RCC_IWDG1_CLK_ENABLE()              SET_BIT(RCC->IWDG1CFGR, RCC_IWDG1CFGR_IWDG1EN)
#define __HAL_RCC_IWDG2_CLK_ENABLE()              SET_BIT(RCC->IWDG2CFGR, RCC_IWDG2CFGR_IWDG2EN)
#define __HAL_RCC_IWDG3_CLK_ENABLE()              SET_BIT(RCC->IWDG3CFGR, RCC_IWDG3CFGR_IWDG3EN)
#define __HAL_RCC_IWDG4_CLK_ENABLE()              SET_BIT(RCC->IWDG4CFGR, RCC_IWDG4CFGR_IWDG4EN)

#if defined(RCC_IWDG5CFGR_IWDG5EN)
#define __HAL_RCC_IWDG5_CLK_ENABLE()              SET_BIT(RCC->IWDG5CFGR, RCC_IWDG5CFGR_IWDG5EN)
#endif /* RCC_IWDG5CFGR_IWDG5EN */

#define __HAL_RCC_WWDG1_CLK_ENABLE()              SET_BIT(RCC->WWDG1CFGR, RCC_WWDG1CFGR_WWDG1EN)

#if defined(RCC_WWDG2CFGR_WWDG2EN)
#define __HAL_RCC_WWDG2_CLK_ENABLE()              SET_BIT(RCC->WWDG2CFGR, RCC_WWDG2CFGR_WWDG2EN)
#endif /* RCC_WWDG2CFGR_WWDG2EN */

#if defined(RCC_BUSPERFMCFGR_BUSPERFMEN)
#define __HAL_RCC_BUSPERFM_CLK_ENABLE()           SET_BIT(RCC->BUSPERFMCFGR, RCC_BUSPERFMCFGR_BUSPERFMEN)
#endif /* RCC_BUSPERFMCFGR_BUSPERFMEN */

#define __HAL_RCC_VREF_CLK_ENABLE()               SET_BIT(RCC->VREFCFGR, RCC_VREFCFGR_VREFEN)

