zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rcc.h
#if defined (RCC_TMPSENSCFGR_TMPSENSEN)
#define __HAL_RCC_TMPSENS_CLK_ENABLE()            SET_BIT(RCC->TMPSENSCFGR, RCC_TMPSENSCFGR_TMPSENSEN)
#endif /* RCC_TMPSENSCFGR_TMPSENSEN */

#define __HAL_RCC_CRC_CLK_ENABLE()                SET_BIT(RCC->CRCCFGR, RCC_CRCCFGR_CRCEN)
#define __HAL_RCC_BSEC_CLK_ENABLE()               SET_BIT(RCC->BSECCFGR, RCC_BSECCFGR_BSECEN)

#if defined(RCC_GICV2MCFGR_GICV2MEN)
#define __HAL_RCC_GICV2M_CLK_ENABLE()             SET_BIT(RCC->GICV2MCFGR, RCC_GICV2MCFGR_GICV2MEN)
#endif /* RCC_GICV2MCFGR_GICV2MEN */

#define __HAL_RCC_I3C1_CLK_ENABLE()               SET_BIT(RCC->I3C1CFGR, RCC_I3C1CFGR_I3C1EN)
#define __HAL_RCC_I3C2_CLK_ENABLE()               SET_BIT(RCC->I3C2CFGR, RCC_I3C2CFGR_I3C2EN)
#define __HAL_RCC_I3C3_CLK_ENABLE()               SET_BIT(RCC->I3C3CFGR, RCC_I3C3CFGR_I3C3EN)

#if defined(RCC_I3C4CFGR_I3C4EN)
#define __HAL_RCC_I3C4_CLK_ENABLE()               SET_BIT(RCC->I3C4CFGR, RCC_I3C4CFGR_I3C4EN)
#endif /* RCC_I3C4CFGR_I3C4EN */

#define __HAL_RCC_HSE_KER_CLK_ENABLE()            SET_BIT(RCC->OCENSETR, RCC_OCENSETR_HSEKERON)
#define __HAL_RCC_HSI_KER_CLK_ENABLE()            SET_BIT(RCC->OCENSETR, RCC_OCENSETR_HSIKERON)

#if defined(RCC_D3DCR_MSIKERON)
#define __HAL_RCC_MSI_KER_CLK_ENABLE()            SET_BIT(RCC->D3DCR, RCC_D3DCR_MSIKERON)
#elif defined(RCC_OCENCLRR_MSIKERON)
#define __HAL_RCC_MSI_KER_CLK_ENABLE()            SET_BIT(RCC->OCENSETR, RCC_OCENCLRR_MSIKERON)
#endif /* RCC_OCENCLRR_MSIKERON */

/* for API backward compatibility */
#if defined(RCC_DCMIPSSICFGR_DCMIPSSIEN)
#define __HAL_RCC_DCMI_CLK_ENABLE()               __HAL_RCC_DCMIPSSI_CLK_ENABLE()
#define __HAL_RCC_PSSI_CLK_ENABLE()               __HAL_RCC_DCMIPSSI_CLK_ENABLE()
#endif /* (RCC_DCMIPSSICFGR_DCMIPSSIEN) */

#if defined(RCC_CCICFGR_CCIEN)
#define __HAL_RCC_DCMI_CLK_ENABLE()               __HAL_RCC_CCI_CLK_ENABLE()
#define __HAL_RCC_PSSI_CLK_ENABLE()               __HAL_RCC_CCI_CLK_ENABLE()
#endif /* RCC_CCICFGR_CCIEN */

#if defined(RCC_OSPI1CFGR_OSPI1EN)
#define __HAL_RCC_OTFDEC1_CLK_ENABLE()            __HAL_RCC_OSPI1_CLK_ENABLE()
#endif /* RCC_OSPI1CFGR_OSPI1EN */

#if defined(RCC_OSPI2CFGR_OSPI2EN)
#define __HAL_RCC_OTFDEC2_CLK_ENABLE()            __HAL_RCC_OSPI2_CLK_ENABLE()
#endif /* RCC_OSPI2CFGR_OSPI2EN */

/* Clock disable macros */
#if defined(RCC_VDERAMCFGR_VDERAMEN)
#define __HAL_RCC_VDERAM_CLK_DISABLE()            CLEAR_BIT(RCC->VDERAMCFGR, RCC_VDERAMCFGR_VDERAMEN)
#endif /* RCC_VDERAMCFGR_VDERAMEN */

#define __HAL_RCC_SERC_CLK_DISABLE()              CLEAR_BIT(RCC->SERCCFGR, RCC_SERCCFGR_SERCEN)
#define __HAL_RCC_OSPIIOM_CLK_DISABLE()           CLEAR_BIT(RCC->OSPIIOMCFGR, RCC_OSPIIOMCFGR_OSPIIOMEN)
#define __HAL_RCC_ETHSW_CLK_DISABLE()             CLEAR_BIT(RCC->ETHSWCFGR, RCC_ETHSWCFGR_ETHSWMACEN|\
                                                            RCC_ETHSWCFGR_ETHSWEN|RCC_ETHSWCFGR_ETHSWREFEN)
#define __HAL_RCC_VDEC_CLK_DISABLE()              CLEAR_BIT(RCC->VDECCFGR, RCC_VDECCFGR_VDECEN)

#if defined(RCC_VENCCFGR_VENCEN)
#define __HAL_RCC_VENC_CLK_DISABLE()              CLEAR_BIT(RCC->VENCCFGR, RCC_VENCCFGR_VENCEN)
#endif /* RCC_VENCCFGR_VENCEN */

#if defined(RCC_C3CFGR_C3EN)
#define __HAL_RCC_C3_CLK_DISABLE()                CLEAR_BIT(RCC->C3CFGR, RCC_C3CFGR_C3EN)
#endif /* RCC_C3CFGR_C3EN */

#define __HAL_RCC_SYSRAM_CLK_DISABLE()            CLEAR_BIT(RCC->SYSRAMCFGR, RCC_SYSRAMCFGR_SYSRAMEN)
#define __HAL_RCC_SRAM1_CLK_DISABLE()             CLEAR_BIT(RCC->SRAM1CFGR, RCC_SRAM1CFGR_SRAM1EN)

#if defined(RCC_SRAM2CFGR_SRAM2EN)
#define __HAL_RCC_SRAM2_CLK_DISABLE()             CLEAR_BIT(RCC->SRAM2CFGR, RCC_SRAM2CFGR_SRAM2EN)
#endif /* RCC_SRAM2CFGR_SRAM2EN */

#define __HAL_RCC_RETRAM_CLK_DISABLE()            CLEAR_BIT(RCC->RETRAMCFGR, RCC_RETRAMCFGR_RETRAMEN)
#define __HAL_RCC_BKPSRAM_CLK_DISABLE()           CLEAR_BIT(RCC->BKPSRAMCFGR, RCC_BKPSRAMCFGR_BKPSRAMEN)

#if defined(RCC_LPSRAM1CFGR_LPSRAM1EN)
#define __HAL_RCC_LPSRAM1_CLK_DISABLE()           CLEAR_BIT(RCC->LPSRAM1CFGR, RCC_LPSRAM1CFGR_LPSRAM1EN)
#endif /* RCC_LPSRAM1CFGR_LPSRAM1EN */

#if defined(RCC_LPSRAM2CFGR_LPSRAM2EN)
#define __HAL_RCC_LPSRAM2_CLK_DISABLE()           CLEAR_BIT(RCC->LPSRAM2CFGR, RCC_LPSRAM2CFGR_LPSRAM2EN)
#endif /* RCC_LPSRAM2CFGR_LPSRAM2EN */

#if defined(RCC_LPSRAM3CFGR_LPSRAM3EN)
#define __HAL_RCC_LPSRAM3_CLK_DISABLE()           CLEAR_BIT(RCC->LPSRAM3CFGR, RCC_LPSRAM3CFGR_LPSRAM3EN)
#endif /* RCC_LPSRAM3CFGR_LPSRAM3EN */

#define __HAL_RCC_OSPI1_CLK_DISABLE()             CLEAR_BIT(RCC->OSPI1CFGR, RCC_OSPI1CFGR_OSPI1EN)

#if defined(RCC_OSPI2CFGR_OSPI2EN)
#define __HAL_RCC_OSPI2_CLK_DISABLE()             CLEAR_BIT(RCC->OSPI2CFGR, RCC_OSPI2CFGR_OSPI2EN)
#endif /* RCC_OSPI2CFGR_OSPI2EN */

#if defined(RCC_STMCFGR_STMEN)
#define __HAL_RCC_STM_CLK_DISABLE()            CLEAR_BIT(RCC->STMCFGR, RCC_STMCFGR_STMEN)
#endif /* RCC_STMCFGR_STMEN */

#define __HAL_RCC_ETR_CLK_DISABLE()               CLEAR_BIT(RCC->ETRCFGR, RCC_ETRCFGR_ETREN)
#define __HAL_RCC_GPIOA_CLK_DISABLE()             CLEAR_BIT(RCC->GPIOACFGR, RCC_GPIOACFGR_GPIOxEN)
#define __HAL_RCC_GPIOB_CLK_DISABLE()             CLEAR_BIT(RCC->GPIOBCFGR, RCC_GPIOBCFGR_GPIOxEN)
#define __HAL_RCC_GPIOC_CLK_DISABLE()             CLEAR_BIT(RCC->GPIOCCFGR, RCC_GPIOCCFGR_GPIOxEN)
#define __HAL_RCC_GPIOD_CLK_DISABLE()             CLEAR_BIT(RCC->GPIODCFGR, RCC_GPIODCFGR_GPIOxEN)
#define __HAL_RCC_GPIOE_CLK_DISABLE()             CLEAR_BIT(RCC->GPIOECFGR, RCC_GPIOECFGR_GPIOxEN)
#define __HAL_RCC_GPIOF_CLK_DISABLE()             CLEAR_BIT(RCC->GPIOFCFGR, RCC_GPIOFCFGR_GPIOxEN)
#define __HAL_RCC_GPIOG_CLK_DISABLE()             CLEAR_BIT(RCC->GPIOGCFGR, RCC_GPIOGCFGR_GPIOxEN)
#define __HAL_RCC_GPIOH_CLK_DISABLE()             CLEAR_BIT(RCC->GPIOHCFGR, RCC_GPIOHCFGR_GPIOxEN)
#define __HAL_RCC_GPIOI_CLK_DISABLE()             CLEAR_BIT(RCC->GPIOICFGR, RCC_GPIOICFGR_GPIOxEN)

#if defined(RCC_GPIOJCFGR_GPIOxEN)
#define __HAL_RCC_GPIOJ_CLK_DISABLE()             CLEAR_BIT(RCC->GPIOJCFGR, RCC_GPIOJCFGR_GPIOxEN)
#endif /* RCC_GPIOJCFGR_GPIOxEN */

#if defined(RCC_GPIOKCFGR_GPIOxEN)
#define __HAL_RCC_GPIOK_CLK_DISABLE()             CLEAR_BIT(RCC->GPIOKCFGR, RCC_GPIOKCFGR_GPIOxEN)
#endif /* RCC_GPIOKCFGR_GPIOxEN */

#define __HAL_RCC_GPIOZ_CLK_DISABLE()             CLEAR_BIT(RCC->GPIOZCFGR, RCC_GPIOZCFGR_GPIOZEN)
#define __HAL_RCC_HPDMA1_CLK_DISABLE()            CLEAR_BIT(RCC->HPDMA1CFGR, RCC_HPDMA1CFGR_HPDMA1EN)
#define __HAL_RCC_HPDMA2_CLK_DISABLE()            CLEAR_BIT(RCC->HPDMA2CFGR, RCC_HPDMA2CFGR_HPDMA2EN)
#define __HAL_RCC_HPDMA3_CLK_DISABLE()            CLEAR_BIT(RCC->HPDMA3CFGR, RCC_HPDMA3CFGR_HPDMA3EN)

