zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rcc.h
#if defined(RCC_I2C8CFGR_I2C8EN)
#define __HAL_RCC_I2C8_CLK_DISABLE()              CLEAR_BIT(RCC->I2C8CFGR, RCC_I2C8CFGR_I2C8EN)
#endif /* RCC_I2C8CFGR_I2C8EN */

#define __HAL_RCC_SAI1_CLK_DISABLE()              CLEAR_BIT(RCC->SAI1CFGR, RCC_SAI1CFGR_SAI1EN)
#define __HAL_RCC_SAI2_CLK_DISABLE()              CLEAR_BIT(RCC->SAI2CFGR, RCC_SAI2CFGR_SAI2EN)
#define __HAL_RCC_SAI3_CLK_DISABLE()              CLEAR_BIT(RCC->SAI3CFGR, RCC_SAI3CFGR_SAI3EN)
#define __HAL_RCC_SAI4_CLK_DISABLE()              CLEAR_BIT(RCC->SAI4CFGR, RCC_SAI4CFGR_SAI4EN)
#define __HAL_RCC_MDF1_CLK_DISABLE()              CLEAR_BIT(RCC->MDF1CFGR, RCC_MDF1CFGR_MDF1EN)
#define __HAL_RCC_ADF1_CLK_DISABLE()              CLEAR_BIT(RCC->ADF1CFGR, RCC_ADF1CFGR_ADF1EN)
#define __HAL_RCC_FDCAN_CLK_DISABLE()             CLEAR_BIT(RCC->FDCANCFGR, RCC_FDCANCFGR_FDCANEN)
#define __HAL_RCC_HDP_CLK_DISABLE()               CLEAR_BIT(RCC->HDPCFGR, RCC_HDPCFGR_HDPEN)

#if defined(RCC_ADC1CFGR_ADC1EN)
#define __HAL_RCC_ADC1_CLK_DISABLE()              CLEAR_BIT(RCC->ADC1CFGR, RCC_ADC1CFGR_ADC1EN)
#endif /*  RCC_ADC1CFGR_ADC1EN */

#if defined(RCC_ADC2CFGR_ADC2EN)
#define __HAL_RCC_ADC2_CLK_DISABLE()              CLEAR_BIT(RCC->ADC2CFGR, RCC_ADC2CFGR_ADC2EN)
#endif /*  RCC_ADC2CFGR_ADC2EN */

#if defined(RCC_ADC12CFGR_ADC12EN)
#define __HAL_RCC_ADC12_CLK_DISABLE()             CLEAR_BIT(RCC->ADC12CFGR, RCC_ADC12CFGR_ADC12EN)
#endif /*  RCC_ADC12CFGR_ADC12EN */

#if defined(RCC_ADC3CFGR_ADC3EN)
#define __HAL_RCC_ADC3_CLK_DISABLE()              CLEAR_BIT(RCC->ADC3CFGR, RCC_ADC3CFGR_ADC3EN)
#endif /* RCC_ADC3CFGR_ADC3EN */

#define __HAL_RCC_ETH1_CLK_DISABLE()              CLEAR_BIT(RCC->ETH1CFGR, RCC_ETH1CFGR_ETH1EN)
#define __HAL_RCC_ETH1MAC_CLK_DISABLE()           CLEAR_BIT(RCC->ETH1CFGR, RCC_ETH1CFGR_ETH1MACEN)
#define __HAL_RCC_ETH1TX_CLK_DISABLE()            CLEAR_BIT(RCC->ETH1CFGR, RCC_ETH1CFGR_ETH1TXEN)
#define __HAL_RCC_ETH1RX_CLK_DISABLE()            CLEAR_BIT(RCC->ETH1CFGR, RCC_ETH1CFGR_ETH1RXEN)
#define __HAL_RCC_ETH2_CLK_DISABLE()              CLEAR_BIT(RCC->ETH2CFGR, RCC_ETH2CFGR_ETH2EN)
#define __HAL_RCC_ETH2MAC_CLK_DISABLE()           CLEAR_BIT(RCC->ETH2CFGR, RCC_ETH2CFGR_ETH2MACEN)
#define __HAL_RCC_ETH2TX_CLK_DISABLE()            CLEAR_BIT(RCC->ETH2CFGR, RCC_ETH2CFGR_ETH2TXEN)
#define __HAL_RCC_ETH2RX_CLK_DISABLE()            CLEAR_BIT(RCC->ETH2CFGR, RCC_ETH2CFGR_ETH2RXEN)

#if defined(RCC_USBHCFGR_USBHEN)
#define __HAL_RCC_USBH_CLK_DISABLE()              CLEAR_BIT(RCC->USBHCFGR, RCC_USBHCFGR_USB2EN)
#endif /* RCC_USBHCFGR_USBHEN */

#define __HAL_RCC_USB2PHY1_CLK_DISABLE()          CLEAR_BIT(RCC->USB2PHY1CFGR, RCC_USB2PHY1CFGR_USB2PHY1EN)
#define __HAL_RCC_USB2PHY2_CLK_DISABLE()          CLEAR_BIT(RCC->USB2PHY2CFGR, RCC_USB2PHY2CFGR_USB2PHY2EN)

#if defined(RCC_OTGCFGR_OTGEN)
#define __HAL_RCC_OTG_CLK_DISABLE()               CLEAR_BIT(RCC->OTGCFGR, RCC_OTGCFGR_OTGEN)
#endif /* RCC_OTGCFGR_OTGEN */

#if defined(RCC_USB3DRDCFGR_USB3DRDEN)
#define __HAL_RCC_USB3DRD_CLK_DISABLE()           CLEAR_BIT(RCC->USB3DRDCFGR, RCC_USB3DRDCFGR_USB3DRDEN)
#endif /* RCC_USB3DRDCFGR_USB3DRDEN */

#if defined(RCC_USB3PCIEPHYCFGR_USB3PCIEPHYEN)
#define __HAL_RCC_USB3PCIEPHY_CLK_DISABLE()       CLEAR_BIT(RCC->USB3PCIEPHYCFGR, RCC_USB3PCIEPHYCFGR_USB3PCIEPHYEN)
#endif /* RCC_USB3PCIEPHYCFGR_USB3PCIEPHYEN */

#if defined(RCC_PCIECFGR_PCIEEN)
#define __HAL_RCC_PCIE_CLK_DISABLE()              CLEAR_BIT(RCC->PCIECFGR, RCC_PCIECFGR_PCIEEN)
#endif /* RCC_PCIECFGR_PCIEEN */

#if defined(RCC_UCPDCFGR_UCPDEN)
#define __HAL_RCC_UCPD1_CLK_DISABLE()             CLEAR_BIT(RCC->UCPDCFGR, RCC_UCPDCFGR_UCPDEN)
#endif /* RCC_UCPDCFGR_UCPDEN */

#define __HAL_RCC_FMC_CLK_DISABLE()               CLEAR_BIT(RCC->FMCCFGR, RCC_FMCCFGR_FMCEN)
#define __HAL_RCC_SDMMC1_CLK_DISABLE()            CLEAR_BIT(RCC->SDMMC1CFGR, RCC_SDMMC1CFGR_SDMMC1EN)
#define __HAL_RCC_SDMMC2_CLK_DISABLE()            CLEAR_BIT(RCC->SDMMC2CFGR, RCC_SDMMC2CFGR_SDMMC2EN)
#define __HAL_RCC_SDMMC3_CLK_DISABLE()            CLEAR_BIT(RCC->SDMMC3CFGR, RCC_SDMMC3CFGR_SDMMC3EN)
#define __HAL_RCC_GPU_CLK_DISABLE()               CLEAR_BIT(RCC->GPUCFGR, RCC_GPUCFGR_GPUEN)
#define __HAL_RCC_LTDC_CLK_DISABLE()              CLEAR_BIT(RCC->LTDCCFGR, RCC_LTDCCFGR_LTDCEN)

#if defined(RCC_DSICFGR_DSIEN)
#define __HAL_RCC_DSI_CLK_DISABLE()               CLEAR_BIT(RCC->DSICFGR, RCC_DSICFGR_DSIEN)
#endif /* RCC_DSICFGR_DSIEN */

#define __HAL_RCC_LVDS_CLK_DISABLE()              CLEAR_BIT(RCC->LVDSCFGR, RCC_LVDSCFGR_LVDSEN)
#define __HAL_RCC_CSI2_CLK_DISABLE()              CLEAR_BIT(RCC->CSI2CFGR, RCC_CSI2CFGR_CSI2EN)
#define __HAL_RCC_DCMIPP_CLK_DISABLE()            CLEAR_BIT(RCC->DCMIPPCFGR, RCC_DCMIPPCFGR_DCMIPPEN)

#if defined(RCC_DCMIPSSICFGR_DCMIPSSIEN)
#define __HAL_RCC_DCMIPSSI_CLK_DISABLE()          CLEAR_BIT(RCC->DCMIPSSICFGR, RCC_DCMIPSSICFGR_DCMIPSSIEN)
#endif /* RCC_DCMIPSSICFGR_DCMIPSSIEN */

#if defined(RCC_CCICFGR_CCIEN)
#define __HAL_RCC_CCI_CLK_DISABLE()               CLEAR_BIT(RCC->CCICFGR, RCC_CCICFGR_CCIEN)
#endif /* RCC_CCICFGR_CCIEN */

#if defined(RCC_RNGCFGR_RNGEN)
#define __HAL_RCC_RNG_CLK_DISABLE()               CLEAR_BIT(RCC->RNGCFGR, RCC_RNGCFGR_RNGEN)
#endif /* RCC_RNGCFGR_RNGEN */


#if defined(RCC_RNG1CFGR_RNG1EN)
#define __HAL_RCC_RNG1_CLK_DISABLE()              CLEAR_BIT(RCC->RNG1CFGR, RCC_RNG1CFGR_RNG1EN)
#endif /* RCC_RNG1CFGR_RNG1EN */

#if defined(RCC_RNG2CFGR_RNG2EN)
#define __HAL_RCC_RNG2_CLK_DISABLE()              CLEAR_BIT(RCC->RNG2CFGR, RCC_RNG2CFGR_RNG2EN)
#endif /* RCC_RNG2CFGR_RNG2EN */

#define __HAL_RCC_PKA_CLK_DISABLE()               CLEAR_BIT(RCC->PKACFGR, RCC_PKACFGR_PKAEN)
#define __HAL_RCC_SAES_CLK_DISABLE()              CLEAR_BIT(RCC->SAESCFGR, RCC_SAESCFGR_SAESEN)

#if defined(RCC_HASHCFGR_HASHEN)
#define __HAL_RCC_HASH_CLK_DISABLE()              CLEAR_BIT(RCC->HASHCFGR, RCC_HASHCFGR_HASHEN)
#endif /* RCC_HASHCFGR_HASHEN */

#if defined(RCC_HASH1CFGR_HASH1EN)
#define __HAL_RCC_HASH1_CLK_DISABLE()             CLEAR_BIT(RCC->HASH1CFGR, RCC_HASH1CFGR_HASH1EN)
#endif /* RCC_HASH1CFGR_HASH1EN */

