zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rcc.h
#if defined(RCC_HASH1CFGR_HASH1LPEN)
#define __HAL_RCC_HASH1_CLK_SLEEP_ENABLE()        SET_BIT(RCC->HASH1CFGR, RCC_HASH1CFGR_HASH1LPEN)
#endif /* RCC_HASH1CFGR_HASH1LPEN */

#if defined(RCC_HASH2CFGR_HASH2LPEN)
#define __HAL_RCC_HASH2_CLK_SLEEP_ENABLE()        SET_BIT(RCC->HASH2CFGR, RCC_HASH2CFGR_HASH2LPEN)
#endif /* RCC_HASH2CFGR_HASH2LPEN */

#define __HAL_RCC_CRYP1_CLK_SLEEP_ENABLE()        SET_BIT(RCC->CRYP1CFGR, RCC_CRYP1CFGR_CRYP1LPEN)
#define __HAL_RCC_CRYP2_CLK_SLEEP_ENABLE()        SET_BIT(RCC->CRYP2CFGR, RCC_CRYP2CFGR_CRYP2LPEN)
#define __HAL_RCC_IWDG1_CLK_SLEEP_ENABLE()        SET_BIT(RCC->IWDG1CFGR, RCC_IWDG1CFGR_IWDG1LPEN)
#define __HAL_RCC_IWDG2_CLK_SLEEP_ENABLE()        SET_BIT(RCC->IWDG2CFGR, RCC_IWDG2CFGR_IWDG2LPEN)
#define __HAL_RCC_IWDG3_CLK_SLEEP_ENABLE()        SET_BIT(RCC->IWDG3CFGR, RCC_IWDG3CFGR_IWDG3LPEN)
#define __HAL_RCC_IWDG4_CLK_SLEEP_ENABLE()        SET_BIT(RCC->IWDG4CFGR, RCC_IWDG4CFGR_IWDG4LPEN)

#if defined(RCC_IWDG5CFGR_IWDG5LPEN)
#define __HAL_RCC_IWDG5_CLK_SLEEP_ENABLE()        SET_BIT(RCC->IWDG5CFGR, RCC_IWDG5CFGR_IWDG5LPEN)
#endif /* RCC_IWDG5CFGR_IWDG5LPEN */

#define __HAL_RCC_WWDG1_CLK_SLEEP_ENABLE()        SET_BIT(RCC->WWDG1CFGR, RCC_WWDG1CFGR_WWDG1LPEN)

#if defined(RCC_WWDG2CFGR_WWDG2LPEN)
#define __HAL_RCC_WWDG2_CLK_SLEEP_ENABLE()        SET_BIT(RCC->WWDG2CFGR, RCC_WWDG2CFGR_WWDG2LPEN)
#endif /*RCC_WWDG2CFGR_WWDG2LPEN*/

#define __HAL_RCC_BUSPERFM_CLK_SLEEP_ENABLE()     SET_BIT(RCC->BUSPERFMCFGR, RCC_BUSPERFMCFGR_BUSPERFMLPEN)
#define __HAL_RCC_VREF_CLK_SLEEP_ENABLE()         SET_BIT(RCC->VREFCFGR, RCC_VREFCFGR_VREFLPEN)

#if defined(RCC_TMPSENSCFGR_TMPSENSLPEN)
#define __HAL_RCC_TMPSENS_CLK_SLEEP_ENABLE()      SET_BIT(RCC->TMPSENSCFGR, RCC_TMPSENSCFGR_TMPSENSLPEN)
#endif /* RCC_TMPSENSCFGR_TMPSENSLPEN */

#define __HAL_RCC_CRC_CLK_SLEEP_ENABLE()          SET_BIT(RCC->CRCCFGR, RCC_CRCCFGR_CRCLPEN)
#define __HAL_RCC_BSEC_CLK_SLEEP_ENABLE()         SET_BIT(RCC->BSECCFGR, RCC_BSECCFGR_BSECLPEN)

#if defined(RCC_GICV2MCFGR_GICV2MLPEN)
#define __HAL_RCC_GICV2M_CLK_SLEEP_ENABLE()       SET_BIT(RCC->GICV2MCFGR, RCC_GICV2MCFGR_GICV2MLPEN)
#endif /* RCC_GICV2MCFGR_GICV2MLPEN */

#define __HAL_RCC_I3C1_CLK_SLEEP_ENABLE()         SET_BIT(RCC->I3C1CFGR, RCC_I3C1CFGR_I3C1LPEN)
#define __HAL_RCC_I3C2_CLK_SLEEP_ENABLE()         SET_BIT(RCC->I3C2CFGR, RCC_I3C2CFGR_I3C2LPEN)
#define __HAL_RCC_I3C3_CLK_SLEEP_ENABLE()         SET_BIT(RCC->I3C3CFGR, RCC_I3C3CFGR_I3C3LPEN)

#if defined(RCC_I3C4CFGR_I3C4LPEN)
#define __HAL_RCC_I3C4_CLK_SLEEP_ENABLE()         SET_BIT(RCC->I3C4CFGR, RCC_I3C4CFGR_I3C4LPEN)
#endif /* RCC_I3C4CFGR_I3C4LPEN */

/* for API backward compatibility */
#if defined(RCC_DCMIPSSICFGR_DCMIPSSILPEN)
#define __HAL_RCC_DCMI_CLK_SLEEP_ENABLE()         __HAL_RCC_DCMIPSSI_CLK_SLEEP_ENABLE()
#define __HAL_RCC_PSSI_CLK_SLEEP_ENABLE()         __HAL_RCC_DCMIPSSI_CLK_SLEEP_ENABLE()
#endif /* RCC_DCMIPSSICFGR_DCMIPSSILPEN */

#if defined(RCC_CCICFGR_CCILPEN)
#define __HAL_RCC_DCMI_CLK_SLEEP_ENABLE()         __HAL_RCC_CCI_CLK_SLEEP_ENABLE()
#define __HAL_RCC_PSSI_CLK_SLEEP_ENABLE()         __HAL_RCC_CCI_CLK_SLEEP_ENABLE()
#endif /* RCC_CCICFGR_CCILPEN */

#define __HAL_RCC_OTFDEC1_CLK_SLEEP_ENABLE()      __HAL_RCC_OSPI1_CLK_SLEEP_ENABLE()

#if defined(RCC_OSPI2CFGR_OSPI2LPEN)
#define __HAL_RCC_OTFDEC2_CLK_SLEEP_ENABLE()      __HAL_RCC_OSPI2_CLK_SLEEP_ENABLE()
#endif /* RCC_OSPI2CFGR_OSPI2LPEN */

/* Clock sleep disable macros */
#if defined(RCC_VDERAMCFGR_VDERAMLPEN)
#define __HAL_RCC_VDERAM_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->VDERAMCFGR, RCC_VDERAMCFGR_VDERAMLPEN)
#endif /* RCC_VDERAMCFGR_VDERAMLPEN */

#define __HAL_RCC_SERC_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->SERCCFGR, RCC_SERCCFGR_SERCLPEN)
#define __HAL_RCC_OSPIIOM_CLK_SLEEP_DISABLE()     CLEAR_BIT(RCC->OSPIIOMCFGR, RCC_OSPIIOMCFGR_OSPIIOMLPEN)
#define __HAL_RCC_ETHSW_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->ETHSWCFGR, RCC_ETHSWCFGR_ETHSWMACLPEN|\
                                                            RCC_ETHSWCFGR_ETHSWLPEN|RCC_ETHSWCFGR_ETHSWREFLPEN)
#define __HAL_RCC_VDEC_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->VDECCFGR, RCC_VDECCFGR_VDECLPEN)

#if defined(RCC_VENCCFGR_VENCLPEN)
#define __HAL_RCC_VENC_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->VENCCFGR, RCC_VENCCFGR_VENCLPEN)
#endif /* RCC_VENCCFGR_VENCLPEN */

#if defined(RCC_C3CFGR_C3LPEN)
#define __HAL_RCC_C3_CLK_SLEEP_DISABLE()          CLEAR_BIT(RCC->C3CFGR, RCC_C3CFGR_C3LPEN)
#endif /* RCC_C3CFGR_C3LPEN */

#define __HAL_RCC_SYSRAM_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->SYSRAMCFGR, RCC_SYSRAMCFGR_SYSRAMLPEN)
#define __HAL_RCC_SRAM1_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->SRAM1CFGR, RCC_SRAM1CFGR_SRAM1LPEN)

#if defined(RCC_SRAM2CFGR_SRAM2LPEN)
#define __HAL_RCC_SRAM2_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->SRAM2CFGR, RCC_SRAM2CFGR_SRAM2LPEN)
#endif /* RCC_SRAM2CFGR_SRAM2LPEN */

#define __HAL_RCC_RETRAM_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->RETRAMCFGR, RCC_RETRAMCFGR_RETRAMLPEN)
#define __HAL_RCC_BKPSRAM_CLK_SLEEP_DISABLE()     CLEAR_BIT(RCC->BKPSRAMCFGR, RCC_BKPSRAMCFGR_BKPSRAMLPEN)

#if defined(RCC_LPSRAM1CFGR_LPSRAM1LPEN)
#define __HAL_RCC_LPSRAM1_CLK_SLEEP_DISABLE()     CLEAR_BIT(RCC->LPSRAM1CFGR, RCC_LPSRAM1CFGR_LPSRAM1LPEN)
#endif /* RCC_LPSRAM1CFGR_LPSRAM1LPEN */

#if defined(RCC_LPSRAM2CFGR_LPSRAM2LPEN)
#define __HAL_RCC_LPSRAM2_CLK_SLEEP_DISABLE()     CLEAR_BIT(RCC->LPSRAM2CFGR, RCC_LPSRAM2CFGR_LPSRAM2LPEN)
#endif /* RCC_LPSRAM2CFGR_LPSRAM2LPEN */

#if defined(RCC_LPSRAM3CFGR_LPSRAM3LPEN)
#define __HAL_RCC_LPSRAM3_CLK_SLEEP_DISABLE()     CLEAR_BIT(RCC->LPSRAM3CFGR, RCC_LPSRAM3CFGR_LPSRAM3LPEN)
#endif /* RCC_LPSRAM3CFGR_LPSRAM3LPEN */

#define __HAL_RCC_OSPI1_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->OSPI1CFGR, RCC_OSPI1CFGR_OSPI1LPEN)

#if defined(RCC_OSPI2CFGR_OSPI2LPEN)
#define __HAL_RCC_OSPI2_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->OSPI2CFGR, RCC_OSPI2CFGR_OSPI2LPEN)
#endif /* RCC_OSPI2CFGR_OSPI2LPEN */

#if defined(RCC_STMCFGR_STMLPEN)
#define __HAL_RCC_STM_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->STMCFGR, RCC_STMCFGR_STMLPEN)
#endif /* RCC_STMCFGR_STMLPEN */

