zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rcc.h
#define __HAL_RCC_ETR_CLK_SLEEP_DISABLE()         CLEAR_BIT(RCC->ETRCFGR, RCC_ETRCFGR_ETRLPEN)
#define __HAL_RCC_GPIOA_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->GPIOACFGR, RCC_GPIOACFGR_GPIOxLPEN)
#define __HAL_RCC_GPIOB_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->GPIOBCFGR, RCC_GPIOBCFGR_GPIOxLPEN)
#define __HAL_RCC_GPIOC_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->GPIOCCFGR, RCC_GPIOCCFGR_GPIOxLPEN)
#define __HAL_RCC_GPIOD_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->GPIODCFGR, RCC_GPIODCFGR_GPIOxLPEN)
#define __HAL_RCC_GPIOE_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->GPIOECFGR, RCC_GPIOECFGR_GPIOxLPEN)
#define __HAL_RCC_GPIOF_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->GPIOFCFGR, RCC_GPIOFCFGR_GPIOxLPEN)
#define __HAL_RCC_GPIOG_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->GPIOGCFGR, RCC_GPIOGCFGR_GPIOxLPEN)
#define __HAL_RCC_GPIOH_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->GPIOHCFGR, RCC_GPIOHCFGR_GPIOxLPEN)
#define __HAL_RCC_GPIOI_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->GPIOICFGR, RCC_GPIOICFGR_GPIOxLPEN)

#if defined(RCC_GPIOJCFGR_GPIOxLPEN)
#define __HAL_RCC_GPIOJ_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->GPIOJCFGR, RCC_GPIOJCFGR_GPIOxLPEN)
#endif /* RCC_GPIOJCFGR_GPIOxLPEN */

#if defined(RCC_GPIOKCFGR_GPIOxLPEN)
#define __HAL_RCC_GPIOK_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->GPIOKCFGR, RCC_GPIOKCFGR_GPIOxLPEN)
#endif /* RCC_GPIOKCFGR_GPIOxLPEN */

#define __HAL_RCC_GPIOZ_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->GPIOZCFGR, RCC_GPIOZCFGR_GPIOZLPEN)
#define __HAL_RCC_HPDMA1_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->HPDMA1CFGR, RCC_HPDMA1CFGR_HPDMA1LPEN)
#define __HAL_RCC_HPDMA2_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->HPDMA2CFGR, RCC_HPDMA2CFGR_HPDMA2LPEN)
#define __HAL_RCC_HPDMA3_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->HPDMA3CFGR, RCC_HPDMA3CFGR_HPDMA3LPEN)

#if defined(RCC_LPDMACFGR_LPDMALPEN)
#define __HAL_RCC_LPDMA_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->LPDMACFGR, RCC_LPDMACFGR_LPDMALPEN)
#endif /* RCC_LPDMACFGR_LPDMALPEN */

#if defined(RCC_HSEMCFGR_HSEMLPEN)
#define __HAL_RCC_HSEM_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->HSEMCFGR, RCC_HSEMCFGR_HSEMLPEN)
#endif /* RCC_HSEMCFGR_HSEMLPEN */

#define __HAL_RCC_IPCC1_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->IPCC1CFGR, RCC_IPCC1CFGR_IPCC1LPEN)

#if defined(RCC_IPCC2CFGR_IPCC2LPEN)
#define __HAL_RCC_IPCC2_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->IPCC2CFGR, RCC_IPCC2CFGR_IPCC2LPEN)
#endif /* RCC_IPCC2CFGR_IPCC2LPEN */

#define __HAL_RCC_RTC_CLK_SLEEP_DISABLE()         CLEAR_BIT(RCC->RTCCFGR, RCC_RTCCFGR_RTCLPEN)
#define __HAL_RCC_SYSCPU1_CLK_SLEEP_DISABLE()     CLEAR_BIT(RCC->SYSCPU1CFGR, RCC_SYSCPU1CFGR_SYSCPU1LPEN)

#define __HAL_RCC_IS2M_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->IS2MCFGR, RCC_IS2MCFGR_IS2MLPEN)
#define __HAL_RCC_TIM1_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->TIM1CFGR, RCC_TIM1CFGR_TIM1LPEN)
#define __HAL_RCC_TIM2_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->TIM2CFGR, RCC_TIM2CFGR_TIM2LPEN)
#define __HAL_RCC_TIM3_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->TIM3CFGR, RCC_TIM3CFGR_TIM3LPEN)
#define __HAL_RCC_TIM4_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->TIM4CFGR, RCC_TIM4CFGR_TIM4LPEN)
#define __HAL_RCC_TIM5_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->TIM5CFGR, RCC_TIM5CFGR_TIM5LPEN)
#define __HAL_RCC_TIM6_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->TIM6CFGR, RCC_TIM6CFGR_TIM6LPEN)
#define __HAL_RCC_TIM7_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->TIM7CFGR, RCC_TIM7CFGR_TIM7LPEN)
#define __HAL_RCC_TIM8_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->TIM8CFGR, RCC_TIM8CFGR_TIM8LPEN)
#define __HAL_RCC_TIM10_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->TIM10CFGR, RCC_TIM10CFGR_TIM10LPEN)
#define __HAL_RCC_TIM11_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->TIM11CFGR, RCC_TIM11CFGR_TIM11LPEN)
#define __HAL_RCC_TIM12_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->TIM12CFGR, RCC_TIM12CFGR_TIM12LPEN)
#define __HAL_RCC_TIM13_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->TIM13CFGR, RCC_TIM13CFGR_TIM13LPEN)
#define __HAL_RCC_TIM14_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->TIM14CFGR, RCC_TIM14CFGR_TIM14LPEN)
#define __HAL_RCC_TIM15_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->TIM15CFGR, RCC_TIM15CFGR_TIM15LPEN)
#define __HAL_RCC_TIM16_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->TIM16CFGR, RCC_TIM16CFGR_TIM16LPEN)
#define __HAL_RCC_TIM17_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->TIM17CFGR, RCC_TIM17CFGR_TIM17LPEN)

#if defined(RCC_TIM20CFGR_TIM20LPEN)
#define __HAL_RCC_TIM20_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->TIM20CFGR, RCC_TIM20CFGR_TIM20LPEN)
#endif /* RCC_TIM20CFGR_TIM20LPEN */

#define __HAL_RCC_LPTIM1_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->LPTIM1CFGR, RCC_LPTIM1CFGR_LPTIM1LPEN)
#define __HAL_RCC_LPTIM2_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->LPTIM2CFGR, RCC_LPTIM2CFGR_LPTIM2LPEN)
#define __HAL_RCC_LPTIM3_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->LPTIM3CFGR, RCC_LPTIM3CFGR_LPTIM3LPEN)
#define __HAL_RCC_LPTIM4_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->LPTIM4CFGR, RCC_LPTIM4CFGR_LPTIM4LPEN)
#define __HAL_RCC_LPTIM5_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->LPTIM5CFGR, RCC_LPTIM5CFGR_LPTIM5LPEN)
#define __HAL_RCC_SPI1_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->SPI1CFGR, RCC_SPI1CFGR_SPI1LPEN)
#define __HAL_RCC_SPI2_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->SPI2CFGR, RCC_SPI2CFGR_SPI2LPEN)
#define __HAL_RCC_SPI3_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->SPI3CFGR, RCC_SPI3CFGR_SPI3LPEN)
#define __HAL_RCC_SPI4_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->SPI4CFGR, RCC_SPI4CFGR_SPI4LPEN)
#define __HAL_RCC_SPI5_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->SPI5CFGR, RCC_SPI5CFGR_SPI5LPEN)
#define __HAL_RCC_SPI6_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->SPI6CFGR, RCC_SPI6CFGR_SPI6LPEN)

#if defined(RCC_SPI7CFGR_SPI7LPEN)
#define __HAL_RCC_SPI7_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->SPI7CFGR, RCC_SPI7CFGR_SPI7LPEN)
#endif /* RCC_SPI7CFGR_SPI7LPEN */

#if defined(RCC_SPI8CFGR_SPI8LPEN)
#define __HAL_RCC_SPI8_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->SPI8CFGR, RCC_SPI8CFGR_SPI8LPEN)
#endif /* RCC_SPI8CFGR_SPI8LPEN */

#define __HAL_RCC_SPDIFRX_CLK_SLEEP_DISABLE()     CLEAR_BIT(RCC->SPDIFRXCFGR, RCC_SPDIFRXCFGR_SPDIFRXLPEN)
#define __HAL_RCC_USART1_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->USART1CFGR, RCC_USART1CFGR_USART1LPEN)
#define __HAL_RCC_USART2_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->USART2CFGR, RCC_USART2CFGR_USART2LPEN)
#define __HAL_RCC_USART3_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->USART3CFGR, RCC_USART3CFGR_USART3LPEN)
#define __HAL_RCC_UART4_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->UART4CFGR, RCC_UART4CFGR_UART4LPEN)
#define __HAL_RCC_UART5_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->UART5CFGR, RCC_UART5CFGR_UART5LPEN)
#define __HAL_RCC_USART6_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->USART6CFGR, RCC_USART6CFGR_USART6LPEN)
#define __HAL_RCC_UART7_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->UART7CFGR, RCC_UART7CFGR_UART7LPEN)

#if defined(RCC_UART8CFGR_UART8LPEN)
#define __HAL_RCC_UART8_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->UART8CFGR, RCC_UART8CFGR_UART8LPEN)
#endif /* RCC_UART8CFGR_UART8LPEN */

#if defined(RCC_UART9CFGR_UART9LPEN)
#define __HAL_RCC_UART9_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->UART9CFGR, RCC_UART9CFGR_UART9LPEN)
#endif /* RCC_UART9CFGR_UART9LPEN */

#define __HAL_RCC_LPUART1_CLK_SLEEP_DISABLE()     CLEAR_BIT(RCC->LPUART1CFGR, RCC_LPUART1CFGR_LPUART1LPEN)
#define __HAL_RCC_I2C1_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->I2C1CFGR, RCC_I2C1CFGR_I2C1LPEN)
#define __HAL_RCC_I2C2_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->I2C2CFGR, RCC_I2C2CFGR_I2C2LPEN)
#define __HAL_RCC_I2C3_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->I2C3CFGR, RCC_I2C3CFGR_I2C3LPEN)

#if defined(RCC_I2C4CFGR_I2C4LPEN)
#define __HAL_RCC_I2C4_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->I2C4CFGR, RCC_I2C4CFGR_I2C4LPEN)
#endif /* RCC_I2C4CFGR_I2C4LPEN */

