zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rcc.h
#if defined(RCC_I2C5CFGR_I2C5LPEN)
#define __HAL_RCC_I2C5_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->I2C5CFGR, RCC_I2C5CFGR_I2C5LPEN)
#endif /* RCC_I2C5CFGR_I2C5LPEN */

#if defined(RCC_I2C6CFGR_I2C6LPEN)
#define __HAL_RCC_I2C6_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->I2C6CFGR, RCC_I2C6CFGR_I2C6LPEN)
#endif /* RCC_I2C6CFGR_I2C6LPEN */

#if defined(RCC_I2C7CFGR_I2C7LPEN)
#define __HAL_RCC_I2C7_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->I2C7CFGR, RCC_I2C7CFGR_I2C7LPEN)
#endif /* RCC_I2C7CFGR_I2C7LPEN */

#if defined(RCC_I2C8CFGR_I2C8LPEN)
#define __HAL_RCC_I2C8_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->I2C8CFGR, RCC_I2C8CFGR_I2C8LPEN)
#endif /* RCC_I2C8CFGR_I2C8LPEN */

#define __HAL_RCC_SAI1_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->SAI1CFGR, RCC_SAI1CFGR_SAI1LPEN)
#define __HAL_RCC_SAI2_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->SAI2CFGR, RCC_SAI2CFGR_SAI2LPEN)
#define __HAL_RCC_SAI3_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->SAI3CFGR, RCC_SAI3CFGR_SAI3LPEN)
#define __HAL_RCC_SAI4_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->SAI4CFGR, RCC_SAI4CFGR_SAI4LPEN)
#define __HAL_RCC_MDF1_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->MDF1CFGR, RCC_MDF1CFGR_MDF1LPEN)
#define __HAL_RCC_ADF1_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->ADF1CFGR, RCC_ADF1CFGR_ADF1LPEN)
#define __HAL_RCC_FDCAN_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->FDCANCFGR, RCC_FDCANCFGR_FDCANLPEN)

#if defined(RCC_ADC1CFGR_ADC1LPEN)
#define __HAL_RCC_ADC1_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->ADC1CFGR, RCC_ADC1CFGR_ADC1LPEN)
#endif /* RCC_ADC1CFGR_ADC1LPEN */

#if defined(RCC_ADC2CFGR_ADC2LPEN)
#define __HAL_RCC_ADC2_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->ADC2CFGR, RCC_ADC2CFGR_ADC2LPEN)
#endif /* RCC_ADC2CFGR_ADC2LPEN  */

#if defined(RCC_ADC12CFGR_ADC12LPEN)
#define __HAL_RCC_ADC12_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->ADC12CFGR, RCC_ADC12CFGR_ADC12LPEN)
#endif /* RCC_ADC12CFGR_ADC12LPEN  */

#if defined(RCC_ADC3CFGR_ADC3LPEN)
#define __HAL_RCC_ADC3_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->ADC3CFGR, RCC_ADC3CFGR_ADC3LPEN)
#endif /* RCC_ADC3CFGR_ADC3LPEN  */

#define __HAL_RCC_ETH1_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->ETH1CFGR, RCC_ETH1CFGR_ETH1LPEN)
#define __HAL_RCC_ETH1MAC_CLK_SLEEP_DISABLE()     CLEAR_BIT(RCC->ETH1CFGR, RCC_ETH1CFGR_ETH1MACLPEN)
#define __HAL_RCC_ETH1TX_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->ETH1CFGR, RCC_ETH1CFGR_ETH1TXLPEN)
#define __HAL_RCC_ETH1RX_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->ETH1CFGR, RCC_ETH1CFGR_ETH1RXLPEN)
#define __HAL_RCC_ETH2_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->ETH2CFGR, RCC_ETH2CFGR_ETH2LPEN)
#define __HAL_RCC_ETH2MAC_CLK_SLEEP_DISABLE()     CLEAR_BIT(RCC->ETH2CFGR, RCC_ETH2CFGR_ETH2MACLPEN)
#define __HAL_RCC_ETH2TX_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->ETH2CFGR, RCC_ETH2CFGR_ETH2TXLPEN)
#define __HAL_RCC_ETH2RX_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->ETH2CFGR, RCC_ETH2CFGR_ETH2RXLPEN)


#define __HAL_RCC_USB2PHY1_CLK_SLEEP_DISABLE()    CLEAR_BIT(RCC->USB2PHY1CFGR, RCC_USB2PHY1CFGR_USB2PHY1LPEN)
#define __HAL_RCC_USB2PHY2_CLK_SLEEP_DISABLE()    CLEAR_BIT(RCC->USB2PHY2CFGR, RCC_USB2PHY2CFGR_USB2PHY2LPEN)

#if defined(RCC_USB3DRDCFGR_USB3DRDLPEN)
#define __HAL_RCC_USB3DRD_CLK_SLEEP_DISABLE()     CLEAR_BIT(RCC->USB3DRDCFGR, RCC_USB3DRDCFGR_USB3DRDLPEN)
#endif /* RCC_USB3DRDCFGR_USB3DRDLPEN  */

#if defined(RCC_USB3PCIEPHYCFGR_USB3PCIEPHYLPEN)
#define __HAL_RCC_USB3PCIEPHY_CLK_SLEEP_DISABLE() CLEAR_BIT(RCC->USB3PCIEPHYCFGR, RCC_USB3PCIEPHYCFGR_USB3PCIEPHYLPEN)
#endif /* RCC_USB3PCIEPHYCFGR_USB3PCIEPHYLPEN  */

#if defined(RCC_PCIECFGR_PCIELPEN)
#define __HAL_RCC_PCIE_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->PCIECFGR, RCC_PCIECFGR_PCIELPEN)
#endif /* RCC_PCIECFGR_PCIELPEN  */

#if defined(RCC_UCPDCFGR_UCPDLPEN)
#define __HAL_RCC_UCPD1_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->UCPDCFGR, RCC_UCPDCFGR_UCPDLPEN)
#endif /* RCC_UCPDCFGR_UCPDLPEN  */

#define __HAL_RCC_FMC_CLK_SLEEP_DISABLE()         CLEAR_BIT(RCC->FMCCFGR, RCC_FMCCFGR_FMCLPEN)
#define __HAL_RCC_SDMMC1_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->SDMMC1CFGR, RCC_SDMMC1CFGR_SDMMC1LPEN)
#define __HAL_RCC_SDMMC2_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->SDMMC2CFGR, RCC_SDMMC2CFGR_SDMMC2LPEN)
#define __HAL_RCC_SDMMC3_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->SDMMC3CFGR, RCC_SDMMC3CFGR_SDMMC3LPEN)
#define __HAL_RCC_GPU_CLK_SLEEP_DISABLE()         CLEAR_BIT(RCC->GPUCFGR, RCC_GPUCFGR_GPULPEN)
#define __HAL_RCC_LTDC_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->LTDCCFGR, RCC_LTDCCFGR_LTDCLPEN)

#if defined(RCC_DSICFGR_DSILPEN)
#define __HAL_RCC_DSI_CLK_SLEEP_DISABLE()         CLEAR_BIT(RCC->DSICFGR, RCC_DSICFGR_DSILPEN)
#endif /* RCC_DSICFGR_DSILPEN */

#define __HAL_RCC_LVDS_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->LVDSCFGR, RCC_LVDSCFGR_LVDSLPEN)

#if defined(RCC_CSICFGR_CSILPEN)
#define __HAL_RCC_CSI_CLK_SLEEP_DISABLE()         CLEAR_BIT(RCC->CSICFGR, RCC_CSICFGR_CSILPEN)
#endif /*RCC_CSICFGR_CSILPEN */

#if defined(RCC_CSI2CFGR_CSI2LPEN)
#define __HAL_RCC_CSI2_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->CSI2CFGR, RCC_CSI2CFGR_CSI2LPEN)
#endif /*RCC_CSI2CFGR_CSI2LPEN */

#define __HAL_RCC_DCMIPP_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->DCMIPPCFGR, RCC_DCMIPPCFGR_DCMIPPLPEN)

#if defined(RCC_DCMIPSSICFGR_DCMIPSSILPEN)
#define __HAL_RCC_DCMIPSSI_CLK_SLEEP_DISABLE()    CLEAR_BIT(RCC->DCMIPSSICFGR, RCC_DCMIPSSICFGR_DCMIPSSILPEN)
#endif /* RCC_DCMIPSSICFGR_DCMIPSSILPEN */

#if defined(RCC_CCICFGR_CCILPEN)
#define __HAL_RCC_CCI_CLK_SLEEP_DISABLE()         CLEAR_BIT(RCC->CCICFGR, RCC_CCICFGR_CCILPEN)
#endif /* RCC_CCICFGR_CCILPEN */

#if defined(RCC_RNGCFGR_RNGLPEN)
#define __HAL_RCC_RNG_CLK_SLEEP_DISABLE()         CLEAR_BIT(RCC->RNGCFGR, RCC_RNGCFGR_RNGLPEN)
#endif /* RCC_RNGCFGR_RNGLPEN*/

#if defined(RCC_RNG1CFGR_RNG1LPEN)
#define __HAL_RCC_RNG1_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->RNG1CFGR, RCC_RNG1CFGR_RNG1LPEN)
#endif /* RCC_RNG1CFGR_RNG1LPEN */

#if defined(RCC_RNG2CFGR_RNG2LPEN)
#define __HAL_RCC_RNG2_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->RNG2CFGR, RCC_RNG2CFGR_RNG2LPEN)
#endif /* RCC_RNG2CFGR_RNG2LPEN */

#define __HAL_RCC_PKA_CLK_SLEEP_DISABLE()         CLEAR_BIT(RCC->PKACFGR, RCC_PKACFGR_PKALPEN)
#define __HAL_RCC_SAES_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->SAESCFGR, RCC_SAESCFGR_SAESLPEN)

#if defined(RCC_HASHCFGR_HASHLPEN)
#define __HAL_RCC_HASH_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->HASHCFGR, RCC_HASHCFGR_HASHLPEN)
#endif /* RCC_HASHCFGR_HASHLPEN */

