zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rcc.h
#if defined(RCC_HASH1CFGR_HASH1LPEN)
#define __HAL_RCC_HASH1_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->HASH1CFGR, RCC_HASH1CFGR_HASH1LPEN)
#endif /* RCC_HASHCFGR_HASHLPEN */

#if defined(RCC_HASH2CFGR_HASH2LPEN)
#define __HAL_RCC_HASH2_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->HASH2CFGR, RCC_HASH2CFGR_HASH2LPEN)
#endif /* RCC_HASH2CFGR_HASH2LPEN */

#define __HAL_RCC_CRYP1_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->CRYP1CFGR, RCC_CRYP1CFGR_CRYP1LPEN)
#define __HAL_RCC_CRYP2_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->CRYP2CFGR, RCC_CRYP2CFGR_CRYP2LPEN)
#define __HAL_RCC_IWDG1_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->IWDG1CFGR, RCC_IWDG1CFGR_IWDG1LPEN)
#define __HAL_RCC_IWDG2_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->IWDG2CFGR, RCC_IWDG2CFGR_IWDG2LPEN)
#define __HAL_RCC_IWDG3_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->IWDG3CFGR, RCC_IWDG3CFGR_IWDG3LPEN)
#define __HAL_RCC_IWDG4_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->IWDG4CFGR, RCC_IWDG4CFGR_IWDG4LPEN)

#if defined(RCC_IWDG5CFGR_IWDG5LPEN)
#define __HAL_RCC_IWDG5_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->IWDG5CFGR, RCC_IWDG5CFGR_IWDG5LPEN)
#endif /* RCC_IWDG5CFGR_IWDG5LPEN */

#define __HAL_RCC_WWDG1_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->WWDG1CFGR, RCC_WWDG1CFGR_WWDG1LPEN)

#if defined(RCC_WWDG2CFGR_WWDG2LPEN)
#define __HAL_RCC_WWDG2_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->WWDG2CFGR, RCC_WWDG2CFGR_WWDG2LPEN)
#endif /* RCC_WWDG2CFGR_WWDG2LPEN */

#define __HAL_RCC_BUSPERFM_CLK_SLEEP_DISABLE()    CLEAR_BIT(RCC->BUSPERFMCFGR, RCC_BUSPERFMCFGR_BUSPERFMLPEN)
#define __HAL_RCC_VREF_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->VREFCFGR, RCC_VREFCFGR_VREFLPEN)
#define __HAL_RCC_TMPSENS_CLK_SLEEP_DISABLE()     CLEAR_BIT(RCC->TMPSENSCFGR, RCC_TMPSENSCFGR_TMPSENSLPEN)
#define __HAL_RCC_CRC_CLK_SLEEP_DISABLE()         CLEAR_BIT(RCC->CRCCFGR, RCC_CRCCFGR_CRCLPEN)
#define __HAL_RCC_BSEC_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->BSECCFGR, RCC_BSECCFGR_BSECLPEN)

#if defined(RCC_GICV2MCFGR_GICV2MLPEN)
#define __HAL_RCC_GICV2M_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->GICV2MCFGR, RCC_GICV2MCFGR_GICV2MLPEN)
#endif /* RCC_GICV2MCFGR_GICV2MLPEN */

#define __HAL_RCC_I3C1_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->I3C1CFGR, RCC_I3C1CFGR_I3C1LPEN)
#define __HAL_RCC_I3C2_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->I3C2CFGR, RCC_I3C2CFGR_I3C2LPEN)
#define __HAL_RCC_I3C3_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->I3C3CFGR, RCC_I3C3CFGR_I3C3LPEN)

#if defined(RCC_I3C4CFGR_I3C4LPEN)
#define __HAL_RCC_I3C4_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->I3C4CFGR, RCC_I3C4CFGR_I3C4LPEN)
#endif /* RCC_I3C4CFGR_I3C4LPEN */

/* for API backward compatibility */
#if defined(RCC_CCICFGR_CCILPEN)
#define __HAL_RCC_DCMI_CLK_SLEEP_DISABLE()        __HAL_RCC_CCI_CLK_SLEEP_DISABLE()
#define __HAL_RCC_PSSI_CLK_SLEEP_DISABLE()        __HAL_RCC_CCI_CLK_SLEEP_DISABLE()
#endif /* RCC_CCICFGR_CCILPEN */

#if defined(RCC_DCMIPSSICFGR_DCMIPSSILPEN )
#define __HAL_RCC_DCMI_CLK_SLEEP_DISABLE()        __HAL_RCC_DCMIPSSI_CLK_SLEEP_DISABLE()
#define __HAL_RCC_PSSI_CLK_SLEEP_DISABLE()        __HAL_RCC_DCMIPSSI_CLK_SLEEP_DISABLE()
#endif /* RCC_DCMIPSSICFGR_DCMIPSSILPEN  */

#define __HAL_RCC_OTFDEC1_CLK_SLEEP_DISABLE()     __HAL_RCC_OSPI1_CLK_SLEEP_DISABLE()

#if defined(RCC_OSPI2CFGR_OSPI2LPEN)
#define __HAL_RCC_OTFDEC2_CLK_SLEEP_DISABLE()     __HAL_RCC_OSPI2_CLK_SLEEP_DISABLE()
#endif /* RCC_OSPI2CFGR_OSPI2LPEN */

/* Clock autonomous mode enable macros */
#if defined(RCC_C3CFGR_C3AMEN)
#define __HAL_RCC_C3_CLKAM_ENABLE()               SET_BIT(RCC->C3CFGR, RCC_C3CFGR_C3AMEN)
#endif /* RCC_C3CFGR_C3AMEN */

#if defined(RCC_LPSRAM1CFGR_LPSRAM1AMEN)
#define __HAL_RCC_LPSRAM1_CLKAM_ENABLE()          SET_BIT(RCC->LPSRAM1CFGR, RCC_LPSRAM1CFGR_LPSRAM1AMEN)
#endif /* RCC_LPSRAM1CFGR_LPSRAM1AMEN */

#if defined(RCC_LPSRAM2CFGR_LPSRAM2AMEN)
#define __HAL_RCC_LPSRAM2_CLKAM_ENABLE()          SET_BIT(RCC->LPSRAM2CFGR, RCC_LPSRAM2CFGR_LPSRAM2AMEN)
#endif /* RCC_LPSRAM2CFGR_LPSRAM2AMEN */

#if defined(RCC_LPSRAM3CFGR_LPSRAM3AMEN)
#define __HAL_RCC_LPSRAM3_CLKAM_ENABLE()          SET_BIT(RCC->LPSRAM3CFGR, RCC_LPSRAM3CFGR_LPSRAM3AMEN)
#endif /* RCC_LPSRAM3CFGR_LPSRAM3AMEN */

#if defined(RCC_GPIOZCFGR_GPIOZAMEN)
#define __HAL_RCC_GPIOZ_CLKAM_ENABLE()            SET_BIT(RCC->GPIOZCFGR, RCC_GPIOZCFGR_GPIOZAMEN)
#endif /* RCC_GPIOZCFGR_GPIOZAMEN */

#if defined(RCC_LPDMACFGR_LPDMAAMEN)
#define __HAL_RCC_LPDMA_CLKAM_ENABLE()            SET_BIT(RCC->LPDMACFGR, RCC_LPDMACFGR_LPDMAAMEN)
#endif /* RCC_LPDMACFGR_LPDMAAMEN */

#if defined(RCC_HSEMCFGR_HSEMAMEN)
#define __HAL_RCC_HSEM_CLKAM_ENABLE()             SET_BIT(RCC->HSEMCFGR, RCC_HSEMCFGR_HSEMAMEN)
#endif /* RCC_HSEMCFGR_HSEMAMEN */

#if defined(RCC_IPCC2CFGR_IPCC2AMEN)
#define __HAL_RCC_IPCC2_CLKAM_ENABLE()            SET_BIT(RCC->IPCC2CFGR, RCC_IPCC2CFGR_IPCC2AMEN)
#endif /* RCC_IPCC2CFGR_IPCC2AMEN */

#if defined(RCC_RTCCFGR_RTCAMEN)
#define __HAL_RCC_RTC_CLKAM_ENABLE()              SET_BIT(RCC->RTCCFGR, RCC_RTCCFGR_RTCAMEN)
#endif /* RCC_RTCCFGR_RTCAMEN */

#if defined(RCC_LPTIM3CFGR_LPTIM3AMEN)
#define __HAL_RCC_LPTIM3_CLKAM_ENABLE()           SET_BIT(RCC->LPTIM3CFGR, RCC_LPTIM3CFGR_LPTIM3AMEN)
#endif /* RCC_LPTIM3CFGR_LPTIM3AMEN */

#if defined(RCC_LPTIM4CFGR_LPTIM4AMEN)
#define __HAL_RCC_LPTIM4_CLKAM_ENABLE()           SET_BIT(RCC->LPTIM4CFGR, RCC_LPTIM4CFGR_LPTIM4AMEN)
#endif /* RCC_LPTIM4CFGR_LPTIM4AMEN */

#if defined(RCC_LPTIM5CFGR_LPTIM5AMEN)
#define __HAL_RCC_LPTIM5_CLKAM_ENABLE()           SET_BIT(RCC->LPTIM5CFGR, RCC_LPTIM5CFGR_LPTIM5AMEN)
#endif /* RCC_LPTIM5CFGR_LPTIM5AMEN */

#if defined(RCC_SPI8CFGR_SPI8AMEN)
#define __HAL_RCC_SPI8_CLKAM_ENABLE()             SET_BIT(RCC->SPI8CFGR, RCC_SPI8CFGR_SPI8AMEN)
#endif /* RCC_SPI8CFGR_SPI8AMEN */

#if defined(RCC_LPUART1CFGR_LPUART1AMEN)
#define __HAL_RCC_LPUART1_CLKAM_ENABLE()          SET_BIT(RCC->LPUART1CFGR, RCC_LPUART1CFGR_LPUART1AMEN)
#endif /* RCC_LPUART1CFGR_LPUART1AMEN */

#if defined(RCC_I2C8CFGR_I2C8AMEN)
#define __HAL_RCC_I2C8_CLKAM_ENABLE()             SET_BIT(RCC->I2C8CFGR, RCC_I2C8CFGR_I2C8AMEN)
#endif /* RCC_I2C8CFGR_I2C8AMEN */

#if defined(RCC_ADF1CFGR_ADF1AMEN)
#define __HAL_RCC_ADF1_CLKAM_ENABLE()             SET_BIT(RCC->ADF1CFGR, RCC_ADF1CFGR_ADF1AMEN)
#endif /* RCC_ADF1CFGR_ADF1AMEN */

#if defined(RCC_IWDG5CFGR_IWDG5AMEN)
#define __HAL_RCC_IWDG5_CLKAM_ENABLE()            SET_BIT(RCC->IWDG5CFGR, RCC_IWDG5CFGR_IWDG5AMEN)
#endif /* RCC_IWDG5CFGR_IWDG5AMEN */

#if defined(RCC_WWDG2CFGR_WWDG2AMEN)
#define __HAL_RCC_WWDG2_CLKAM_ENABLE()            SET_BIT(RCC->WWDG2CFGR, RCC_WWDG2CFGR_WWDG2AMEN)
#endif /* RCC_WWDG2CFGR_WWDG2AMEN */

#if defined(RCC_I3C4CFGR_I3C4AMEN)
#define __HAL_RCC_I3C4_CLKAM_ENABLE()             SET_BIT(RCC->I3C4CFGR, RCC_I3C4CFGR_I3C4AMEN)
#endif /* RCC_I3C4CFGR_I3C4AMEN */

/* Clock autonomous mode disable macros */
#if defined(RCC_C3CFGR_C3AMEN)
#define __HAL_RCC_C3_CLKAM_DISABLE()              CLEAR_BIT(RCC->C3CFGR, RCC_C3CFGR_C3AMEN)
#endif /* RCC_C3CFGR_C3AMEN */

