zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rcc.h
#if defined(RCC_LPSRAM1CFGR_LPSRAM1AMEN)
#define __HAL_RCC_LPSRAM1_CLKAM_DISABLE()         CLEAR_BIT(RCC->LPSRAM1CFGR, RCC_LPSRAM1CFGR_LPSRAM1AMEN)
#endif /* RCC_LPSRAM1CFGR_LPSRAM1AMEN */

#if defined(RCC_LPSRAM2CFGR_LPSRAM2AMEN)
#define __HAL_RCC_LPSRAM2_CLKAM_DISABLE()         CLEAR_BIT(RCC->LPSRAM2CFGR, RCC_LPSRAM2CFGR_LPSRAM2AMEN)
#endif /* RCC_LPSRAM2CFGR_LPSRAM2AMEN */

#if defined(RCC_LPSRAM3CFGR_LPSRAM3AMEN)
#define __HAL_RCC_LPSRAM3_CLKAM_DISABLE()         CLEAR_BIT(RCC->LPSRAM3CFGR, RCC_LPSRAM3CFGR_LPSRAM3AMEN)
#endif /* RCC_LPSRAM3CFGR_LPSRAM3AMEN */

#if defined(RCC_GPIOZCFGR_GPIOZAMEN)
#define __HAL_RCC_GPIOZ_CLKAM_DISABLE()           CLEAR_BIT(RCC->GPIOZCFGR, RCC_GPIOZCFGR_GPIOZAMEN)
#endif /* RCC_GPIOZCFGR_GPIOZAMEN */

#if defined(RCC_LPDMACFGR_LPDMAAMEN)
#define __HAL_RCC_LPDMA_CLKAM_DISABLE()           CLEAR_BIT(RCC->LPDMACFGR, RCC_LPDMACFGR_LPDMAAMEN)
#endif /* RCC_LPDMACFGR_LPDMAAMEN */

#if defined(RCC_HSEMCFGR_HSEMAMEN)
#define __HAL_RCC_HSEM_CLKAM_DISABLE()            CLEAR_BIT(RCC->HSEMCFGR, RCC_HSEMCFGR_HSEMAMEN)
#endif /* RCC_HSEMCFGR_HSEMAMEN */

#if defined(RCC_IPCC2CFGR_IPCC2AMEN)
#define __HAL_RCC_IPCC2_CLKAM_DISABLE()           CLEAR_BIT(RCC->IPCC2CFGR, RCC_IPCC2CFGR_IPCC2AMEN)
#endif /* RCC_IPCC2CFGR_IPCC2AMEN */

#if defined(RCC_RTCCFGR_RTCAMEN)
#define __HAL_RCC_RTC_CLKAM_DISABLE()             CLEAR_BIT(RCC->RTCCFGR, RCC_RTCCFGR_RTCAMEN)
#endif /* RCC_RTCCFGR_RTCAMEN */

#if defined(RCC_LPTIM3CFGR_LPTIM3AMEN)
#define __HAL_RCC_LPTIM3_CLKAM_DISABLE()          CLEAR_BIT(RCC->LPTIM3CFGR, RCC_LPTIM3CFGR_LPTIM3AMEN)
#endif /* RCC_LPTIM3CFGR_LPTIM3AMEN */

#if defined(RCC_LPTIM4CFGR_LPTIM4AMEN)
#define __HAL_RCC_LPTIM4_CLKAM_DISABLE()          CLEAR_BIT(RCC->LPTIM4CFGR, RCC_LPTIM4CFGR_LPTIM4AMEN)
#endif /* RCC_LPTIM4CFGR_LPTIM4AMEN */

#if defined(RCC_LPTIM5CFGR_LPTIM5AMEN)
#define __HAL_RCC_LPTIM5_CLKAM_DISABLE()          CLEAR_BIT(RCC->LPTIM5CFGR, RCC_LPTIM5CFGR_LPTIM5AMEN)
#endif /* RCC_LPTIM5CFGR_LPTIM5AMEN */

#if defined(RCC_SPI8CFGR_SPI8AMEN)
#define __HAL_RCC_SPI8_CLKAM_DISABLE()            CLEAR_BIT(RCC->SPI8CFGR, RCC_SPI8CFGR_SPI8AMEN)
#endif /* RCC_SPI8CFGR_SPI8AMEN */

#if defined(RCC_LPUART1CFGR_LPUART1AMEN)
#define __HAL_RCC_LPUART1_CLKAM_DISABLE()         CLEAR_BIT(RCC->LPUART1CFGR, RCC_LPUART1CFGR_LPUART1AMEN)
#endif /* RCC_LPUART1CFGR_LPUART1AMEN */

#if defined(RCC_I2C8CFGR_I2C8AMEN)
#define __HAL_RCC_I2C8_CLKAM_DISABLE()            CLEAR_BIT(RCC->I2C8CFGR, RCC_I2C8CFGR_I2C8AMEN)
#endif /* RCC_I2C8CFGR_I2C8AMEN */

#if defined(RCC_ADF1CFGR_ADF1AMEN)
#define __HAL_RCC_ADF1_CLKAM_DISABLE()            CLEAR_BIT(RCC->ADF1CFGR, RCC_ADF1CFGR_ADF1AMEN)
#endif /* RCC_ADF1CFGR_ADF1AMEN */

#if defined(RCC_IWDG5CFGR_IWDG5AMEN)
#define __HAL_RCC_IWDG5_CLKAM_DISABLE()           CLEAR_BIT(RCC->IWDG5CFGR, RCC_IWDG5CFGR_IWDG5AMEN)
#endif /* RCC_IWDG5CFGR_IWDG5AMEN */

#if defined(RCC_WWDG2CFGR_WWDG2AMEN)
#define __HAL_RCC_WWDG2_CLKAM_DISABLE()           CLEAR_BIT(RCC->WWDG2CFGR, RCC_WWDG2CFGR_WWDG2AMEN)
#endif /*RCC_WWDG2CFGR_WWDG2AMEN*/

#if defined(RCC_I3C4CFGR_I3C4AMEN)
#define __HAL_RCC_I3C4_CLKAM_DISABLE()            CLEAR_BIT(RCC->I3C4CFGR, RCC_I3C4CFGR_I3C4AMEN)
#endif /* RCC_I3C4CFGR_I3C4AMEN */

/* Peripheral clock status macros */
#if defined(RCC_VDERAMCFGR_VDERAMEN)
#define __HAL_RCC_VDERAM_IS_CLK_ENABLED()         (READ_BIT(RCC->VDERAMCFGR, RCC_VDERAMCFGR_VDERAMEN) != 0U)
#endif /* RCC_VDERAMCFGR_VDERAMEN */

#define __HAL_RCC_SERC_IS_CLK_ENABLED()           (READ_BIT(RCC->SERCCFGR, RCC_SERCCFGR_SERCEN) != 0U)
#define __HAL_RCC_OSPIIOM_IS_CLK_ENABLED()        (READ_BIT(RCC->OSPIIOMCFGR, RCC_OSPIIOMCFGR_OSPIIOMEN) != 0U)
#define __HAL_RCC_VDEC_IS_CLK_ENABLED()           (READ_BIT(RCC->VDECCFGR, RCC_VDECCFGR_VDECEN) != 0U)

#if defined(RCC_VENCCFGR_VENCEN)
#define __HAL_RCC_VENC_IS_CLK_ENABLED()           (READ_BIT(RCC->VENCCFGR, RCC_VENCCFGR_VENCEN) != 0U)
#endif /* RCC_VENCCFGR_VENCEN */

#if defined(RCC_C3CFGR_C3EN)
#define __HAL_RCC_C3_IS_CLK_ENABLED()             (READ_BIT(RCC->C3CFGR, RCC_C3CFGR_C3EN) != 0U)
#endif /* RCC_C3CFGR_C3EN */

#define __HAL_RCC_SYSRAM_IS_CLK_ENABLED()         (READ_BIT(RCC->SYSRAMCFGR, RCC_SYSRAMEN) != 0U)
#define __HAL_RCC_SRAM1_IS_CLK_ENABLED()          (READ_BIT(RCC->SRAM1CFGR, RCC_SRAM1CFGR_SRAM1EN) != 0U)

#if defined(RCC_SRAM2CFGR_SRAM2EN)
#define __HAL_RCC_SRAM2_IS_CLK_ENABLED()          (READ_BIT(RCC->SRAM2CFGR, RCC_SRAM2CFGR_SRAM2EN) != 0U)
#endif /* RCC_SRAM2CFGR_SRAM2EN */

#define __HAL_RCC_RETRAM_IS_CLK_ENABLED()         (READ_BIT(RCC->RETRAMCFGR, RCC_RETRAMCFGR_RETRAMEN) != 0U)
#define __HAL_RCC_BKPSRAM_IS_CLK_ENABLED()        (READ_BIT(RCC->BKPSRAM, RCC_BKPSRAMCFGR_BKPSRAMEN) != 0U)

#if defined(RCC_LPSRAM1CFGR_LPSRAM1EN)
#define __HAL_RCC_LPSRAM1_IS_CLK_ENABLED()        (READ_BIT(RCC->LPSRAM1CFGR, RCC_LPSRAM1CFGR_LPSRAM1EN) != 0U)
#endif /* RCC_LPSRAM1CFGR_LPSRAM1EN */

#if defined(RCC_LPSRAM2CFGR_LPSRAM12EN)
#define __HAL_RCC_LPSRAM2_IS_CLK_ENABLED()        (READ_BIT(RCC->LPSRAM2CFGR, RCC_LPSRAM2CFGR_LPSRAM2EN) != 0U)
#endif /* RCC_LPSRAM2CFGR_LPSRAM2EN */

#if defined(RCC_LPSRAM3CFGR_LPSRAM3EN)
#define __HAL_RCC_LPSRAM3_IS_CLK_ENABLED()        (READ_BIT(RCC->LPSRAM3CFGR, RCC_LPSRAM3CFGR_LPSRAM3EN) != 0U)
#endif /* RCC_LPSRAM3CFGR_LPSRAM3EN */

#define __HAL_RCC_OSPI1_IS_CLK_ENABLED()          (READ_BIT(RCC->OSPI1CFGR, RCC_OSPI1CFGR_OSPI1EN) != 0U)

#if defined(RCC_OSPI2CFGR_OSPI2EN)
#define __HAL_RCC_OSPI2_IS_CLK_ENABLED()          (READ_BIT(RCC->OSPI2CFGR, RCC_OSPI2CFGR_OSPI2EN) != 0U)
#endif /* RCC_OSPI2CFGR_OSPI2EN */

#if defined(RCC_STMCFGR_STMLPEN)
#define __HAL_RCC_STM_IS_CLK_ENABLED()         (READ_BIT(RCC->STMCFGR, RCC_STMCFGR_STMEN) != 0U)
#endif /* RCC_STMCFGR_STMEN */

#define __HAL_RCC_ETR_IS_CLK_ENABLED()            (READ_BIT(RCC->ETRCFGR, RCC_ETRCFGR_ETREN) != 0U)
#define __HAL_RCC_GPIOA_IS_CLK_ENABLED()          (READ_BIT(RCC->GPIOACFGR, RCC_GPIOACFGR_GPIOxEN) != 0U)
#define __HAL_RCC_GPIOB_IS_CLK_ENABLED()          (READ_BIT(RCC->GPIOBCFGR, RCC_GPIOBCFGR_GPIOxEN) != 0U)
#define __HAL_RCC_GPIOC_IS_CLK_ENABLED()          (READ_BIT(RCC->GPIOCCFGR, RCC_GPIOCCFGR_GPIOxEN) != 0U)
#define __HAL_RCC_GPIOD_IS_CLK_ENABLED()          (READ_BIT(RCC->GPIODCFGR, RCC_GPIODCFGR_GPIOxEN) != 0U)
#define __HAL_RCC_GPIOE_IS_CLK_ENABLED()          (READ_BIT(RCC->GPIOECFGR, RCC_GPIOECFGR_GPIOxEN) != 0U)
#define __HAL_RCC_GPIOF_IS_CLK_ENABLED()          (READ_BIT(RCC->GPIOFCFGR, RCC_GPIOFCFGR_GPIOxEN) != 0U)
#define __HAL_RCC_GPIOG_IS_CLK_ENABLED()          (READ_BIT(RCC->GPIOGCFGR, RCC_GPIOGCFGR_GPIOxEN) != 0U)
#define __HAL_RCC_GPIOH_IS_CLK_ENABLED()          (READ_BIT(RCC->GPIOHCFGR, RCC_GPIOHCFGR_GPIOxEN) != 0U)
#define __HAL_RCC_GPIOI_IS_CLK_ENABLED()          (READ_BIT(RCC->GPIOICFGR, RCC_GPIOICFGR_GPIOxEN) != 0U)

