zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rcc.h
#if defined(RCC_GPIOJCFGR_GPIOxEN)
#define __HAL_RCC_GPIOJ_IS_CLK_ENABLED()          (READ_BIT(RCC->GPIOJCFGR, RCC_GPIOJCFGR_GPIOxEN) != 0U)
#endif /* RCC_GPIOJCFGR_GPIOxEN */

#if defined(RCC_GPIOKCFGR_GPIOxEN)
#define __HAL_RCC_GPIOK_IS_CLK_ENABLED()          (READ_BIT(RCC->GPIOKCFGR, RCC_GPIOKCFGR_GPIOxEN) != 0U)
#endif /* RCC_GPIOKCFGR_GPIOxEN */

#define __HAL_RCC_GPIOZ_IS_CLK_ENABLED()          (READ_BIT(RCC->GPIOZCFGR, RCC_GPIOZCFGR_GPIOZEN) != 0U)
#define __HAL_RCC_HPDMA1_IS_CLK_ENABLED()         (READ_BIT(RCC->HPDMA1CFGR, RCC_HPDMA1CFGR_HPDMA1EN) != 0U)
#define __HAL_RCC_HPDMA2_IS_CLK_ENABLED()         (READ_BIT(RCC->HPDMA2CFGR, RCC_HPDMA2CFGR_HPDMA2EN) != 0U)
#define __HAL_RCC_HPDMA3_IS_CLK_ENABLED()         (READ_BIT(RCC->HPDMA3CFGR, RCC_HPDMA3CFGR_HPDMA3EN) != 0U)

#if defined(RCC_LPDMACFGR_LPDMAEN)
#define __HAL_RCC_LPDMA_IS_CLK_ENABLED()          (READ_BIT(RCC->LPDMACFGR, RCC_LPDMACFGR_LPDMAEN) != 0U)
#endif /* RCC_LPDMACFGR_LPDMAEN */

#if defined(RCC_HSEMCFGR_HSEMEN)
#define __HAL_RCC_HSEM_IS_CLK_ENABLED()           (READ_BIT(RCC->HSEMCFGR, RCC_HSEMCFGR_HSEMEN) != 0U)
#endif /* RCC_HSEMCFGR_HSEMEN */

#define __HAL_RCC_IPCC1_IS_CLK_ENABLED()          (READ_BIT(RCC->IPCC1CFGR, RCC_IPCC1CFGR_IPCC1EN) != 0U)

#if defined(RCC_IPCC2CFGR_IPCC2EN)
#define __HAL_RCC_IPCC2_IS_CLK_ENABLED()          (READ_BIT(RCC->IPCC2CFGR, RCC_IPCC2CFGR_IPCC2EN) != 0U)
#endif /* RCC_IPCC2CFGR_IPCC2LPEN */

#define __HAL_RCC_RTC_IS_CLK_ENABLED()            (READ_BIT(RCC->RTCCFGR, RCC_RTCCFGR_RTCEN) != 0U)
#define __HAL_RCC_SYSCPU1_IS_CLK_ENABLED()        (READ_BIT(RCC->SYSCPU1CFGR, RCC_SYSCPU1CFGR_SYSCPU1EN) != 0U)
#define __HAL_RCC_IS2M_IS_CLK_ENABLED()           (READ_BIT(RCC->IS2MCFGR, RCC_IS2MCFGR_IS2MEN) != 0U)
#define __HAL_RCC_TIM1_IS_CLK_ENABLED()           (READ_BIT(RCC->TIM1CFGR, RCC_TIM1CFGR_TIM1EN) != 0U)
#define __HAL_RCC_TIM2_IS_CLK_ENABLED()           (READ_BIT(RCC->TIM2CFGR, RCC_TIM2CFGR_TIM2EN) != 0U)
#define __HAL_RCC_TIM3_IS_CLK_ENABLED()           (READ_BIT(RCC->TIM3CFGR, RCC_TIM3CFGR_TIM3EN) != 0U)
#define __HAL_RCC_TIM4_IS_CLK_ENABLED()           (READ_BIT(RCC->TIM4CFGR, RCC_TIM4CFGR_TIM4EN) != 0U)
#define __HAL_RCC_TIM5_IS_CLK_ENABLED()           (READ_BIT(RCC->TIM5CFGR, RCC_TIM5CFGR_TIM5EN) != 0U)
#define __HAL_RCC_TIM6_IS_CLK_ENABLED()           (READ_BIT(RCC->TIM6CFGR, RCC_TIM6CFGR_TIM6EN) != 0U)
#define __HAL_RCC_TIM7_IS_CLK_ENABLED()           (READ_BIT(RCC->TIM7CFGR, RCC_TIM7CFGR_TIM7EN) != 0U)
#define __HAL_RCC_TIM8_IS_CLK_ENABLED()           (READ_BIT(RCC->TIM8CFGR, RCC_TIM8CFGR_TIM8EN) != 0U)
#define __HAL_RCC_TIM10_IS_CLK_ENABLED()          (READ_BIT(RCC->TIM10CFGR, RCC_TIM10CFGR_TIM10EN) != 0U)
#define __HAL_RCC_TIM11_IS_CLK_ENABLED()          (READ_BIT(RCC->TIM11CFGR, RCC_TIM11CFGR_TIM11EN) != 0U)
#define __HAL_RCC_TIM12_IS_CLK_ENABLED()          (READ_BIT(RCC->TIM12CFGR, RCC_TIM12CFGR_TIM12EN) != 0U)
#define __HAL_RCC_TIM13_IS_CLK_ENABLED()          (READ_BIT(RCC->TIM13CFGR, RCC_TIM13CFGR_TIM13EN) != 0U)
#define __HAL_RCC_TIM14_IS_CLK_ENABLED()          (READ_BIT(RCC->TIM14CFGR, RCC_TIM14CFGR_TIM14EN) != 0U)
#define __HAL_RCC_TIM15_IS_CLK_ENABLED()          (READ_BIT(RCC->TIM15CFGR, RCC_TIM15CFGR_TIM15EN) != 0U)
#define __HAL_RCC_TIM16_IS_CLK_ENABLED()          (READ_BIT(RCC->TIM16CFGR, RCC_TIM16CFGR_TIM16EN) != 0U)
#define __HAL_RCC_TIM17_IS_CLK_ENABLED()          (READ_BIT(RCC->TIM17CFGR, RCC_TIM17CFGR_TIM17EN) != 0U)

#if defined(RCC_TIM20CFGR_TIM20EN)
#define __HAL_RCC_TIM20_IS_CLK_ENABLED()          (READ_BIT(RCC->TIM20CFGR, RCC_TIM20CFGR_TIM20EN) != 0U)
#endif /* RCC_TIM20CFGR_TIM20EN */

#define __HAL_RCC_LPTIM1_IS_CLK_ENABLED()         (READ_BIT(RCC->LPTIM1CFGR, RCC_LPTIM1CFGR_LPTIM1EN) != 0U)
#define __HAL_RCC_LPTIM2_IS_CLK_ENABLED()         (READ_BIT(RCC->LPTIM2CFGR, RCC_LPTIM2CFGR_LPTIM2EN) != 0U)
#define __HAL_RCC_LPTIM3_IS_CLK_ENABLED()         (READ_BIT(RCC->LPTIM3CFGR, RCC_LPTIM3CFGR_LPTIM3EN) != 0U)
#define __HAL_RCC_LPTIM4_IS_CLK_ENABLED()         (READ_BIT(RCC->LPTIM4CFGR, RCC_LPTIM4CFGR_LPTIM4EN) != 0U)
#define __HAL_RCC_LPTIM5_IS_CLK_ENABLED()         (READ_BIT(RCC->LPTIM5CFGR, RCC_LPTIM5CFGR_LPTIM5EN) != 0U)
#define __HAL_RCC_SPI1_IS_CLK_ENABLED()           (READ_BIT(RCC->SPI1CFGR, RCC_SPI1CFGR_SPI1EN) != 0U)
#define __HAL_RCC_SPI2_IS_CLK_ENABLED()           (READ_BIT(RCC->SPI2CFGR, RCC_SPI2CFGR_SPI2EN) != 0U)
#define __HAL_RCC_SPI3_IS_CLK_ENABLED()           (READ_BIT(RCC->SPI3CFGR, RCC_SPI3CFGR_SPI3EN) != 0U)
#define __HAL_RCC_SPI4_IS_CLK_ENABLED()           (READ_BIT(RCC->SPI4CFGR, RCC_SPI4CFGR_SPI4EN) != 0U)
#define __HAL_RCC_SPI5_IS_CLK_ENABLED()           (READ_BIT(RCC->SPI5CFGR, RCC_SPI5CFGR_SPI5EN) != 0U)
#define __HAL_RCC_SPI6_IS_CLK_ENABLED()           (READ_BIT(RCC->SPI6CFGR, RCC_SPI6CFGR_SPI6EN) != 0U)

#if defined(RCC_SPI7CFGR_SPI7EN)
#define __HAL_RCC_SPI7_IS_CLK_ENABLED()           (READ_BIT(RCC->SPI7CFGR, RCC_SPI7CFGR_SPI7EN) != 0U)
#endif /* RCC_SPI7CFGR_SPI7EN */

#if defined(RCC_SPI8CFGR_SPI8EN)
#define __HAL_RCC_SPI8_IS_CLK_ENABLED()           (READ_BIT(RCC->SPI8CFGR, RCC_SPI8CFGR_SPI8EN) != 0U)
#endif /* RCC_SPI8CFGR_SPI8EN */

#define __HAL_RCC_SPDIFRX_IS_CLK_ENABLED()        (READ_BIT(RCC->SPDIFRXCFGR, RCC_SPDIFRXCFGR_SPDIFRXEN) != 0U)
#define __HAL_RCC_USART1_IS_CLK_ENABLED()         (READ_BIT(RCC->USART1CFGR, RCC_USART1CFGR_USART1EN) != 0U)
#define __HAL_RCC_USART2_IS_CLK_ENABLED()         (READ_BIT(RCC->USART2CFGR, RCC_USART2CFGR_USART2EN) != 0U)
#define __HAL_RCC_USART3_IS_CLK_ENABLED()         (READ_BIT(RCC->USART3CFGR, RCC_USART3CFGR_USART3EN) != 0U)
#define __HAL_RCC_UART4_IS_CLK_ENABLED()          (READ_BIT(RCC->UART4CFGR, RCC_UART4CFGR_UART4EN) != 0U)
#define __HAL_RCC_UART5_IS_CLK_ENABLED()          (READ_BIT(RCC->UART5CFGR, RCC_UART5CFGR_UART5EN) != 0U)
#define __HAL_RCC_USART6_IS_CLK_ENABLED()         (READ_BIT(RCC->USART6CFGR, RCC_USART6CFGR_USART6EN) != 0U)
#define __HAL_RCC_UART7_IS_CLK_ENABLED()          (READ_BIT(RCC->UART7CFGR, RCC_UART7CFGR_UART7EN) != 0U)

#if defined(RCC_UART8CFGR_UART8EN)
#define __HAL_RCC_UART8_IS_CLK_ENABLED()          (READ_BIT(RCC->UART8CFGR, RCC_UART8CFGR_UART8EN) != 0U)
#endif /* RCC_UART8CFGR_UART8EN */

#if defined(RCC_UART9CFGR_UART9EN)
#define __HAL_RCC_UART9_IS_CLK_ENABLED()          (READ_BIT(RCC->UART9CFGR, RCC_UART9CFGR_UART9EN) != 0U)
#endif /* RCC_UART9CFGR_UART9EN */

#define __HAL_RCC_LPUART1_IS_CLK_ENABLED()        (READ_BIT(RCC->LPUART1CFGR, RCC_LPUART1CFGR_LPUART1EN) != 0U)
#define __HAL_RCC_I2C1_IS_CLK_ENABLED()           (READ_BIT(RCC->I2C1CFGR, RCC_I2C1CFGR_I2C1EN) != 0U)
#define __HAL_RCC_I2C2_IS_CLK_ENABLED()           (READ_BIT(RCC->I2C2CFGR, RCC_I2C2CFGR_I2C2EN) != 0U)
#define __HAL_RCC_I2C3_IS_CLK_ENABLED()           (READ_BIT(RCC->I2C3CFGR, RCC_I2C3CFGR_I2C3EN) != 0U)

#if defined(RCC_I2C4CFGR_I2C4EN)
#define __HAL_RCC_I2C4_IS_CLK_ENABLED()           (READ_BIT(RCC->I2C4CFGR, RCC_I2C4CFGR_I2C4EN) != 0U)
#endif /* RCC_I2C4CFGR_I2C4EN */

#if defined(RCC_I2C5CFGR_I2C5EN)
#define __HAL_RCC_I2C5_IS_CLK_ENABLED()           (READ_BIT(RCC->I2C5CFGR, RCC_I2C5CFGR_I2C5EN) != 0U)
#endif /* RCC_I2C5CFGR_I2C5EN */

#if defined(RCC_I2C6CFGR_I2C6EN)
#define __HAL_RCC_I2C6_IS_CLK_ENABLED()           (READ_BIT(RCC->I2C6CFGR, RCC_I2C6CFGR_I2C6EN) != 0U)
#endif /* RCC_I2C6CFGR_I2C6EN */

#if defined(RCC_I2C7CFGR_I2C7EN)
#define __HAL_RCC_I2C7_IS_CLK_ENABLED()           (READ_BIT(RCC->I2C7CFGR, RCC_I2C7CFGR_I2C7EN) != 0U)
#endif /* RCC_I2C7CFGR_I2C7EN */

