zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rcc.h
#if defined(RCC_I2C8CFGR_I2C8EN)
#define __HAL_RCC_I2C8_IS_CLK_ENABLED()           (READ_BIT(RCC->I2C8CFGR, RCC_I2C8CFGR_I2C8EN) != 0U)
#endif /* RCC_I2C8CFGR_I2C8EN */

#define __HAL_RCC_SAI1_IS_CLK_ENABLED()           (READ_BIT(RCC->SAI1CFGR, RCC_SAI1CFGR_SAI1EN) != 0U)
#define __HAL_RCC_SAI2_IS_CLK_ENABLED()           (READ_BIT(RCC->SAI2CFGR, RCC_SAI2CFGR_SAI2EN) != 0U)
#define __HAL_RCC_SAI3_IS_CLK_ENABLED()           (READ_BIT(RCC->SAI3CFGR, RCC_SAI3CFGR_SAI3EN) != 0U)
#define __HAL_RCC_SAI4_IS_CLK_ENABLED()           (READ_BIT(RCC->SAI4CFGR, RCC_SAI4CFGR_SAI4EN) != 0U)
#define __HAL_RCC_MDF1_IS_CLK_ENABLED()           (READ_BIT(RCC->MDF1CFGR, RCC_MDF1CFGR_MDF1EN) != 0U)
#define __HAL_RCC_ADF1_IS_CLK_ENABLED()           (READ_BIT(RCC->ADF1CFGR, RCC_ADF1CFGR_ADF1EN) != 0U)
#define __HAL_RCC_FDCAN_IS_CLK_ENABLED()          (READ_BIT(RCC->FDCANCFGR, RCC_FDCANCFGR_FDCANEN) != 0U)
#define __HAL_RCC_HDP_IS_CLK_ENABLED()            (READ_BIT(RCC->HDPCFGR, RCC_HDPCFGR_HDPEN) != 0U)

#if defined(RCC_ADC1CFGR_ADC1EN)
#define __HAL_RCC_ADC1_IS_CLK_ENABLED()           (READ_BIT(RCC->ADC1CFGR, RCC_ADC1CFGR_ADC1EN) != 0U)
#endif /* RCC_ADC1CFGR_ADC1EN */

#if defined(RCC_ADC2CFGR_ADC2EN)
#define __HAL_RCC_ADC2_IS_CLK_ENABLED()           (READ_BIT(RCC->ADC2CFGR, RCC_ADC2CFGR_ADC2EN) != 0U)
#endif /* RCC_ADC2CFGR_ADC2EN */

#if defined(RCC_ADC12CFGR_ADC12EN)
#define __HAL_RCC_ADC12_IS_CLK_ENABLED()          (READ_BIT(RCC->ADC12CFGR, RCC_ADC12CFGR_ADC12EN) != 0U)
#endif /* RCC_ADC12CFGR_ADC12EN */

#if defined(RCC_ADC3CFGR_ADC3EN)
#define __HAL_RCC_ADC3_IS_CLK_ENABLED()           (READ_BIT(RCC->ADC3CFGR, RCC_ADC3CFGR_ADC3EN) != 0U)
#endif /*RCC_ADC3CFGR_ADC3EN */

#define __HAL_RCC_ETH1_IS_CLK_ENABLED()           (READ_BIT(RCC->ETH1CFGR, RCC_ETH1CFGR_ETH1EN) != 0U)
#define __HAL_RCC_ETH1MAC_IS_CLK_ENABLED()        (READ_BIT(RCC->ETH1MACCFGR, RCC_ETH1MACCFGR_ETH1MACEN) != 0U)
#define __HAL_RCC_ETH1TX_IS_CLK_ENABLED()         (READ_BIT(RCC->ETH1TXCFGR, RCC_ETH1TXCFGR_ETH1TXEN) != 0U)
#define __HAL_RCC_ETH1RX_IS_CLK_ENABLED()         (READ_BIT(RCC->ETH1RXCFGR, RCC_ETH1RXCFGR_ETH1RXEN) != 0U)
#define __HAL_RCC_ETH2_IS_CLK_ENABLED()           (READ_BIT(RCC->ETH2CFGR, RCC_ETH2CFGR_ETH2EN) != 0U)
#define __HAL_RCC_ETH2MAC_IS_CLK_ENABLED()        (READ_BIT(RCC->ETH2MACCFGR, RCC_ETH2MACCFGR_ETH2MACEN) != 0U)
#define __HAL_RCC_ETH2TX_IS_CLK_ENABLED()         (READ_BIT(RCC->ETH2TXCFGR, RCC_ETH2TXCFGR_ETH2TXEN) != 0U)
#define __HAL_RCC_ETH2RX_IS_CLK_ENABLED()         (READ_BIT(RCC->ETH2RXCFGR, RCC_ETH2RXCFGR_ETH2RXEN) != 0U)


#define __HAL_RCC_USB2PHY1_IS_CLK_ENABLED()       (READ_BIT(RCC->USB2PHY1CFGR, RCC_USB2PHY1CFGR_USB2PHY1EN) != 0U)
#define __HAL_RCC_USB2PHY2_IS_CLK_ENABLED()       (READ_BIT(RCC->USB2PHY2CFGR, RCC_USB2PHY2CFGR_USB2PHY2EN) != 0U)

#if defined(RCC_USB3DRDCFGR_USB3DRDEN)
#define __HAL_RCC_USB3DRD_IS_CLK_ENABLED()        (READ_BIT(RCC->USB3DRDCFGR, RCC_USB3DRDCFGR_USB3DRDEN) != 0U)
#endif /* RCC_USB3DRDCFGR_USB3DRDEN */

#if defined(RCC_USB3PCIEPHYCFGR_USB3PCIEPHYEN)
#define __HAL_RCC_USB3PCIEPHY_IS_CLK_ENABLED()    (READ_BIT(RCC->USB3PCIEPHYCFGR, RCC_USB3PCIEPHYCFGR_USB3PCIEPHYEN) \
                                                   != 0U)
#endif /* RCC_USB3PCIEPHYCFGR_USB3PCIEPHYEN */

#if defined(RCC_PCIECFGR_PCIEEN)
#define __HAL_RCC_PCIE_IS_CLK_ENABLED()           (READ_BIT(RCC->PCIECFGR, RCC_PCIECFGR_PCIEEN) != 0U)
#endif /* RCC_PCIECFGR_PCIEEN */

#if defined(RCC_UCPDCFGR_UCPDEN)
#define __HAL_RCC_UCPD1_IS_CLK_ENABLED()          (READ_BIT(RCC->UCPDCFGR, RCC_UCPDCFGR_UCPDEN) != 0U)
#endif /* RCC_UCPDCFGR_UCPDEN */

#define __HAL_RCC_FMC_IS_CLK_ENABLED()            (READ_BIT(RCC->FMCCFGR, RCC_FMCCFGR_FMCEN) != 0U)
#define __HAL_RCC_SDMMC1_IS_CLK_ENABLED()         (READ_BIT(RCC->SDMMC1CFGR, RCC_SDMMC1CFGR_SDMMC1EN) != 0U)
#define __HAL_RCC_SDMMC2_IS_CLK_ENABLED()         (READ_BIT(RCC->SDMMC2CFGR, RCC_SDMMC2CFGR_SDMMC2EN) != 0U)
#define __HAL_RCC_SDMMC3_IS_CLK_ENABLED()         (READ_BIT(RCC->SDMMC3CFGR, RCC_SDMMC3CFGR_SDMMC3EN) != 0U)
#define __HAL_RCC_GPU_IS_CLK_ENABLED()            (READ_BIT(RCC->GPUCFGR, RCC_GPUCFGR_GPUEN) != 0U)
#define __HAL_RCC_LTDC_IS_CLK_ENABLED()           (READ_BIT(RCC->LTDCCFGR, RCC_LTDCCFGR_LTDCEN) != 0U)

#if defined(RCC_DSICFGR_DSIEN)
#define __HAL_RCC_DSI_IS_CLK_ENABLED()            (READ_BIT(RCC->DSICFGR, RCC_DSICFGR_DSIEN) != 0U)
#endif /* RCC_DSICFGR_DSIEN */

#define __HAL_RCC_LVDS_IS_CLK_ENABLED()           (READ_BIT(RCC->LVDSCFGR, RCC_LVDSCFGR_LVDSEN) != 0U)

#if defined(RCC_CSICFGR_CSIEN)
#define __HAL_RCC_CSI_IS_CLK_ENABLED()            (READ_BIT(RCC->CSICFGR, RCC_CSICFGR_CSIEN) != 0U)
#endif /* RCC_CSICFGR_CSIEN */

#if defined(RCC_CSI2CFGR_CSI2EN)
#define __HAL_RCC_CSI2_IS_CLK_ENABLED()           (READ_BIT(RCC->CSI2CFGR, RCC_CSI2CFGR_CSI2EN) != 0U)
#endif /* RCC_CSI2CFGR_CSI2EN */

#define __HAL_RCC_DCMIPP_IS_CLK_ENABLED()         (READ_BIT(RCC->DCMIPPCFGR, RCC_DCMIPPCFGR_DCMIPPEN) != 0U)

#if defined(RCC_DCMIPSSICFGR_DCMIPSSIEN)
#define __HAL_RCC_DCMIPSSI_IS_CLK_ENABLED()       (READ_BIT(RCC->DCMIPSSICFGR, RCC_DCMIPSSICFGR_DCMIPSSIEN) != 0U)
#endif /*RCC_DCMIPSSICFGR_DCMIPSSIEN*/

#if defined(RCC_CCICFGR_CCIEN)
#define __HAL_RCC_CCI_IS_CLK_ENABLED()            (READ_BIT(RCC->CCICFGR, RCC_CCICFGR_CCIEN) != 0U)
#endif /* RCC_CCICFGR_CCIEN */

#if defined(RCC_RNGCFGR_RNGEN)
#define __HAL_RCC_RNG_IS_CLK_ENABLED()            (READ_BIT(RCC->RNGCFGR, RCC_RNGCFGR_RNGEN) != 0U)
#endif /* RCC_RNGCFGR_RNGEN */

#if defined(RCC_RNG1CFGR_RNG1EN)
#define __HAL_RCC_RNG1_IS_CLK_ENABLED()           (READ_BIT(RCC->RNG1CFGR, RCC_RNG1CFGR_RNG1EN) != 0U)
#endif /* RCC_RNG1CFGR_RNG1EN */

#if defined(RCC_RNG2CFGR_RNG2EN)
#define __HAL_RCC_RNG2_IS_CLK_ENABLED()           (READ_BIT(RCC->RNG2CFGR, RCC_RNG2CFGR_RNG2EN) != 0U)
#endif /* RCC_RNG2CFGR_RNG2EN */

#define __HAL_RCC_PKA_IS_CLK_ENABLED()            (READ_BIT(RCC->PKACFGR, RCC_PKACFGR_PKAEN) != 0U)
#define __HAL_RCC_SAES_IS_CLK_ENABLED()           (READ_BIT(RCC->SAESCFGR, RCC_SAESCFGR_SAESEN) != 0U)

#if defined(RCC_HASHCFGR_HASHEN)
#define __HAL_RCC_HASH_IS_CLK_ENABLED()           (READ_BIT(RCC->HASHCFGR, RCC_HASHCFGR_HASHEN) != 0U)
#endif /* RCC_HASHCFGR_HASHEN */

#if defined(RCC_HASH1CFGR_HASH1EN)
#define __HAL_RCC_HASH1_IS_CLK_ENABLED()          (READ_BIT(RCC->HASH1CFGR, RCC_HASHCFGR_HASHEN) != 0U)
#endif /* RCC_HASH1CFGR_HASH1EN */

#if defined(RCC_HASH2CFGR_HASH2EN)
#define __HAL_RCC_HASH2_IS_CLK_ENABLED()          (READ_BIT(RCC->HASH2CFGR, RCC_HASHCFGR_HASHEN) != 0U)
#endif /* RCC_HASH2CFGR_HASH2EN */

#define __HAL_RCC_CRYP1_IS_CLK_ENABLED()          (READ_BIT(RCC->CRYP1CFGR, RCC_CRYP1CFGR_CRYP1EN) != 0U)
#define __HAL_RCC_CRYP2_IS_CLK_ENABLED()          (READ_BIT(RCC->CRYP2CFGR, RCC_CRYP2CFGR_CRYP2EN) != 0U)
#define __HAL_RCC_IWDG1_IS_CLK_ENABLED()          (READ_BIT(RCC->IWDG1CFGR, RCC_IWDG1CFGR_IWDG1EN) != 0U)
#define __HAL_RCC_IWDG2_IS_CLK_ENABLED()          (READ_BIT(RCC->IWDG2CFGR, RCC_IWDG2CFGR_IWDG2EN) != 0U)
#define __HAL_RCC_IWDG3_IS_CLK_ENABLED()          (READ_BIT(RCC->IWDG3CFGR, RCC_IWDG3CFGR_IWDG3EN) != 0U)
#define __HAL_RCC_IWDG4_IS_CLK_ENABLED()          (READ_BIT(RCC->IWDG4CFGR, RCC_IWDG4CFGR_IWDG4EN) != 0U)

