zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rcc.h
#if defined(RCC_IWDG5CFGR_IWDG5EN)
#define __HAL_RCC_IWDG5_IS_CLK_ENABLED()          (READ_BIT(RCC->IWDG5CFGR, RCC_IWDG5CFGR_IWDG5EN) != 0U)
#endif /* RCC_IWDG5CFGR_IWDG5EN */

#define __HAL_RCC_WWDG1_IS_CLK_ENABLED()          (READ_BIT(RCC->WWDG1CFGR, RCC_WWDG1CFGR_WWDG1EN) != 0U)

#if defined(RCC_WWDG2CFGR_WWDG2EN)
#define __HAL_RCC_WWDG2_IS_CLK_ENABLED()          (READ_BIT(RCC->WWDG2CFGR, RCC_WWDG2CFGR_WWDG2EN) != 0U)
#endif /* RCC_WWDG2CFGR_WWDG2EN */

#define __HAL_RCC_BUSPERFM_IS_CLK_ENABLED()       (READ_BIT(RCC->BUSPERFMCFGR, RCC_BUSPERFMCFGR_BUSPERFM) != 0U)
#define __HAL_RCC_VREF_IS_CLK_ENABLED()           (READ_BIT(RCC->VREFCFGR, RCC_VREFCFGR_VREFEN) != 0U)
#define __HAL_RCC_TMPSENS_IS_CLK_ENABLED()        (READ_BIT(RCC->TMPSENSCFGR, RCC_TMPSENSCFGR_TMPSENSEN) != 0U)
#define __HAL_RCC_CRC_IS_CLK_ENABLED()            (READ_BIT(RCC->CRCCFGR, RCC_CRCCFGR_CRCEN) != 0U)
#define __HAL_RCC_BSEC_IS_CLK_ENABLED()           (READ_BIT(RCC->BSECCFGR, RCC_BSECCFGR_BSECEN) != 0U)
#define __HAL_RCC_GICV2_IS_CLK_ENABLED()          (READ_BIT(RCC->GICV2CFGR, RCC_GICV2CFGR_GICV2EN) != 0U)
#define __HAL_RCC_I3C1_IS_CLK_ENABLED()           (READ_BIT(RCC->I3C1CFGR, RCC_I3C1CFGR_I3C1EN) != 0U)
#define __HAL_RCC_I3C2_IS_CLK_ENABLED()           (READ_BIT(RCC->I3C2CFGR, RCC_I3C2CFGR_I3C2EN) != 0U)
#define __HAL_RCC_I3C3_IS_CLK_ENABLED()           (READ_BIT(RCC->I3C3CFGR, RCC_I3C3CFGR_I3C3EN) != 0U)

#if defined(RCC_I3C4CFGR_I3C4EN)
#define __HAL_RCC_I3C4_IS_CLK_ENABLED()           (READ_BIT(RCC->I3C4CFGR, RCC_I3C4CFGR_I3C4EN) != 0U)
#endif /* RCC_I3C4CFGR_I3C4EN */

/* for API backward compatibility */
#if defined(RCC_DCMIPSSICFGR_DCMIPSSIEN)
#define __HAL_RCC_DCMI_IS_CLK_ENABLED()           __HAL_RCC_DCMIPSSI_IS_CLK_ENABLED()
#define __HAL_RCC_PSSI_IS_CLK_ENABLED()           __HAL_RCC_DCMIPSSI_IS_CLK_ENABLED()
#endif /* RCC_DCMIPSSICFGR_DCMIPSSIEN */

#if defined(RCC_CCICFGR_CCIEN)
#define __HAL_RCC_DCMI_IS_CLK_ENABLED()           __HAL_RCC_CCI_IS_CLK_ENABLED()
#define __HAL_RCC_PSSI_IS_CLK_ENABLED()           __HAL_RCC_CCI_IS_CLK_ENABLED()
#endif /* RCC_CCICFGR_CCIEN */

#define __HAL_RCC_OTFDEC1_IS_CLK_ENABLED()        __HAL_RCC_OSPI1_IS_CLK_ENABLED()

#if defined(RCC_OSPI2CFGR_OSPI2EN)
#define __HAL_RCC_OTFDEC2_IS_CLK_ENABLED()        __HAL_RCC_OSPI2_IS_CLK_ENABLED()
#endif /* RCC_OSPI2CFGR_OSPI2EN */

/* Reset force macros */

#define __HAL_RCC_SERC_FORCE_RESET()              SET_BIT(RCC->SERCCFGR, RCC_SERCCFGR_SERCRST)
#define __HAL_RCC_OSPIIOM_FORCE_RESET()           SET_BIT(RCC->OSPIIOMCFGR, RCC_OSPIIOMCFGR_OSPIIOMRST)
#define __HAL_RCC_ETHSW_FORCE_RESET()             SET_BIT(RCC->ETHSWCFGR, RCC_ETHSWCFGR_ETHSWRST)
#define __HAL_RCC_VDEC_FORCE_RESET()              SET_BIT(RCC->VDECCFGR, RCC_VDECCFGR_VDECRST)

#if defined(RCC_VENCCFGR_VENCRST)
#define __HAL_RCC_VENC_FORCE_RESET()              SET_BIT(RCC->VENCCFGR, RCC_VENCCFGR_VENCRST)
#endif /* RCC_VENCCFGR_VENCRST */

#if defined(RCC_C3CFGR_C3RST)
#define __HAL_RCC_C3_FORCE_RESET()                SET_BIT(RCC->C3CFGR, RCC_C3CFGR_C3RST)
#endif /* RCC_C3CFGR_C3RST */

#define __HAL_RCC_OSPI1_FORCE_RESET()             SET_BIT(RCC->OSPI1CFGR, RCC_OSPI1CFGR_OSPI1RST)

#if defined(RCC_OSPI2CFGR_OSPI2RST)
#define __HAL_RCC_OSPI2_FORCE_RESET()             SET_BIT(RCC->OSPI2CFGR, RCC_OSPI2CFGR_OSPI2RST)
#endif /* RCC_OSPI2CFGR_OSPI2RST */

#define __HAL_RCC_OTFDEC1_FORCE_RESET()           SET_BIT(RCC->OSPI1CFGR, RCC_OSPI1CFGR_OTFDEC1RST)

#if defined(RCC_OSPI2CFGR_OSPI2RST)
#define __HAL_RCC_OTFDEC2_FORCE_RESET()           SET_BIT(RCC->OSPI2CFGR, RCC_OSPI2CFGR_OTFDEC2RST)
#endif /* RCC_OSPI2CFGR_OSPI2RST */

#define __HAL_RCC_GPIOA_FORCE_RESET()             SET_BIT(RCC->GPIOACFGR, RCC_GPIOACFGR_GPIOxRST)
#define __HAL_RCC_GPIOB_FORCE_RESET()             SET_BIT(RCC->GPIOBCFGR, RCC_GPIOBCFGR_GPIOxRST)
#define __HAL_RCC_GPIOC_FORCE_RESET()             SET_BIT(RCC->GPIOCCFGR, RCC_GPIOCCFGR_GPIOxRST)
#define __HAL_RCC_GPIOD_FORCE_RESET()             SET_BIT(RCC->GPIODCFGR, RCC_GPIODCFGR_GPIOxRST)
#define __HAL_RCC_GPIOE_FORCE_RESET()             SET_BIT(RCC->GPIOECFGR, RCC_GPIOECFGR_GPIOxRST)
#define __HAL_RCC_GPIOF_FORCE_RESET()             SET_BIT(RCC->GPIOFCFGR, RCC_GPIOFCFGR_GPIOxRST)
#define __HAL_RCC_GPIOG_FORCE_RESET()             SET_BIT(RCC->GPIOGCFGR, RCC_GPIOGCFGR_GPIOxRST)
#define __HAL_RCC_GPIOH_FORCE_RESET()             SET_BIT(RCC->GPIOHCFGR, RCC_GPIOHCFGR_GPIOxRST)
#define __HAL_RCC_GPIOI_FORCE_RESET()             SET_BIT(RCC->GPIOICFGR, RCC_GPIOICFGR_GPIOxRST)

#if defined(RCC_GPIOJCFGR_GPIOxRST)
#define __HAL_RCC_GPIOJ_FORCE_RESET()             SET_BIT(RCC->GPIOJCFGR, RCC_GPIOJCFGR_GPIOxRST)
#endif /* RCC_GPIOJCFGR_GPIOxRST */

#if defined(RCC_GPIOKCFGR_GPIOxRST)
#define __HAL_RCC_GPIOK_FORCE_RESET()             SET_BIT(RCC->GPIOKCFGR, RCC_GPIOKCFGR_GPIOxRST)
#endif /* RCC_GPIOKCFGR_GPIOxRST */

#define __HAL_RCC_GPIOZ_FORCE_RESET()             SET_BIT(RCC->GPIOZCFGR, RCC_GPIOZCFGR_GPIOZRST)
#define __HAL_RCC_HPDMA1_FORCE_RESET()            SET_BIT(RCC->HPDMA1CFGR, RCC_HPDMA1CFGR_HPDMA1RST)
#define __HAL_RCC_HPDMA2_FORCE_RESET()            SET_BIT(RCC->HPDMA2CFGR, RCC_HPDMA2CFGR_HPDMA2RST)
#define __HAL_RCC_HPDMA3_FORCE_RESET()            SET_BIT(RCC->HPDMA3CFGR, RCC_HPDMA3CFGR_HPDMA3RST)

#if defined(RCC_LPDMACFGR_LPDMARST)
#define __HAL_RCC_LPDMA_FORCE_RESET()             SET_BIT(RCC->LPDMACFGR, RCC_LPDMACFGR_LPDMARST)
#endif /* RCC_LPDMACFGR_LPDMARST */

#if defined(RCC_HSEMCFGR_HSEMRST)
#define __HAL_RCC_HSEM_FORCE_RESET()              SET_BIT(RCC->HSEMCFGR, RCC_HSEMCFGR_HSEMRST)
#endif /* RCC_HSEMCFGR_HSEMRST */

#define __HAL_RCC_IPCC1_FORCE_RESET()             SET_BIT(RCC->IPCC1CFGR, RCC_IPCC1CFGR_IPCC1RST)

#if defined(RCC_IPCC2CFGR_IPCC2RST)
#define __HAL_RCC_IPCC2_FORCE_RESET()             SET_BIT(RCC->IPCC2CFGR, RCC_IPCC2CFGR_IPCC2RST)
#endif /* RCC_IPCC2CFGR_IPCC2RST */

#define __HAL_RCC_IS2M_FORCE_RESET()              SET_BIT(RCC->IS2MCFGR, RCC_IS2MCFGR_IS2MRST)
#define __HAL_RCC_TIM1_FORCE_RESET()              SET_BIT(RCC->TIM1CFGR, RCC_TIM1CFGR_TIM1RST)
#define __HAL_RCC_TIM2_FORCE_RESET()              SET_BIT(RCC->TIM2CFGR, RCC_TIM2CFGR_TIM2RST)
#define __HAL_RCC_TIM3_FORCE_RESET()              SET_BIT(RCC->TIM3CFGR, RCC_TIM3CFGR_TIM3RST)
#define __HAL_RCC_TIM4_FORCE_RESET()              SET_BIT(RCC->TIM4CFGR, RCC_TIM4CFGR_TIM4RST)
#define __HAL_RCC_TIM5_FORCE_RESET()              SET_BIT(RCC->TIM5CFGR, RCC_TIM5CFGR_TIM5RST)
#define __HAL_RCC_TIM6_FORCE_RESET()              SET_BIT(RCC->TIM6CFGR, RCC_TIM6CFGR_TIM6RST)
#define __HAL_RCC_TIM7_FORCE_RESET()              SET_BIT(RCC->TIM7CFGR, RCC_TIM7CFGR_TIM7RST)
#define __HAL_RCC_TIM8_FORCE_RESET()              SET_BIT(RCC->TIM8CFGR, RCC_TIM8CFGR_TIM8RST)
#define __HAL_RCC_TIM10_FORCE_RESET()             SET_BIT(RCC->TIM10CFGR, RCC_TIM10CFGR_TIM10RST)
#define __HAL_RCC_TIM11_FORCE_RESET()             SET_BIT(RCC->TIM11CFGR, RCC_TIM11CFGR_TIM11RST)
#define __HAL_RCC_TIM12_FORCE_RESET()             SET_BIT(RCC->TIM12CFGR, RCC_TIM12CFGR_TIM12RST)
#define __HAL_RCC_TIM13_FORCE_RESET()             SET_BIT(RCC->TIM13CFGR, RCC_TIM13CFGR_TIM13RST)
#define __HAL_RCC_TIM14_FORCE_RESET()             SET_BIT(RCC->TIM14CFGR, RCC_TIM14CFGR_TIM14RST)
#define __HAL_RCC_TIM15_FORCE_RESET()             SET_BIT(RCC->TIM15CFGR, RCC_TIM15CFGR_TIM15RST)
#define __HAL_RCC_TIM16_FORCE_RESET()             SET_BIT(RCC->TIM16CFGR, RCC_TIM16CFGR_TIM16RST)
#define __HAL_RCC_TIM17_FORCE_RESET()             SET_BIT(RCC->TIM17CFGR, RCC_TIM17CFGR_TIM17RST)

#if defined(RCC_TIM20CFGR_TIM20RST)
#define __HAL_RCC_TIM20_FORCE_RESET()             SET_BIT(RCC->TIM20CFGR, RCC_TIM20CFGR_TIM20RST)
#endif /* RCC_TIM20CFGR_TIM20RST */

#define __HAL_RCC_LPTIM1_FORCE_RESET()            SET_BIT(RCC->LPTIM1CFGR, RCC_LPTIM1CFGR_LPTIM1RST)
#define __HAL_RCC_LPTIM2_FORCE_RESET()            SET_BIT(RCC->LPTIM2CFGR, RCC_LPTIM2CFGR_LPTIM2RST)
#define __HAL_RCC_LPTIM3_FORCE_RESET()            SET_BIT(RCC->LPTIM3CFGR, RCC_LPTIM3CFGR_LPTIM3RST)
#define __HAL_RCC_LPTIM4_FORCE_RESET()            SET_BIT(RCC->LPTIM4CFGR, RCC_LPTIM4CFGR_LPTIM4RST)
#define __HAL_RCC_LPTIM5_FORCE_RESET()            SET_BIT(RCC->LPTIM5CFGR, RCC_LPTIM5CFGR_LPTIM5RST)
#define __HAL_RCC_SPI1_FORCE_RESET()              SET_BIT(RCC->SPI1CFGR, RCC_SPI1CFGR_SPI1RST)
#define __HAL_RCC_SPI2_FORCE_RESET()              SET_BIT(RCC->SPI2CFGR, RCC_SPI2CFGR_SPI2RST)
#define __HAL_RCC_SPI3_FORCE_RESET()              SET_BIT(RCC->SPI3CFGR, RCC_SPI3CFGR_SPI3RST)
#define __HAL_RCC_SPI4_FORCE_RESET()              SET_BIT(RCC->SPI4CFGR, RCC_SPI4CFGR_SPI4RST)
#define __HAL_RCC_SPI5_FORCE_RESET()              SET_BIT(RCC->SPI5CFGR, RCC_SPI5CFGR_SPI5RST)
#define __HAL_RCC_SPI6_FORCE_RESET()              SET_BIT(RCC->SPI6CFGR, RCC_SPI6CFGR_SPI6RST)

#if defined(RCC_SPI7CFGR_SPI7RST)
#define __HAL_RCC_SPI7_FORCE_RESET()              SET_BIT(RCC->SPI7CFGR, RCC_SPI7CFGR_SPI7RST)
#endif /* RCC_SPI7CFGR_SPI7RST */

