zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rcc.h
#if defined(RCC_SPI8CFGR_SPI8RST)
#define __HAL_RCC_SPI8_FORCE_RESET()              SET_BIT(RCC->SPI8CFGR, RCC_SPI8CFGR_SPI8RST)
#endif /* RCC_SPI8CFGR_SPI8RST */

#define __HAL_RCC_SPDIFRX_FORCE_RESET()           SET_BIT(RCC->SPDIFRXCFGR, RCC_SPDIFRXCFGR_SPDIFRXRST)
#define __HAL_RCC_USART1_FORCE_RESET()            SET_BIT(RCC->USART1CFGR, RCC_USART1CFGR_USART1RST)
#define __HAL_RCC_USART2_FORCE_RESET()            SET_BIT(RCC->USART2CFGR, RCC_USART2CFGR_USART2RST)
#define __HAL_RCC_USART3_FORCE_RESET()            SET_BIT(RCC->USART3CFGR, RCC_USART3CFGR_USART3RST)
#define __HAL_RCC_UART4_FORCE_RESET()             SET_BIT(RCC->UART4CFGR, RCC_UART4CFGR_UART4RST)
#define __HAL_RCC_UART5_FORCE_RESET()             SET_BIT(RCC->UART5CFGR, RCC_UART5CFGR_UART5RST)
#define __HAL_RCC_USART6_FORCE_RESET()            SET_BIT(RCC->USART6CFGR, RCC_USART6CFGR_USART6RST)
#define __HAL_RCC_UART7_FORCE_RESET()             SET_BIT(RCC->UART7CFGR, RCC_UART7CFGR_UART7RST)

#if defined(RCC_UART8CFGR_UART8RST)
#define __HAL_RCC_UART8_FORCE_RESET()             SET_BIT(RCC->UART8CFGR, RCC_UART8CFGR_UART8RST)
#endif /* RCC_UART8CFGR_UART8RST */

#if defined(RCC_UART9CFGR_UART9RST)
#define __HAL_RCC_UART9_FORCE_RESET()             SET_BIT(RCC->UART9CFGR, RCC_UART9CFGR_UART9RST)
#endif /* RCC_UART9CFGR_UART9RST */

#define __HAL_RCC_LPUART1_FORCE_RESET()           SET_BIT(RCC->LPUART1CFGR, RCC_LPUART1CFGR_LPUART1RST)
#define __HAL_RCC_I2C1_FORCE_RESET()              SET_BIT(RCC->I2C1CFGR, RCC_I2C1CFGR_I2C1RST)
#define __HAL_RCC_I2C2_FORCE_RESET()              SET_BIT(RCC->I2C2CFGR, RCC_I2C2CFGR_I2C2RST)
#define __HAL_RCC_I2C3_FORCE_RESET()              SET_BIT(RCC->I2C3CFGR, RCC_I2C3CFGR_I2C3RST)

#if defined(RCC_I2C4CFGR_I2C4RST)
#define __HAL_RCC_I2C4_FORCE_RESET()              SET_BIT(RCC->I2C4CFGR, RCC_I2C4CFGR_I2C4RST)
#endif /* RCC_I2C4CFGR_I2C4RST */

#if defined(RCC_I2C5CFGR_I2C5RST)
#define __HAL_RCC_I2C5_FORCE_RESET()              SET_BIT(RCC->I2C5CFGR, RCC_I2C5CFGR_I2C5RST)
#endif /* RCC_I2C5CFGR_I2C5RST */

#if defined(RCC_I2C6CFGR_I2C6RST)
#define __HAL_RCC_I2C6_FORCE_RESET()              SET_BIT(RCC->I2C6CFGR, RCC_I2C6CFGR_I2C6RST)
#endif /* RCC_I2C6CFGR_I2C6RST */

#if defined(RCC_I2C7CFGR_I2C7RST)
#define __HAL_RCC_I2C7_FORCE_RESET()              SET_BIT(RCC->I2C7CFGR, RCC_I2C7CFGR_I2C7RST)
#endif /* RCC_I2C7CFGR_I2C7RST */

#if defined(RCC_I2C8CFGR_I2C8RST)
#define __HAL_RCC_I2C8_FORCE_RESET()              SET_BIT(RCC->I2C8CFGR, RCC_I2C8CFGR_I2C8RST)
#endif /* RCC_I2C8CFGR_I2C8RST */

#define __HAL_RCC_SAI1_FORCE_RESET()              SET_BIT(RCC->SAI1CFGR, RCC_SAI1CFGR_SAI1RST)
#define __HAL_RCC_SAI2_FORCE_RESET()              SET_BIT(RCC->SAI2CFGR, RCC_SAI2CFGR_SAI2RST)
#define __HAL_RCC_SAI3_FORCE_RESET()              SET_BIT(RCC->SAI3CFGR, RCC_SAI3CFGR_SAI3RST)
#define __HAL_RCC_SAI4_FORCE_RESET()              SET_BIT(RCC->SAI4CFGR, RCC_SAI4CFGR_SAI4RST)
#define __HAL_RCC_MDF1_FORCE_RESET()              SET_BIT(RCC->MDF1CFGR, RCC_MDF1CFGR_MDF1RST)
#define __HAL_RCC_ADF1_FORCE_RESET()              SET_BIT(RCC->ADF1CFGR, RCC_ADF1CFGR_ADF1RST)
#define __HAL_RCC_FDCAN_FORCE_RESET()             SET_BIT(RCC->FDCANCFGR, RCC_FDCANCFGR_FDCANRST)
#define __HAL_RCC_HDP_FORCE_RESET()               SET_BIT(RCC->HDPCFGR, RCC_HDPCFGR_HDPRST)

#if defined(RCC_ADC1CFGR_ADC1RST)
#define __HAL_RCC_ADC1_FORCE_RESET()              SET_BIT(RCC->ADC1CFGR, RCC_ADC1CFGR_ADC1RST)
#endif /* RCC_ADC1CFGR_ADC1RST */

#if defined(RCC_ADC2CFGR_ADC2RST)
#define __HAL_RCC_ADC2_FORCE_RESET()              SET_BIT(RCC->ADC2CFGR, RCC_ADC2CFGR_ADC2RST)
#endif /* RCC_ADC2CFGR_ADC2RST */

#if defined(RCC_ADC12CFGR_ADC12RST)
#define __HAL_RCC_ADC12_FORCE_RESET()             SET_BIT(RCC->ADC12CFGR, RCC_ADC12CFGR_ADC12RST)
#endif /* RCC_ADC12CFGR_ADC12RST */

#if defined(RCC_ADC3CFGR_ADC3RST)
#define __HAL_RCC_ADC3_FORCE_RESET()              SET_BIT(RCC->ADC3CFGR, RCC_ADC3CFGR_ADC3RST)
#endif /*RCC_ADC3CFGR_ADC3RST*/

#define __HAL_RCC_ETH1_FORCE_RESET()              SET_BIT(RCC->ETH1CFGR, RCC_ETH1CFGR_ETH1RST)
#define __HAL_RCC_ETH2_FORCE_RESET()              SET_BIT(RCC->ETH2CFGR, RCC_ETH2CFGR_ETH2RST)
#define __HAL_RCC_USBH_FORCE_RESET()              SET_BIT(RCC->USBHCFGR, RCC_USBHCFGR_USBHRST)
#define __HAL_RCC_USB2PHY1_FORCE_RESET()          SET_BIT(RCC->USB2PHY1CFGR, RCC_USB2PHY1CFGR_USB2PHY1RST)
#define __HAL_RCC_USB2PHY2_FORCE_RESET()          SET_BIT(RCC->USB2PHY2CFGR, RCC_USB2PHY2CFGR_USB2PHY2RST)
#define __HAL_RCC_USB3DRD_FORCE_RESET()           SET_BIT(RCC->USB3DRDCFGR, RCC_USB3DRDCFGR_USB3DRDRST)
#define __HAL_RCC_OTG_FORCE_RESET()               SET_BIT(RCC->OTGCFGR, RCC_OTGCFGR_OTGRST)
#define __HAL_RCC_USB3PCIEPHY_FORCE_RESET()       SET_BIT(RCC->USB3PCIEPHYCFGR, RCC_USB3PCIEPHYCFGR_USB3PCIEPHYRST)
#define __HAL_RCC_PCIE_FORCE_RESET()              SET_BIT(RCC->PCIECFGR, RCC_PCIECFGR_PCIERST)
#define __HAL_RCC_UCPD1_FORCE_RESET()             SET_BIT(RCC->UCPDCFGR, RCC_UCPDCFGR_UCPDRST)
#define __HAL_RCC_FMC_FORCE_RESET()               SET_BIT(RCC->FMCCFGR, RCC_FMCCFGR_FMCRST)
#define __HAL_RCC_SDMMC1_FORCE_RESET()            SET_BIT(RCC->SDMMC1CFGR, RCC_SDMMC1CFGR_SDMMC1RST)
#define __HAL_RCC_SDMMC2_FORCE_RESET()            SET_BIT(RCC->SDMMC2CFGR, RCC_SDMMC2CFGR_SDMMC2RST)
#define __HAL_RCC_SDMMC3_FORCE_RESET()            SET_BIT(RCC->SDMMC3CFGR, RCC_SDMMC3CFGR_SDMMC3RST)
#define __HAL_RCC_GPU_FORCE_RESET()               SET_BIT(RCC->GPUCFGR, RCC_GPUCFGR_GPURST)
#define __HAL_RCC_LTDC_FORCE_RESET()              SET_BIT(RCC->LTDCCFGR, RCC_LTDCCFGR_LTDCRST)

#if defined(RCC_DSICFGR_DSIRST)
#define __HAL_RCC_DSI_FORCE_RESET()               SET_BIT(RCC->DSICFGR, RCC_DSICFGR_DSIRST)
#endif /* RCC_DSICFGR_DSIRST */

#define __HAL_RCC_LVDS_FORCE_RESET()              SET_BIT(RCC->LVDSCFGR, RCC_LVDSCFGR_LVDSRST)

#if defined(RCC_CSICFGR_CSIRST)
#define __HAL_RCC_CSI_FORCE_RESET()               SET_BIT(RCC->CSICFGR, RCC_CSICFGR_CSIRST)
#endif /* RCC_CSICFGR_CSIRST */

#if defined(RCC_CSI2CFGR_CSI2RST)
#define __HAL_RCC_CSI2_FORCE_RESET()              SET_BIT(RCC->CSI2CFGR, RCC_CSI2CFGR_CSI2RST)
#endif /* RCC_CSI2CFGR_CSI2RST */

#define __HAL_RCC_DCMIPP_FORCE_RESET()            SET_BIT(RCC->DCMIPPCFGR, RCC_DCMIPPCFGR_DCMIPPRST)

#if defined(RCC_DCMIPSSICFGR_DCMIPSSIRST)
#define __HAL_RCC_DCMIPSSI_FORCE_RESET()          SET_BIT(RCC->DCMIPSSICFGR, RCC_DCMIPSSICFGR_DCMIPSSIRST)
#endif /* RCC_DCMIPSSICFGR_DCMIPSSIRST */

#if defined(RCC_CCICFGR_CCIRST)
#define __HAL_RCC_CCI_FORCE_RESET()               SET_BIT(RCC->CCICFGR, RCC_CCICFGR_CCIRST)
#endif /* RCC_CCICFGR_CCIRST */

#if defined(RCC_RNGCFGR_RNGRST)
#define __HAL_RCC_RNG_FORCE_RESET()               SET_BIT(RCC->RNGCFGR, RCC_RNGCFGR_RNGRST)
#endif /* RCC_RNGCFGR_RNGRST */

#if defined(RCC_RNG1CFGR_RNG1RST)
#define __HAL_RCC_RNG1_FORCE_RESET()              SET_BIT(RCC->RNG1CFGR, RCC_RNG1CFGR_RNG1RST)
#endif /* RCC_RNG1CFGR_RNG1RST */

