zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rcc.h
#if defined(RCC_RNG2CFGR_RNG2RST)
#define __HAL_RCC_RNG2_FORCE_RESET()              SET_BIT(RCC->RNG2CFGR, RCC_RNG2CFGR_RNG2RST)
#endif /* RCC_RNG2CFGR_RNG2RST */

#define __HAL_RCC_PKA_FORCE_RESET()               SET_BIT(RCC->PKACFGR, RCC_PKACFGR_PKARST)
#define __HAL_RCC_SAES_FORCE_RESET()              SET_BIT(RCC->SAESCFGR, RCC_SAESCFGR_SAESRST)

#if defined(RCC_HASH1CFGR_HASH1RST)
#define __HAL_RCC_HASH1_FORCE_RESET()             SET_BIT(RCC->HASH1CFGR, RCC_HASH1CFGR_HASH1RST)
#endif /* RCC_HASH1CFGR_HASH1RST */

#if defined(RCC_HASH2CFGR_HASH2RST)
#define __HAL_RCC_HASH2_FORCE_RESET()             SET_BIT(RCC->HASH2CFGR, RCC_HASH2CFGR_HASH2RST)
#endif /* RCC_HASH2CFGR_HASH2RST */

#if defined(RCC_HASHCFGR_HASHRST)
#define __HAL_RCC_HASH_FORCE_RESET()              SET_BIT(RCC->HASHCFGR, RCC_HASHCFGR_HASHRST)
#endif /* RCC_HASHCFGR_HASHRST */

#define __HAL_RCC_CRYP1_FORCE_RESET()             SET_BIT(RCC->CRYP1CFGR, RCC_CRYP1CFGR_CRYP1RST)
#define __HAL_RCC_CRYP2_FORCE_RESET()             SET_BIT(RCC->CRYP2CFGR, RCC_CRYP2CFGR_CRYP2RST)
#define __HAL_RCC_WWDG1_FORCE_RESET()             SET_BIT(RCC->WWDG1CFGR, RCC_WWDG1CFGR_WWDG1RST)
#define __HAL_RCC_WWDG2_FORCE_RESET()             SET_BIT(RCC->WWDG2CFGR, RCC_WWDG2CFGR_WWDG2RST)
#define __HAL_RCC_BUSPERFM_FORCE_RESET()          SET_BIT(RCC->BUSPERFMCFGR, RCC_BUSPERFMCFGR_BUSPERFMRST)
#define __HAL_RCC_VREF_FORCE_RESET()              SET_BIT(RCC->VREFCFGR, RCC_VREFCFGR_VREFRST)
#define __HAL_RCC_TMPSENS_FORCE_RESET()           SET_BIT(RCC->TMPSENSCFGR, RCC_TMPSENSCFGR_TMPSENSRST)
#define __HAL_RCC_CRC_FORCE_RESET()               SET_BIT(RCC->CRCCFGR, RCC_CRCCFGR_CRCRST)
#define __HAL_RCC_I3C1_FORCE_RESET()              SET_BIT(RCC->I3C1CFGR, RCC_I3C1CFGR_I3C1RST)
#define __HAL_RCC_I3C2_FORCE_RESET()              SET_BIT(RCC->I3C2CFGR, RCC_I3C2CFGR_I3C2RST)
#define __HAL_RCC_I3C3_FORCE_RESET()              SET_BIT(RCC->I3C3CFGR, RCC_I3C3CFGR_I3C3RST)

#if defined(RCC_I3C4CFGR_I3C4RST)
#define __HAL_RCC_I3C4_FORCE_RESET()              SET_BIT(RCC->I3C4CFGR, RCC_I3C4CFGR_I3C4RST)
#endif /* RCC_I3C4CFGR_I3C4RST */

/* for API backward compatibility */
#if defined(RCC_DCMIPSSICFGR_DCMIPSSIRST)
#define __HAL_RCC_DCMI_FORCE_RESET()              __HAL_RCC_DCMIPSSI_FORCE_RESET()
#define __HAL_RCC_PSSI_FORCE_RESET()              __HAL_RCC_DCMIPSSI_FORCE_RESET()
#endif /* RCC_DCMIPSSICFGR_DCMIPSSIRST */

#if defined(RCC_CCICFGR_CSIRST)
#define __HAL_RCC_DCMI_FORCE_RESET()              __HAL_RCC_CCI_FORCE_RESET()
#define __HAL_RCC_PSSI_FORCE_RESET()              __HAL_RCC_CCI_FORCE_RESET()
#endif /* RCC_CCICFGR_CSIRST */

/* Reset release macros */
#define __HAL_RCC_SERC_RELEASE_RESET()            CLEAR_BIT(RCC->SERCCFGR, RCC_SERCCFGR_SERCRST)
#define __HAL_RCC_OSPIIOM_RELEASE_RESET()         CLEAR_BIT(RCC->OSPIIOMCFGR, RCC_OSPIIOMCFGR_OSPIIOMRST)
#define __HAL_RCC_ETHSW_RELEASE_RESET()           CLEAR_BIT(RCC->ETHSWCFGR, RCC_ETHSWCFGR_ETHSWRST)
#define __HAL_RCC_VDEC_RELEASE_RESET()            CLEAR_BIT(RCC->VDECCFGR, RCC_VDECCFGR_VDECRST)

#if defined(RCC_VENCCFGR_VENCRST)
#define __HAL_RCC_VENC_RELEASE_RESET()            CLEAR_BIT(RCC->VENCCFGR, RCC_VENCCFGR_VENCRST)
#endif /* RCC_VENCCFGR_VENCRST */

#if defined(RCC_C3CFGR_C3RST)
#define __HAL_RCC_C3_RELEASE_RESET()              CLEAR_BIT(RCC->C3CFGR, RCC_C3CFGR_C3RST)
#endif /* RCC_C3CFGR_C3RST */

#define __HAL_RCC_OSPI1_RELEASE_RESET()           CLEAR_BIT(RCC->OSPI1CFGR, RCC_OSPI1CFGR_OSPI1RST)

#if defined(RCC_OSPI2CFGR_OSPI2RST)
#define __HAL_RCC_OSPI2_RELEASE_RESET()           CLEAR_BIT(RCC->OSPI2CFGR, RCC_OSPI2CFGR_OSPI2RST)
#endif /* RCC_OSPI2CFGR_OSPI2RST */

#define __HAL_RCC_OTFDEC1_RELEASE_RESET()         CLEAR_BIT(RCC->OSPI1CFGR, RCC_OSPI1CFGR_OTFDEC1RST)

#if defined(RCC_OSPI2CFGR_OSPI2RST)
#define __HAL_RCC_OTFDEC2_RELEASE_RESET()         CLEAR_BIT(RCC->OSPI2CFGR, RCC_OSPI2CFGR_OTFDEC2RST)
#endif /* RCC_OSPI2CFGR_OSPI2RST */

#define __HAL_RCC_GPIOA_RELEASE_RESET()           CLEAR_BIT(RCC->GPIOACFGR, RCC_GPIOACFGR_GPIOxRST)
#define __HAL_RCC_GPIOB_RELEASE_RESET()           CLEAR_BIT(RCC->GPIOBCFGR, RCC_GPIOBCFGR_GPIOxRST)
#define __HAL_RCC_GPIOC_RELEASE_RESET()           CLEAR_BIT(RCC->GPIOCCFGR, RCC_GPIOCCFGR_GPIOxRST)
#define __HAL_RCC_GPIOD_RELEASE_RESET()           CLEAR_BIT(RCC->GPIODCFGR, RCC_GPIODCFGR_GPIOxRST)
#define __HAL_RCC_GPIOE_RELEASE_RESET()           CLEAR_BIT(RCC->GPIOECFGR, RCC_GPIOECFGR_GPIOxRST)
#define __HAL_RCC_GPIOF_RELEASE_RESET()           CLEAR_BIT(RCC->GPIOFCFGR, RCC_GPIOFCFGR_GPIOxRST)
#define __HAL_RCC_GPIOG_RELEASE_RESET()           CLEAR_BIT(RCC->GPIOGCFGR, RCC_GPIOGCFGR_GPIOxRST)
#define __HAL_RCC_GPIOH_RELEASE_RESET()           CLEAR_BIT(RCC->GPIOHCFGR, RCC_GPIOHCFGR_GPIOxRST)
#define __HAL_RCC_GPIOI_RELEASE_RESET()           CLEAR_BIT(RCC->GPIOICFGR, RCC_GPIOICFGR_GPIOxRST)

#if defined(RCC_GPIOJCFGR_GPIOxRST)
#define __HAL_RCC_GPIOJ_RELEASE_RESET()           CLEAR_BIT(RCC->GPIOJCFGR, RCC_GPIOJCFGR_GPIOxRST)
#endif /* RCC_GPIOJCFGR_GPIOxRST */

#if defined(RCC_GPIOKCFGR_GPIOxRST)
#define __HAL_RCC_GPIOK_RELEASE_RESET()           CLEAR_BIT(RCC->GPIOKCFGR, RCC_GPIOKCFGR_GPIOxRST)
#endif /* RCC_GPIOKCFGR_GPIOxRST */

#define __HAL_RCC_GPIOZ_RELEASE_RESET()           CLEAR_BIT(RCC->GPIOZCFGR, RCC_GPIOZCFGR_GPIOZRST)
#define __HAL_RCC_HPDMA1_RELEASE_RESET()          CLEAR_BIT(RCC->HPDMA1CFGR, RCC_HPDMA1CFGR_HPDMA1RST)
#define __HAL_RCC_HPDMA2_RELEASE_RESET()          CLEAR_BIT(RCC->HPDMA2CFGR, RCC_HPDMA2CFGR_HPDMA2RST)
#define __HAL_RCC_HPDMA3_RELEASE_RESET()          CLEAR_BIT(RCC->HPDMA3CFGR, RCC_HPDMA3CFGR_HPDMA3RST)

#if defined(RCC_LPDMACFGR_LPDMARST)
#define __HAL_RCC_LPDMA_RELEASE_RESET()           CLEAR_BIT(RCC->LPDMACFGR, RCC_LPDMACFGR_LPDMARST)
#endif /* RCC_LPDMACFGR_LPDMARST */

#if defined(RCC_HSEMCFGR_HSEMRST)
#define __HAL_RCC_HSEM_RELEASE_RESET()            CLEAR_BIT(RCC->HSEMCFGR, RCC_HSEMCFGR_HSEMRST)
#endif /* RCC_HSEMCFGR_HSEMRST */

#define __HAL_RCC_IPCC1_RELEASE_RESET()           CLEAR_BIT(RCC->IPCC1CFGR, RCC_IPCC1CFGR_IPCC1RST)

#if defined(RCC_IPCC2CFGR_IPCC2RST)
#define __HAL_RCC_IPCC2_RELEASE_RESET()           CLEAR_BIT(RCC->IPCC2CFGR, RCC_IPCC2CFGR_IPCC2RST)
#endif /* RCC_IPCC2CFGR_IPCC2RST */

