zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rcc.h
#define __HAL_RCC_IS2M_RELEASE_RESET()            CLEAR_BIT(RCC->IS2MCFGR, RCC_IS2MCFGR_IS2MRST)
#define __HAL_RCC_TIM1_RELEASE_RESET()            CLEAR_BIT(RCC->TIM1CFGR, RCC_TIM1CFGR_TIM1RST)
#define __HAL_RCC_TIM2_RELEASE_RESET()            CLEAR_BIT(RCC->TIM2CFGR, RCC_TIM2CFGR_TIM2RST)
#define __HAL_RCC_TIM3_RELEASE_RESET()            CLEAR_BIT(RCC->TIM3CFGR, RCC_TIM3CFGR_TIM3RST)
#define __HAL_RCC_TIM4_RELEASE_RESET()            CLEAR_BIT(RCC->TIM4CFGR, RCC_TIM4CFGR_TIM4RST)
#define __HAL_RCC_TIM5_RELEASE_RESET()            CLEAR_BIT(RCC->TIM5CFGR, RCC_TIM5CFGR_TIM5RST)
#define __HAL_RCC_TIM6_RELEASE_RESET()            CLEAR_BIT(RCC->TIM6CFGR, RCC_TIM6CFGR_TIM6RST)
#define __HAL_RCC_TIM7_RELEASE_RESET()            CLEAR_BIT(RCC->TIM7CFGR, RCC_TIM7CFGR_TIM7RST)
#define __HAL_RCC_TIM8_RELEASE_RESET()            CLEAR_BIT(RCC->TIM8CFGR, RCC_TIM8CFGR_TIM8RST)
#define __HAL_RCC_TIM10_RELEASE_RESET()           CLEAR_BIT(RCC->TIM10CFGR, RCC_TIM10CFGR_TIM10RST)
#define __HAL_RCC_TIM11_RELEASE_RESET()           CLEAR_BIT(RCC->TIM11CFGR, RCC_TIM11CFGR_TIM11RST)
#define __HAL_RCC_TIM12_RELEASE_RESET()           CLEAR_BIT(RCC->TIM12CFGR, RCC_TIM12CFGR_TIM12RST)
#define __HAL_RCC_TIM13_RELEASE_RESET()           CLEAR_BIT(RCC->TIM13CFGR, RCC_TIM13CFGR_TIM13RST)
#define __HAL_RCC_TIM14_RELEASE_RESET()           CLEAR_BIT(RCC->TIM14CFGR, RCC_TIM14CFGR_TIM14RST)
#define __HAL_RCC_TIM15_RELEASE_RESET()           CLEAR_BIT(RCC->TIM15CFGR, RCC_TIM15CFGR_TIM15RST)
#define __HAL_RCC_TIM16_RELEASE_RESET()           CLEAR_BIT(RCC->TIM16CFGR, RCC_TIM16CFGR_TIM16RST)
#define __HAL_RCC_TIM17_RELEASE_RESET()           CLEAR_BIT(RCC->TIM17CFGR, RCC_TIM17CFGR_TIM17RST)

#if defined(RCC_TIM20CFGR_TIM20RST)
#define __HAL_RCC_TIM20_RELEASE_RESET()           CLEAR_BIT(RCC->TIM20CFGR, RCC_TIM20CFGR_TIM20RST)
#endif /* RCC_TIM20CFGR_TIM20RST */

#define __HAL_RCC_LPTIM1_RELEASE_RESET()          CLEAR_BIT(RCC->LPTIM1CFGR, RCC_LPTIM1CFGR_LPTIM1RST)
#define __HAL_RCC_LPTIM2_RELEASE_RESET()          CLEAR_BIT(RCC->LPTIM2CFGR, RCC_LPTIM2CFGR_LPTIM2RST)
#define __HAL_RCC_LPTIM3_RELEASE_RESET()          CLEAR_BIT(RCC->LPTIM3CFGR, RCC_LPTIM3CFGR_LPTIM3RST)
#define __HAL_RCC_LPTIM4_RELEASE_RESET()          CLEAR_BIT(RCC->LPTIM4CFGR, RCC_LPTIM4CFGR_LPTIM4RST)
#define __HAL_RCC_LPTIM5_RELEASE_RESET()          CLEAR_BIT(RCC->LPTIM5CFGR, RCC_LPTIM5CFGR_LPTIM5RST)
#define __HAL_RCC_SPI1_RELEASE_RESET()            CLEAR_BIT(RCC->SPI1CFGR, RCC_SPI1CFGR_SPI1RST)
#define __HAL_RCC_SPI2_RELEASE_RESET()            CLEAR_BIT(RCC->SPI2CFGR, RCC_SPI2CFGR_SPI2RST)
#define __HAL_RCC_SPI3_RELEASE_RESET()            CLEAR_BIT(RCC->SPI3CFGR, RCC_SPI3CFGR_SPI3RST)
#define __HAL_RCC_SPI4_RELEASE_RESET()            CLEAR_BIT(RCC->SPI4CFGR, RCC_SPI4CFGR_SPI4RST)
#define __HAL_RCC_SPI5_RELEASE_RESET()            CLEAR_BIT(RCC->SPI5CFGR, RCC_SPI5CFGR_SPI5RST)
#define __HAL_RCC_SPI6_RELEASE_RESET()            CLEAR_BIT(RCC->SPI6CFGR, RCC_SPI6CFGR_SPI6RST)

#if defined(RCC_SPI7CFGR_SPI7RST)
#define __HAL_RCC_SPI7_RELEASE_RESET()            CLEAR_BIT(RCC->SPI7CFGR, RCC_SPI7CFGR_SPI7RST)
#endif /* RCC_SPI7CFGR_SPI7RST */

#if defined(RCC_SPI8CFGR_SPI8RST)
#define __HAL_RCC_SPI8_RELEASE_RESET()            CLEAR_BIT(RCC->SPI8CFGR, RCC_SPI8CFGR_SPI8RST)
#endif /* RCC_SPI8CFGR_SPI8RST */

#define __HAL_RCC_SPDIFRX_RELEASE_RESET()         CLEAR_BIT(RCC->SPDIFRXCFGR, RCC_SPDIFRXCFGR_SPDIFRXRST)
#define __HAL_RCC_USART1_RELEASE_RESET()          CLEAR_BIT(RCC->USART1CFGR, RCC_USART1CFGR_USART1RST)
#define __HAL_RCC_USART2_RELEASE_RESET()          CLEAR_BIT(RCC->USART2CFGR, RCC_USART2CFGR_USART2RST)
#define __HAL_RCC_USART3_RELEASE_RESET()          CLEAR_BIT(RCC->USART3CFGR, RCC_USART3CFGR_USART3RST)
#define __HAL_RCC_UART4_RELEASE_RESET()           CLEAR_BIT(RCC->UART4CFGR, RCC_UART4CFGR_UART4RST)
#define __HAL_RCC_UART5_RELEASE_RESET()           CLEAR_BIT(RCC->UART5CFGR, RCC_UART5CFGR_UART5RST)
#define __HAL_RCC_USART6_RELEASE_RESET()          CLEAR_BIT(RCC->USART6CFGR, RCC_USART6CFGR_USART6RST)
#define __HAL_RCC_UART7_RELEASE_RESET()           CLEAR_BIT(RCC->UART7CFGR, RCC_UART7CFGR_UART7RST)

#if defined(RCC_UART8CFGR_UART8RST)
#define __HAL_RCC_UART8_RELEASE_RESET()           CLEAR_BIT(RCC->UART8CFGR, RCC_UART8CFGR_UART8RST)
#endif /* RCC_UART8CFGR_UART8RST */

#if defined(RCC_UART9CFGR_UART9RST)
#define __HAL_RCC_UART9_RELEASE_RESET()           CLEAR_BIT(RCC->UART9CFGR, RCC_UART9CFGR_UART9RST)
#endif /* RCC_UART9CFGR_UART9RST */

#define __HAL_RCC_LPUART1_RELEASE_RESET()         CLEAR_BIT(RCC->LPUART1CFGR, RCC_LPUART1CFGR_LPUART1RST)
#define __HAL_RCC_I2C1_RELEASE_RESET()            CLEAR_BIT(RCC->I2C1CFGR, RCC_I2C1CFGR_I2C1RST)
#define __HAL_RCC_I2C2_RELEASE_RESET()            CLEAR_BIT(RCC->I2C2CFGR, RCC_I2C2CFGR_I2C2RST)
#define __HAL_RCC_I2C3_RELEASE_RESET()            CLEAR_BIT(RCC->I2C3CFGR, RCC_I2C3CFGR_I2C3RST)

#if defined(RCC_I2C4CFGR_I2C4RST)
#define __HAL_RCC_I2C4_RELEASE_RESET()            CLEAR_BIT(RCC->I2C4CFGR, RCC_I2C4CFGR_I2C4RST)
#endif /* RCC_I2C4CFGR_I2C4RST */

#if defined(RCC_I2C5CFGR_I2C5RST)
#define __HAL_RCC_I2C5_RELEASE_RESET()            CLEAR_BIT(RCC->I2C5CFGR, RCC_I2C5CFGR_I2C5RST)
#endif /* RCC_I2C5CFGR_I2C5RST */

#if defined(RCC_I2C6CFGR_I2C6RST)
#define __HAL_RCC_I2C6_RELEASE_RESET()            CLEAR_BIT(RCC->I2C6CFGR, RCC_I2C6CFGR_I2C6RST)
#endif /* RCC_I2C6CFGR_I2C6RST */

#if defined(RCC_I2C7CFGR_I2C7RST)
#define __HAL_RCC_I2C7_RELEASE_RESET()            CLEAR_BIT(RCC->I2C7CFGR, RCC_I2C7CFGR_I2C7RST)
#endif /* RCC_I2C7CFGR_I2C7RST */

#if defined(RCC_I2C8CFGR_I2C8RST)
#define __HAL_RCC_I2C8_RELEASE_RESET()            CLEAR_BIT(RCC->I2C8CFGR, RCC_I2C8CFGR_I2C8RST)
#endif /* RCC_I2C8CFGR_I2C8RST */

#define __HAL_RCC_SAI1_RELEASE_RESET()            CLEAR_BIT(RCC->SAI1CFGR, RCC_SAI1CFGR_SAI1RST)
#define __HAL_RCC_SAI2_RELEASE_RESET()            CLEAR_BIT(RCC->SAI2CFGR, RCC_SAI2CFGR_SAI2RST)
#define __HAL_RCC_SAI3_RELEASE_RESET()            CLEAR_BIT(RCC->SAI3CFGR, RCC_SAI3CFGR_SAI3RST)
#define __HAL_RCC_SAI4_RELEASE_RESET()            CLEAR_BIT(RCC->SAI4CFGR, RCC_SAI4CFGR_SAI4RST)
#define __HAL_RCC_MDF1_RELEASE_RESET()            CLEAR_BIT(RCC->MDF1CFGR, RCC_MDF1CFGR_MDF1RST)
#define __HAL_RCC_ADF1_RELEASE_RESET()            CLEAR_BIT(RCC->ADF1CFGR, RCC_ADF1CFGR_ADF1RST)
#define __HAL_RCC_FDCAN_RELEASE_RESET()           CLEAR_BIT(RCC->FDCANCFGR, RCC_FDCANCFGR_FDCANRST)
#define __HAL_RCC_HDP_RELEASE_RESET()             CLEAR_BIT(RCC->HDPCFGR, RCC_HDPCFGR_HDPRST)

#if defined(RCC_ADC1CFGR_ADC1RST)
#define __HAL_RCC_ADC1_RELEASE_RESET()            CLEAR_BIT(RCC->ADC1CFGR, RCC_ADC1CFGR_ADC1RST)
#endif /* RCC_ADC1CFGR_ADC1RST */

#if defined(RCC_ADC2CFGR_ADC2RST)
#define __HAL_RCC_ADC2_RELEASE_RESET()            CLEAR_BIT(RCC->ADC2CFGR, RCC_ADC2CFGR_ADC2RST)
#endif /* RCC_ADC2CFGR_ADC2RST */

#if defined(RCC_ADC12CFGR_ADC12RST)
#define __HAL_RCC_ADC12_RELEASE_RESET()           CLEAR_BIT(RCC->ADC12CFGR, RCC_ADC12CFGR_ADC12RST)
#endif /* RCC_ADC12CFGR_ADC12RST */

