zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rcc.h
#if defined(RCC_ADC3CFGR_ADC3RST)
#define __HAL_RCC_ADC3_RELEASE_RESET()            CLEAR_BIT(RCC->ADC3CFGR, RCC_ADC3CFGR_ADC3RST)
#endif /* RCC_ADC3CFGR_ADC3RST */

#define __HAL_RCC_ETH1_RELEASE_RESET()            CLEAR_BIT(RCC->ETH1CFGR, RCC_ETH1CFGR_ETH1RST)
#define __HAL_RCC_ETH2_RELEASE_RESET()            CLEAR_BIT(RCC->ETH2CFGR, RCC_ETH2CFGR_ETH2RST)

#if defined(RCC_USBHCFGR_USBHRST)
#define __HAL_RCC_USBH_RELEASE_RESET()            CLEAR_BIT(RCC->USBHCFGR, RCC_USBHCFGR_USBHRST)
#endif /* RCC_USBHCFGR_USBHRST */

#define __HAL_RCC_USB2PHY1_RELEASE_RESET()        CLEAR_BIT(RCC->USB2PHY1CFGR, RCC_USB2PHY1CFGR_USB2PHY1RST)
#define __HAL_RCC_USB2PHY2_RELEASE_RESET()        CLEAR_BIT(RCC->USB2PHY2CFGR, RCC_USB2PHY2CFGR_USB2PHY2RST)

#if defined(RCC_OTGCFGR_OTGRST)
#define __HAL_RCC_OTG_RELEASE_RESET()             CLEAR_BIT(RCC->OTGCFGR, RCC_OTGCFGR_OTGRST)
#endif /* RCC_OTGCFGR_OTGRST */

#if defined(RCC_USB3DRDCFGR_USB3DRDRST)
#define __HAL_RCC_USB3DRD_RELEASE_RESET()         CLEAR_BIT(RCC->USB3DRDCFGR, RCC_USB3DRDCFGR_USB3DRDRST)
#endif /* RCC_USB3DRDCFGR_USB3DRDRST */

#if defined(RCC_USB3PCIEPHYCFGR_USB3PCIEPHYRST)
#define __HAL_RCC_USB3PCIEPHY_RELEASE_RESET()     CLEAR_BIT(RCC->USB3PCIEPHYCFGR, RCC_USB3PCIEPHYCFGR_USB3PCIEPHYRST)
#endif /* RCC_USB3PCIEPHYCFGR_USB3PCIEPHYRST */

#if defined(RCC_PCIECFGR_PCIERST)
#define __HAL_RCC_PCIE_RELEASE_RESET()            CLEAR_BIT(RCC->PCIECFGR, RCC_PCIECFGR_PCIERST)
#endif /* RCC_PCIECFGR_PCIERST */

#if defined(RCC_UCPDCFGR_UCPDRST)
#define __HAL_RCC_UCPD1_RELEASE_RESET()           CLEAR_BIT(RCC->UCPDCFGR, RCC_UCPDCFGR_UCPDRST)
#endif /* RCC_UCPDCFGR_UCPDRST */

#define __HAL_RCC_FMC_RELEASE_RESET()             CLEAR_BIT(RCC->FMCCFGR, RCC_FMCCFGR_FMCRST)
#define __HAL_RCC_SDMMC1_RELEASE_RESET()          CLEAR_BIT(RCC->SDMMC1CFGR, RCC_SDMMC1CFGR_SDMMC1RST)
#define __HAL_RCC_SDMMC2_RELEASE_RESET()          CLEAR_BIT(RCC->SDMMC2CFGR, RCC_SDMMC2CFGR_SDMMC2RST)
#define __HAL_RCC_SDMMC3_RELEASE_RESET()          CLEAR_BIT(RCC->SDMMC3CFGR, RCC_SDMMC3CFGR_SDMMC3RST)
#define __HAL_RCC_GPU_RELEASE_RESET()             CLEAR_BIT(RCC->GPUCFGR, RCC_GPUCFGR_GPURST)
#define __HAL_RCC_LTDC_RELEASE_RESET()            CLEAR_BIT(RCC->LTDCCFGR, RCC_LTDCCFGR_LTDCRST)

#if defined(RCC_DSICFGR_DSIRST)
#define __HAL_RCC_DSI_RELEASE_RESET()             CLEAR_BIT(RCC->DSICFGR, RCC_DSICFGR_DSIRST)
#endif /* RCC_DSICFGR_DSIRST */

#define __HAL_RCC_LVDS_RELEASE_RESET()            CLEAR_BIT(RCC->LVDSCFGR, RCC_LVDSCFGR_LVDSRST)

#if defined(RCC_CSICFGR_CSIRST)
#define __HAL_RCC_CSI_RELEASE_RESET()             CLEAR_BIT(RCC->CSICFGR, RCC_CSICFGR_CSIRST)
#endif /* RCC_CSICFGR_CSIRST */

#if defined(RCC_CSI2CFGR_CSI2RST)
#define __HAL_RCC_CSI2_RELEASE_RESET()            CLEAR_BIT(RCC->CSI2CFGR, RCC_CSI2CFGR_CSI2RST)
#endif /* RCC_CSI2CFGR_CSI2RST */

#define __HAL_RCC_DCMIPP_RELEASE_RESET()          CLEAR_BIT(RCC->DCMIPPCFGR, RCC_DCMIPPCFGR_DCMIPPRST)

#if defined(RCC_DCMIPSSICFGR_DCMIPSSIRST)
#define __HAL_RCC_DCMIPSSI_RELEASE_RESET()        CLEAR_BIT(RCC->DCMIPSSICFGR, RCC_DCMIPSSICFGR_DCMIPSSIRST)
#endif /*RCC_DCMIPSSICFGR_DCMIPSSIRST*/

#if defined(RCC_CCICFGR_CCIRST)
#define __HAL_RCC_CCI_RELEASE_RESET()             CLEAR_BIT(RCC->CCICFGR, RCC_CCICFGR_CCIRST)
#endif /* RCC_CCICFGR_CCIRST */

#if defined(RCC_RNGCFGR_RNGRST)
#define __HAL_RCC_RNG_RELEASE_RESET()             CLEAR_BIT(RCC->RNGCFGR, RCC_RNGCFGR_RNGRST)
#endif /* RCC_RNGCFGR_RNGRST */

#if defined(RCC_RNG1CFGR_RNG1RST)
#define __HAL_RCC_RNG1_RELEASE_RESET()            CLEAR_BIT(RCC->RNG1CFGR, RCC_RNG1CFGR_RNG1RST)
#endif /* RCC_RNG1CFGR_RNG1RST */

#if defined(RCC_RNG2CFGR_RNG2RST)
#define __HAL_RCC_RNG2_RELEASE_RESET()            CLEAR_BIT(RCC->RNG2CFGR, RCC_RNG2CFGR_RNG2RST)
#endif /* RCC_RNG2CFGR_RNG2RST */

#define __HAL_RCC_PKA_RELEASE_RESET()             CLEAR_BIT(RCC->PKACFGR, RCC_PKACFGR_PKARST)
#define __HAL_RCC_SAES_RELEASE_RESET()            CLEAR_BIT(RCC->SAESCFGR, RCC_SAESCFGR_SAESRST)

#if defined(RCC_HASHCFGR_HASHRST)
#define __HAL_RCC_HASH_RELEASE_RESET()            CLEAR_BIT(RCC->HASHCFGR, RCC_HASHCFGR_HASHRST)
#endif /* RCC_HASHCFGR_HASHRST */

#if defined(RCC_HASH1CFGR_HASH1RST)
#define __HAL_RCC_HASH1_RELEASE_RESET()           CLEAR_BIT(RCC->HASH1CFGR, RCC_HASH1CFGR_HASH1RST)
#endif /* RCC_HASH1CFGR_HASH1RST */

#if defined(RCC_HASH2CFGR_HASH2RST)
#define __HAL_RCC_HASH2_RELEASE_RESET()           CLEAR_BIT(RCC->HASH2CFGR, RCC_HASH2CFGR_HASH2RST)
#endif /* RCC_HASH2CFGR_HASH2RST */

#define __HAL_RCC_CRYP1_RELEASE_RESET()           CLEAR_BIT(RCC->CRYP1CFGR, RCC_CRYP1CFGR_CRYP1RST)
#define __HAL_RCC_CRYP2_RELEASE_RESET()           CLEAR_BIT(RCC->CRYP2CFGR, RCC_CRYP2CFGR_CRYP2RST)
#define __HAL_RCC_WWDG1_RELEASE_RESET()           CLEAR_BIT(RCC->WWDG1CFGR, RCC_WWDG1CFGR_WWDG1RST)

#if defined(RCC_WWDG2CFGR_WWDG2RST)
#define __HAL_RCC_WWDG2_RELEASE_RESET()           CLEAR_BIT(RCC->WWDG2CFGR, RCC_WWDG2CFGR_WWDG2RST)
#endif /* RCC_WWDG2CFGR_WWDG2RST */

#define __HAL_RCC_BUSPERFM_RELEASE_RESET()        CLEAR_BIT(RCC->BUSPERFMCFGR, RCC_BUSPERFMCFGR_BUSPERFMRST)
#define __HAL_RCC_VREF_RELEASE_RESET()            CLEAR_BIT(RCC->VREFCFGR, RCC_VREFCFGR_VREFRST)

#if defined (RCC_TMPSENSCFGR_TMPSENSRST)
#define __HAL_RCC_TMPSENS_RELEASE_RESET()         CLEAR_BIT(RCC->TMPSENSCFGR, RCC_TMPSENSCFGR_TMPSENSRST)
#endif /* RCC_TMPSENSCFGR_TMPSENSRST */

#define __HAL_RCC_CRC_RELEASE_RESET()             CLEAR_BIT(RCC->CRCCFGR, RCC_CRCCFGR_CRCRST)
#define __HAL_RCC_I3C1_RELEASE_RESET()            CLEAR_BIT(RCC->I3C1CFGR, RCC_I3C1CFGR_I3C1RST)
#define __HAL_RCC_I3C2_RELEASE_RESET()            CLEAR_BIT(RCC->I3C2CFGR, RCC_I3C2CFGR_I3C2RST)
#define __HAL_RCC_I3C3_RELEASE_RESET()            CLEAR_BIT(RCC->I3C3CFGR, RCC_I3C3CFGR_I3C3RST)

#if defined(RCC_I3C4CFGR_I3C4RST)
#define __HAL_RCC_I3C4_RELEASE_RESET()            CLEAR_BIT(RCC->I3C4CFGR, RCC_I3C4CFGR_I3C4RST)
#endif /* RCC_I3C4CFGR_I3C4RST */

/* for API backward compatibility */
#if defined(RCC_DCMIPSSICFGR_DCMIPSSIRST)
#define __HAL_RCC_DCMI_RELEASE_RESET()            __HAL_RCC_DCMIPSSI_RELEASE_RESET()
#define __HAL_RCC_PSSI_RELEASE_RESET()            __HAL_RCC_DCMIPSSI_RELEASE_RESET()
#endif /* RCC_DCMIPSSICFGR_DCMIPSSIRST */

