zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rcc.h
#if defined(RCC_CCICFGR_CSIRST)
#define __HAL_RCC_DCMI_RELEASE_RESET()            __HAL_RCC_CCI_RELEASE_RESET()
#define __HAL_RCC_PSSI_RELEASE_RESET()            __HAL_RCC_CCI_RELEASE_RESET()
#endif /* RCC_CCICFGR_CSIRST */

#if defined(RCC_C3CFGR_C3EN)
/* C3 allocation macros */
#define __HAL_RCC_LPTIM3_C3_ALLOCATE()            SET_BIT(RCC->C3CFGR, RCC_C3CFGR_LPTIM3C3EN)
#define __HAL_RCC_LPTIM4_C3_ALLOCATE()            SET_BIT(RCC->C3CFGR, RCC_C3CFGR_LPTIM4C3EN)
#define __HAL_RCC_LPTIM5_C3_ALLOCATE()            SET_BIT(RCC->C3CFGR, RCC_C3CFGR_LPTIM5C3EN)
#define __HAL_RCC_SPI8_C3_ALLOCATE()              SET_BIT(RCC->C3CFGR, RCC_C3CFGR_SPI8C3EN)
#define __HAL_RCC_LPUART1_C3_ALLOCATE()           SET_BIT(RCC->C3CFGR, RCC_C3CFGR_LPUART1C3EN)
#define __HAL_RCC_I2C8_C3_ALLOCATE()              SET_BIT(RCC->C3CFGR, RCC_C3CFGR_I2C8C3EN)
#define __HAL_RCC_ADF1_C3_ALLOCATE()              SET_BIT(RCC->C3CFGR, RCC_C3CFGR_ADF1C3EN)
#define __HAL_RCC_GPIOZ_C3_ALLOCATE()             SET_BIT(RCC->C3CFGR, RCC_C3CFGR_GPIOZC3EN)
#define __HAL_RCC_LPDMA_C3_ALLOCATE()             SET_BIT(RCC->C3CFGR, RCC_C3CFGR_LPDMAC3EN)
#define __HAL_RCC_RTC_C3_ALLOCATE()               SET_BIT(RCC->C3CFGR, RCC_C3CFGR_RTCC3EN)
#define __HAL_RCC_I3C4_C3_ALLOCATE()              SET_BIT(RCC->C3CFGR, RCC_C3CFGR_I3C4C3EN)

/* C3 deallocation macros */
#define __HAL_RCC_LPTIM3_C3_DEALLOCATE()          CLEAR_BIT(RCC->C3CFGR, RCC_C3CFGR_LPTIM3C3EN)
#define __HAL_RCC_LPTIM4_C3_DEALLOCATE()          CLEAR_BIT(RCC->C3CFGR, RCC_C3CFGR_LPTIM4C3EN)
#define __HAL_RCC_LPTIM5_C3_DEALLOCATE()          CLEAR_BIT(RCC->C3CFGR, RCC_C3CFGR_LPTIM5C3EN)
#define __HAL_RCC_SPI8_C3_DEALLOCATE()            CLEAR_BIT(RCC->C3CFGR, RCC_C3CFGR_SPI8C3EN)
#define __HAL_RCC_LPUART1_C3_DEALLOCATE()         CLEAR_BIT(RCC->C3CFGR, RCC_C3CFGR_LPUART1C3EN)
#define __HAL_RCC_I2C8_C3_DEALLOCATE()            CLEAR_BIT(RCC->C3CFGR, RCC_C3CFGR_I2C8C3EN)
#define __HAL_RCC_ADF1_C3_DEALLOCATE()            CLEAR_BIT(RCC->C3CFGR, RCC_C3CFGR_ADF1C3EN)
#define __HAL_RCC_GPIOZ_C3_DEALLOCATE()           CLEAR_BIT(RCC->C3CFGR, RCC_C3CFGR_GPIOZC3EN)
#define __HAL_RCC_LPDMA_C3_DEALLOCATE()           CLEAR_BIT(RCC->C3CFGR, RCC_C3CFGR_LPDMAC3EN)
#define __HAL_RCC_RTC_C3_DEALLOCATE()             CLEAR_BIT(RCC->C3CFGR, RCC_C3CFGR_RTCC3EN)
#define __HAL_RCC_I3C4_C3_DEALLOCATE()            CLEAR_BIT(RCC->C3CFGR, RCC_C3CFGR_I3C4C3EN)
#endif /* RCC_C3CFGR_C3EN */

/* Allows/Prevents CStop & Enhanced CSleep modes for all A35_* cores */
#ifdef CORE_CA35
#if defined(RCC_C1SREQCLRR_STPREQ_P1)
#define __HAL_RCC_ALLOW_CSTOP()                   SET_BIT(RCC->C1SREQSETR, RCC_C1SREQSETR_STPREQ_P1 |\
                                                          RCC_C1SREQSETR_STPREQ_P0)
#define __HAL_RCC_PREVENT_CSTOP()                 WRITE_REG(RCC->C1SREQCLRR, RCC_C1SREQCLRR_STPREQ_P1 |\
                                                            RCC_C1SREQCLRR_STPREQ_P0)
#else
#define __HAL_RCC_ALLOW_CSTOP()                   SET_BIT(RCC->C1SREQSETR, RCC_C1SREQSETR_STPREQ_P0)
#define __HAL_RCC_PREVENT_CSTOP()                 WRITE_REG(RCC->C1SREQCLRR, RCC_C1SREQCLRR_STPREQ_P0)
#endif /* RCC_C1SREQCLRR_STPREQ_P1 */
#define __HAL_RCC_ALLOW_ENHANCED_CSLEEP()         SET_BIT(RCC->C1SREQSETR, RCC_C1SREQSETR_ESLPREQ)
#define __HAL_RCC_PREVENT_ENHANCED_CSLEEP()       WRITE_REG(RCC->C1SREQCLRR, RCC_C1SREQCLRR_ESLPREQ)
#endif /* CORE_CA35 */

#if defined(RCC_ADC1CFGR_ADC1KERSEL)
/** @defgroup RCC_ADC1_Kernel_Clock_Source RCC_ADC1_Kernel_Clock_Source
  * @{
  */
#define RCC_ADC1KERCLKSOURCE_CK_KER_ADC1     (0x0U << RCC_ADC1CFGR_ADC1KERSEL_Pos)
#define RCC_ADC1KERCLKSOURCE_CK_ICN_LS_MCU   (0x1U << RCC_ADC1CFGR_ADC1KERSEL_Pos)

#define IS_RCC_ADC1KERCLKSOURCE(SOURCE) (((SOURCE) == RCC_ADC1KERCLKSOURCE_CK_KER_ADC1) || \
                                         ((SOURCE) == RCC_ADC1KERCLKSOURCE_CK_ICN_LS_MCU))

/**
  * @brief  Macro to select ADC1 kernel source clock
  *
  * @param  __RCC_ADC1KERSOURCE__: specifies the ADC1 entry kernel clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_ADC1KERCLKSOURCE_CK_KER_ADC1:  "ck_ker_adc1"  Flexiclockgen output 46
  *            @arg RCC_ADC1KERCLKSOURCE_CK_ICN_LS_MCU: "ck_icn_ls_mcu" Flexiclockgen output 0
  *
  * @retval None
  */
#define __HAL_RCC_ADC1KERCLK_SETSOURCE(__RCC_ADC1KERSOURCE__) \
  MODIFY_REG( RCC->ADC1CFGR, RCC_ADC1CFGR_ADC1KERSEL,(__RCC_ADC1KERSOURCE__)  )

/** @brief  Macro to get the clock source used as ADC1 kernel source clock.
  * @retval The clock source used as ADC1 kernel source clock. The returned value can be one
  *         of the following:
  *            @arg RCC_ADC1KERCLKSOURCE_CK_KER_ADC1:  "ck_ker_adc1"  Flexiclockgen output 46
  *            @arg RCC_ADC1KERCLKSOURCE_CK_ICN_LS_MCU: "ck_icn_ls_mcu" Flexiclockgen output 0
  */
#define __HAL_RCC_ADC1KERCLK_GETSOURCE()  (RCC->ADC1CFGR & RCC_ADC1CFGR_ADC1KERSEL_Msk)
/**
  * @}
  */
#endif /* RCC_ADC1CFGR_ADC1KERSEL */

#if defined(RCC_ADC2CFGR_ADC2KERSEL)
/** @defgroup RCC_ADC2_Kernel_Clock_Source RCC_ADC2_Kernel_Clock_Source
  * @{
  */
#define RCC_ADC2KERCLKSOURCE_CK_KER_ADC2      (0x0U << RCC_ADC2CFGR_ADC2KERSEL_Pos)
#define RCC_ADC2KERCLKSOURCE_CK_ICN_LS_MCU    (0x1U << RCC_ADC2CFGR_ADC2KERSEL_Pos)
#define RCC_ADC2KERCLKSOURCE_CK_KER_ADC1      (0x2U << RCC_ADC2CFGR_ADC2KERSEL_Pos)

#define IS_RCC_ADC2KERCLKSOURCE(SOURCE) (((SOURCE) == RCC_ADC2KERCLKSOURCE_CK_KER_ADC2)  || \
                                         ((SOURCE) == RCC_ADC2KERCLKSOURCE_CK_ICN_LS_MCU)|| \
                                         ((SOURCE) == RCC_ADC2KERCLKSOURCE_CK_KER_ADC1))

/**
  * @brief  Macro to select ADC2 kernel source clock
  *
  * @param  __RCC_ADC2KERSOURCE__: specifies the ADC2 entry kernel clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_ADC2KERCLKSOURCE_CK_KER_ADC2:  "ck_ker_adc2"  Flexiclockgen output 47
  *            @arg RCC_ADC2KERCLKSOURCE_CK_ICN_LS_MCU: "ck_icn_ls_mcu" Flexiclockgen output 0
  *            @arg RCC_ADC2KERCLKSOURCE_CK_KER_ADC1:  "ck_ker_adc1"  Flexiclockgen output 46
  *
  * @retval None
  */
#define __HAL_RCC_ADC2KERCLK_SETSOURCE(__RCC_ADC2KERSOURCE__) \
  MODIFY_REG( RCC->ADC2CFGR, RCC_ADC2CFGR_ADC2KERSEL,(__RCC_ADC2KERSOURCE__)  )

/** @brief  Macro to get the clock source used as ADC2 kernel source clock.
  * @retval The clock source used as ADC2 kernel source clock. The returned value can be one
  *         of the following:
  *            @arg RCC_ADC2KERCLKSOURCE_CK_KER_ADC2:  "ck_ker_adc2"  Flexiclockgen output 47
  *            @arg RCC_ADC2KERCLKSOURCE_CK_ICN_LS_MCU: "ck_icn_ls_mcu" Flexiclockgen output 0
  */
#define __HAL_RCC_ADC2KERCLK_GETSOURCE()  (RCC->ADC2CFGR & RCC_ADC2CFGR_ADC2KERSEL_Msk)
/**
  * @}
  */
#endif /* RCC_ADC2CFGR_ADC2KERSEL */


#if defined(RCC_ADC12CFGR_ADC12KERSEL)
/** @defgroup RCC_ADC12_Kernel_Clock_Source RCC_ADC12_Kernel_Clock_Source
  * @{
  */
#define RCC_ADC12KERCLKSOURCE_CK_KER_ADC12     (0x0U << RCC_ADC12CFGR_ADC12KERSEL_Pos)
#define RCC_ADC12KERCLKSOURCE_CK_ICN_LS_MCU    (0x1U << RCC_ADC12CFGR_ADC12KERSEL_Pos)

#define IS_RCC_ADC12KERCLKSOURCE(SOURCE) (((SOURCE) == RCC_ADC12KERCLKSOURCE_CK_KER_ADC12) || \
                                          ((SOURCE) == RCC_ADC12KERCLKSOURCE_CK_ICN_LS_MCU))

/**
  * @brief  Macro to select ADC12 kernel source clock
  *
  * @param  __RCC_ADC12KERSOURCE__: specifies the ADC12 entry kernel clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_ADC12KERCLKSOURCE_CK_KER_ADC12:  "ck_ker_adc12"  Flexiclockgen output 46
  *            @arg RCC_ADC12KERCLKSOURCE_CK_ICN_LS_MCU: "ck_icn_ls_mcu" Flexiclockgen output 0
  *
  * @retval None
  */
#define __HAL_RCC_ADC12KERCLK_SETSOURCE(__RCC_ADC12KERSOURCE__) \
  MODIFY_REG( RCC->ADC12CFGR, RCC_ADC12CFGR_ADC12KERSEL,(__RCC_ADC12KERSOURCE__)  )

/** @brief  Macro to get the clock source used as ADC12 kernel source clock.
  * @retval The clock source used as ADC12 kernel source clock. The returned value can be one
  *         of the following:
  *            @arg RCC_ADC12KERCLKSOURCE_CK_KER_ADC12:  "ck_ker_adc12"  Flexiclockgen output 46
  *            @arg RCC_ADC12KERCLKSOURCE_CK_ICN_LS_MCU: "ck_icn_ls_mcu" Flexiclockgen output 0
  */
#define __HAL_RCC_ADC12KERCLK_GETSOURCE()  (RCC->ADC12CFGR & RCC_ADC12CFGR_ADC12KERSEL_Msk)
/**
  * @}
  */
#endif /* RCC_ADC12CFGR_ADC12KERSEL */

