zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rcc.h
#if defined(RCC_ADC3CFGR_ADC3KERSEL)
/** @defgroup RCC_ADC3_Kernel_Clock_Source RCC_ADC3_Kernel_Clock_Source
  * @{
  */
#define RCC_ADC3KERCLKSOURCE_CK_KER_ADC3      (0x0U << RCC_ADC3CFGR_ADC3KERSEL_Pos)
#define RCC_ADC3KERCLKSOURCE_CK_ICN_LS_MCU    (0x1U << RCC_ADC3CFGR_ADC3KERSEL_Pos)
#define RCC_ADC3KERCLKSOURCE_CK_KER_ADC12     (0x2U << RCC_ADC3CFGR_ADC3KERSEL_Pos)

#define IS_RCC_ADC3KERCLKSOURCE(SOURCE) (((SOURCE) == RCC_ADC3KERCLKSOURCE_CK_KER_ADC3) || \
                                         ((SOURCE) == RCC_ADC3KERCLKSOURCE_CK_ICN_LS_MCU) || \
                                         ((SOURCE) == RCC_ADC3KERCLKSOURCE_CK_KER_ADC12))

/**
  * @brief  Macro to select ADC3 kernel source clock
  *
  * @param  __RCC_ADC3KERSOURCE__: specifies the ADC3 entry kernel clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_ADC3KERCLKSOURCE_CK_KER_ADC3:   "ck_ker_adc3"   Flexiclockgen output 47
  *            @arg RCC_ADC3KERCLKSOURCE_CK_ICN_LS_MCU: "ck_icn_ls_mcu" Flexiclockgen output 0
  *            @arg RCC_ADC3KERCLKSOURCE_CK_KER_ADC12:  "ck_ker_adc12"  Flexiclockgen output 46
  *
  * @retval None
  */
#define __HAL_RCC_ADC3KERCLK_SETSOURCE(__RCC_ADC3KERSOURCE__) \
  MODIFY_REG( RCC->ADC3CFGR, RCC_ADC3CFGR_ADC3KERSEL, (__RCC_ADC3KERSOURCE__)  )

/** @brief  Macro to get the clock source used as ADC3 kernel source clock.
  * @retval The clock source used as ADC3 kernel source clock. The returned value can be one
  *         of the following:
  *            @arg RCC_ADC3KERCLKSOURCE_CK_KER_ADC3:   "ck_ker_adc3"   Flexiclockgen output 47
  *            @arg RCC_ADC3KERCLKSOURCE_CK_ICN_LS_MCU: "ck_icn_ls_mcu" Flexiclockgen output 0
  *            @arg RCC_ADC3KERCLKSOURCE_CK_KER_ADC12:  "ck_ker_adc12"  Flexiclockgen output 46
  */
#define __HAL_RCC_ADC3KERCLK_GETSOURCE()  (RCC->ADC3CFGR & RCC_ADC3CFGR_ADC3KERSEL_Msk)
/**
  * @}
  */
#endif /* RCC_ADC3CFGR_ADC3KERSEL */

/** @defgroup RCC_USB2PHY1_Kernel_Clock_Source RCC_USB2PHY1_Kernel_Clock_Source
  * @{
  */
#define RCC_USB2PHY1KERCLKSOURCE_CK_KER_USB2PHY1    (0x0U << RCC_USB2PHY1CFGR_USB2PHY1CKREFSEL_Pos)
#define RCC_USB2PHY1KERCLKSOURCE_HSE_KER_CLK        (0x1U << RCC_USB2PHY1CFGR_USB2PHY1CKREFSEL_Pos)

#define IS_RCC_USB2PHY1KERCLKSOURCE(SOURCE) (((SOURCE) == RCC_USB2PHY1KERCLKSOURCE_CK_KER_USB2PHY1) || \
                                             ((SOURCE) == RCC_USB2PHY1KERCLKSOURCE_HSE_KER_CLK))

/**
  * @brief  Macro to select USB2PHY1 kernel source clock
  *
  * @param  __RCC_USB2PHY1KERSOURCE__: specifies the USB2PHY1 entry kernel clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_USB2PHY1KERCLKSOURCE_CK_KER_USB2PHY1: "ck_ker_USB2PHY1"   Flexiclockgen output 57
  *            @arg RCC_USB2PHY1KERCLKSOURCE_HSE_KER_CLK:     "RCC_XBAR_CLKSRC_HSE_KER" RCC_Xbar_source
  *
  * @retval None
  */
#define __HAL_RCC_USB2PHY1KERCLK_SETSOURCE(__RCC_USB2PHY1KERSOURCE__) \
  MODIFY_REG( RCC->USB2PHY1CFGR, RCC_USB2PHY1CFGR_USB2PHY1CKREFSEL, (__RCC_USB2PHY1KERSOURCE__)  )

/** @brief  Macro to get the clock source used as USB2PHY1 kernel source clock.
  * @retval The clock source used as USB2PHY1 kernel source clock. The returned value can be one
  *         of the following:
  *            @arg RCC_USB2PHY1KERCLKSOURCE_CK_KER_USB2PHY1: "ck_ker_USB2PHY1"   Flexiclockgen output 57
  *            @arg RCC_USB2PHY1KERCLKSOURCE_HSE_KER_CLK:     "RCC_XBAR_CLKSRC_HSE_KER" RCC_Xbar_source
  */
#define __HAL_RCC_USB2PHY1KERCLK_GETSOURCE()  (RCC->USB2PHY1CFGR & RCC_USB2PHY1CFGR_USB2PHY1CKREFSEL_Msk)
/**
  * @}
  */

/** @defgroup RCC_USB2PHY2_Kernel_Clock_Source RCC_USB2PHY2_Kernel_Clock_Source
  * @{
  */
#define RCC_USB2PHY2KERCLKSOURCE_CK_KER_USB2PHY2    (0x0U << RCC_USB2PHY2CFGR_USB2PHY2CKREFSEL_Pos)
#define RCC_USB2PHY2KERCLKSOURCE_HSE_KER_CLK        (0x1U << RCC_USB2PHY2CFGR_USB2PHY2CKREFSEL_Pos)

#define IS_RCC_USB2PHY2KERCLKSOURCE(SOURCE) (((SOURCE) == RCC_USB2PHY2KERCLKSOURCE_CK_KER_USB2PHY2) || \
                                             ((SOURCE) == RCC_USB2PHY2KERCLKSOURCE_HSE_KER_CLK))

/**
  * @brief  Macro to select USB2PHY2 kernel source clock
  *
  * @param  __RCC_USB2PHY2KERSOURCE__: specifies the USB2PHY2 entry kernel clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_USB2PHY2KERCLKSOURCE_CK_KER_USB2PHY2: "ck_ker_USB2PHY2"   Flexiclockgen output 58
  *            @arg RCC_USB2PHY2KERCLKSOURCE_HSE_KER_CLK:     "RCC_XBAR_CLKSRC_HSE_KER" RCC_Xbar_source
  *
  * @retval None
  */
#define __HAL_RCC_USB2PHY2KERCLK_SETSOURCE(__RCC_USB2PHY2KERSOURCE__) \
  MODIFY_REG( RCC->USB2PHY2CFGR, RCC_USB2PHY2CFGR_USB2PHY2CKREFSEL, (__RCC_USB2PHY2KERSOURCE__)  )

/** @brief  Macro to get the clock source used as USB2PHY2 kernel source clock.
  * @retval The clock source used as USB2PHY2 kernel source clock. The returned value can be one
  *         of the following:
  *            @arg RCC_USB2PHY2KERCLKSOURCE_CK_KER_USB2PHY2: "ck_ker_USB2PHY2"   Flexiclockgen output 58
  *            @arg RCC_USB2PHY2KERCLKSOURCE_HSE_KER_CLK:     "RCC_XBAR_CLKSRC_HSE_KER" RCC_Xbar_source
  */
#define __HAL_RCC_USB2PHY2KERCLK_GETSOURCE()  (RCC->USB2PHY2CFGR & RCC_USB2PHY2CFGR_USB2PHY2CKREFSEL_Msk)
/**
  * @}
  */

/** @defgroup RCC_USB3PCIEPHY_Kernel_Clock_Source RCC_USB3PCIEPHY_Kernel_Clock_Source
  * @{
  */
#define RCC_USB3PCIEPHYKERCLKSOURCE_CK_KER_USB3PCIEPHY    (0x0U << RCC_USB3PCIEPHYCFGR_USB3PCIEPHYCKREFSEL_Pos)
#define RCC_USB3PCIEPHYKERCLKSOURCE_HSE_KER_CLK           (0x1U << RCC_USB3PCIEPHYCFGR_USB3PCIEPHYCKREFSEL_Pos)

#define IS_RCC_USB3PCIEPHYKERCLKSOURCE(SOURCE) (((SOURCE) == RCC_USB3PCIEPHYKERCLKSOURCE_CK_KER_USB3PCIEPHY) || \
                                                ((SOURCE) == RCC_USB3PCIEPHYKERCLKSOURCE_HSE_KER_CLK))

/**
  * @brief  Macro to select USB3PCIEPHY kernel source clock
  *
  * @param  __RCC_USB3PCIEPHYKERSOURCE__: specifies the USB3PCIEPHY entry kernel clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_USB3PCIEPHYKERCLKSOURCE_CK_KER_USB3PCIEPHY: "ck_ker_USB3PCIEPHY"   Flexiclockgen output 34
  *            @arg RCC_USB3PCIEPHYKERCLKSOURCE_HSE_KER_CLK:     "RCC_XBAR_CLKSRC_HSE_KER" RCC_Xbar_source
  *
  * @retval None
  */
#define __HAL_RCC_USB3PCIEPHYKERCLK_SETSOURCE(__RCC_USB3PCIEPHYKERSOURCE__) \
  MODIFY_REG( RCC->USB3PCIEPHYCFGR, RCC_USB3PCIEPHYCFGR_USB3PCIEPHYCKREFSEL, (__RCC_USB3PCIEPHYKERSOURCE__)  )

/** @brief  Macro to get the clock source used as USB3PCIEPHY kernel source clock.
  * @retval The clock source used as USB3PCIEPHY kernel source clock. The returned value can be one
  *         of the following:
  *            @arg RCC_USB3PCIEPHYKERCLKSOURCE_CK_KER_USB3PCIEPHY: "ck_ker_USB3PCIEPHY"   Flexiclockgen output 34
  *            @arg RCC_USB3PCIEPHYKERCLKSOURCE_HSE_KER_CLK:     "RCC_XBAR_CLKSRC_HSE_KER" RCC_Xbar_source
  */
#define __HAL_RCC_USB3PCIEPHYKERCLK_GETSOURCE()  (RCC->USB3PCIEPHYCFGR & RCC_USB3PCIEPHYCFGR_USB3PCIEPHYCKREFSEL_Msk)
/**
  * @}
  */

