zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rcc.h
#if defined(DSI)
/** @defgroup RCC_DSIPHY_Kernel_Clock_Source RCC_DSIPHY_Kernel_Clock_Source
  * @{
  */
#define RCC_DSIPHYKERCLKSOURCE_CK_KER_DSIPHY    (0x0U << RCC_DSICFGR_DSIPHYCKREFSEL_Pos)
#define RCC_DSIPHYKERCLKSOURCE_HSE_KER_CLK      (0x1U << RCC_DSICFGR_DSIPHYCKREFSEL_Pos)

#define IS_RCC_DSIPHYKERCLKSOURCE(SOURCE) (((SOURCE) == RCC_DSIPHYKERCLKSOURCE_CK_KER_DSIPHY) || \
                                           ((SOURCE) == RCC_DSIPHYKERCLKSOURCE_HSE_KER_CLK))

/**
  * @brief  Macro to select DSIPHY kernel source clock
  *
  * @param  __RCC_DSIPHYKERSOURCE__: specifies the DSIPHY entry kernel clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_DSIPHYKERCLKSOURCE_CK_KER_DSIPHY: "ck_ker_DSIPHY"   Flexiclockgen output 28
  *            @arg RCC_DSIPHYKERCLKSOURCE_HSE_KER_CLK:   "RCC_XBAR_CLKSRC_HSE_KER" RCC_Xbar_source
  *
  * @retval None
  */
#define __HAL_RCC_DSIPHYKERCLK_SETSOURCE(__RCC_DSIPHYKERSOURCE__) \
  MODIFY_REG( RCC->DSICFGR, RCC_DSICFGR_DSIPHYCKREFSEL, (__RCC_DSIPHYKERSOURCE__)  )

/** @brief  Macro to get the clock source used as DSIPHY kernel source clock.
  * @retval The clock source used as DSIPHY kernel source clock. The returned value can be one
  *         of the following:
  *            @arg RCC_DSIPHYKERCLKSOURCE_CK_KER_DSIPHY: "ck_ker_DSIPHY"   Flexiclockgen output 28
  *            @arg RCC_DSIPHYKERCLKSOURCE_HSE_KER_CLK:   "RCC_XBAR_CLKSRC_HSE_KER" RCC_Xbar_source
  */
#define __HAL_RCC_DSIPHYKERCLK_GETSOURCE()  (RCC->DSICFGR & RCC_DSICFGR_DSIPHYCKREFSEL_Msk)
/**
  * @}
  */

/** @defgroup RCC_DSIBL_Kernel_Clock_Source RCC_DSIBL_Kernel_Clock_Source
  * @{
  */
#define RCC_DSIBLKERCLKSOURCE_CK_DSIPHY_SEL    (0x0UL << RCC_DSICFGR_DSIBLSEL_Pos)
#define RCC_DSIBLKERCLKSOURCE_CK_KER_LTDC      (0x1UL << RCC_DSICFGR_DSIBLSEL_Pos)

#define IS_RCC_DSIBLKERCLKSOURCE(SOURCE) (((SOURCE) == RCC_DSIBLKERCLKSOURCE_CK_DSIPHY_SEL) || \
                                          ((SOURCE) == RCC_DSIBLKERCLKSOURCE_CK_KER_LTDC))

/**
  * @brief  Macro to select DSIBL kernel source clock
  *
  * @param  __RCC_DSIBLKERSOURCE__: specifies the DSIBL entry kernel clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_DSIBLKERCLKSOURCE_CK_DSIPHY_SEL: DSIPHY clock is selected
  *            @arg RCC_DSIBLKERCLKSOURCE_CK_KER_LTDC:  "ck_ker_LTDC"   Flexiclockgen output 27
  *
  * @retval None
  */
#define __HAL_RCC_DSIBLKERCLK_SETSOURCE(__RCC_DSIBLKERSOURCE__) \
  MODIFY_REG( RCC->DSICFGR, RCC_DSICFGR_DSIBLSEL, (__RCC_DSIBLKERSOURCE__)  )

/** @brief  Macro to get the clock source used as DSIBL kernel source clock.
  * @retval The clock source used as DSIBL kernel source clock. The returned value can be one
  *         of the following:
  *            @arg RCC_DSIBLKERCLKSOURCE_CK_DSIPHY_SEL: DSIPHY clock is selected
  *            @arg RCC_DSIBLKERCLKSOURCE_CK_KER_LTDC:  "ck_ker_LTDC"   Flexiclockgen output 27
  */
#define __HAL_RCC_DSIBLKERCLK_GETSOURCE() (RCC->DSICFGR & RCC_DSICFGR_DSIBLSEL_Msk)
#endif /* DSI */
/**
  * @}
  */

/** @defgroup RCC_LVDSPHY_Kernel_Clock_Source RCC_LVDSPHY_Kernel_Clock_Source
  *  @{
  */
#define RCC_LVDSPHYKERCLKSOURCE_CK_KER_LVDSPHY    (0x0U << RCC_LVDSCFGR_LVDSPHYCKREFSEL_Pos)
#define RCC_LVDSPHYKERCLKSOURCE_HSE_KER_CLK       (0x1U << RCC_LVDSCFGR_LVDSPHYCKREFSEL_Pos)

#define IS_RCC_LVDSPHYKERCLKSOURCE(SOURCE) (((SOURCE) == RCC_LVDSPHYKERCLKSOURCE_CK_KER_LVDSPHY) || \
                                            ((SOURCE) == RCC_LVDSPHYKERCLKSOURCE_HSE_KER_CLK))

/**
  * @brief  Macro to select LVDSPHY kernel source clock
  *
  * @param  __RCC_LVDSPHYKERSOURCE__: specifies the LVDSPHY entry kernel clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_LVDSPHYKERCLKSOURCE_CK_KER_LVDSPHY: "ck_ker_LVDSPHY"   Flexiclockgen output 32
  *            @arg RCC_LVDSPHYKERCLKSOURCE_HSE_KER_CLK:     "RCC_XBAR_CLKSRC_HSE_KER" RCC_Xbar_source
  *
  * @retval None
  */
#define __HAL_RCC_LVDSPHYKERCLK_SETSOURCE(__RCC_LVDSPHYKERSOURCE__) \
  MODIFY_REG( RCC->LVDSCFGR, RCC_LVDSCFGR_LVDSPHYCKREFSEL, (__RCC_LVDSPHYKERSOURCE__)  )

/** @brief  Macro to get the clock source used as LVDSPHY kernel source clock.
  * @retval The clock source used as LVDSPHY kernel source clock. The returned value can be one
  *         of the following:
  *            @arg RCC_LVDSPHYKERCLKSOURCE_CK_KER_LVDSPHY: "ck_ker_LVDSPHY"   Flexiclockgen output 32
  *            @arg RCC_LVDSPHYKERCLKSOURCE_HSE_KER_CLK:     "RCC_XBAR_CLKSRC_HSE_KER" RCC_Xbar_source
  */
#define __HAL_RCC_LVDSPHYKERCLK_GETSOURCE() (RCC->LVDSCFGR & RCC_LVDSCFGR_LVDSPHYCKREFSEL_Msk)
/**
  * @}
  */

/** @defgroup RCC_DTS_Kernel_Clock_Source RCC_DTS_Kernel_Clock_Source
  *  @{
  */

#define RCC_DTSKERCLKSOURCE_HSI_KER_CLK    (0x0U << RCC_DTSCFGR_DTSKERSEL_Pos)
#define RCC_DTSKERCLKSOURCE_HSE_KER_CLK    (0x1U << RCC_DTSCFGR_DTSKERSEL_Pos)
#define RCC_DTSKERCLKSOURCE_MSI_KER_CLK    (0x2U << RCC_DTSCFGR_DTSKERSEL_Pos)

#define IS_RCC_DTSKERCLKSOURCE(SOURCE) (((SOURCE) == RCC_DTSKERCLKSOURCE_HSI_KER_CLK) || \
                                        ((SOURCE) == RCC_DTSKERCLKSOURCE_HSE_KER_CLK) ||\
                                        ((SOURCE) == RCC_DTSKERCLKSOURCE_MSI_KER_CLK))

/**
  * @brief  Macro to select DTS kernel source clock
  *
  * @param  __RCC_DTSKERSOURCE__: specifies the DTS entry kernel clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_DTSKERCLKSOURCE_HSI_KER_CLK:     "RCC_XBAR_CLKSRC_HSI_KER" RCC_Xbar_sourc
  *            @arg RCC_DTSKERCLKSOURCE_HSE_KER_CLK:     "RCC_XBAR_CLKSRC_HSE_KER" RCC_Xbar_source
  *            @arg RCC_DTSKERCLKSOURCE_MSI_KER_CLK:     "RCC_XBAR_CLKSRC_MSI_KER" RCC_Xbar_sourc
  *
  * @retval None
  */
#define __HAL_RCC_DTSKERCLK_SETSOURCE(__RCC_DTSKERSOURCE__) \
  MODIFY_REG( RCC->TMPSENSCFGR, RCC_DTSCFGR_DTSKERSEL, (__RCC_DTSKERSOURCE__)  )

/** @brief  Macro to get the clock source used as DTS kernel source clock.
  * @retval The clock source used as DTS kernel source clock. The returned value can be one
  *         of the following:
  *            @arg RCC_DTSKERCLKSOURCE_HSI_KER_CLK:     "RCC_XBAR_CLKSRC_HSI_KER" RCC_Xbar_sourc
  *            @arg RCC_DTSKERCLKSOURCE_HSE_KER_CLK:     "RCC_XBAR_CLKSRC_HSE_KER" RCC_Xbar_source
  *            @arg RCC_DTSKERCLKSOURCE_MSI_KER_CLK:     "RCC_XBAR_CLKSRC_MSI_KER" RCC_Xbar_sourc
  */
#define __HAL_RCC_DTSKERCLK_GETSOURCE() (RCC->TMPSENSCFGR & RCC_DTSCFGR_DTSKERSEL_Msk)
/**
  * @}
  */

/** @defgroup RCC_RTC_Kernel_Clock_Source RCC_RTC_Kernel_Clock_Source
  *  @{
  */

#define RCC_RTCKERCLKSOURCE_CLK_NONE       (0x0U << RCC_BDCR_RTCSRC_Pos)
#define RCC_RTCKERCLKSOURCE_LSE_KER_CLK    (0x1U << RCC_BDCR_RTCSRC_Pos)
#define RCC_RTCKERCLKSOURCE_LSI_KER_CLK    (0x2U << RCC_BDCR_RTCSRC_Pos)
#define RCC_RTCKERCLKSOURCE_HSE_RTCDIV     (0x3U << RCC_BDCR_RTCSRC_Pos)

#define IS_RCC_RTCKERCLKSOURCE(SOURCE) (((SOURCE) == RCC_RTCKERCLKSOURCE_CLK_NONE)    || \
                                        ((SOURCE) == RCC_RTCKERCLKSOURCE_LSE_KER_CLK) || \
                                        ((SOURCE) == RCC_RTCKERCLKSOURCE_LSI_KER_CLK) || \
                                        ((SOURCE) == RCC_RTCKERCLKSOURCE_HSE_RTCDIV))

/**
  * @brief  Macro to select RTC kernel source clock
  *
  * @param  __RCC_RTCKERSOURCE__: specifies the RTC entry kernel clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_RTCKERCLKSOURCE_CLK_NONE:         No clock source
  *            @arg RCC_RTCKERCLKSOURCE_LSE_KER_CLK:     "RCC_XBAR_CLKSRC_LSE" RCC_Xbar_sourc
  *            @arg RCC_RTCKERCLKSOURCE_LSI_KER_CLK:     "RCC_XBAR_CLKSRC_LSI" RCC_Xbar_source
  *            @arg RCC_RTCKERCLKSOURCE_HSE_RTCDIV:       RTC HSE PRESCALER
  *
  * @retval None
  */
#define __HAL_RCC_RTCKERCLK_SETSOURCE(__RCC_RTCKERSOURCE__) \
  MODIFY_REG( RCC->BDCR, RCC_BDCR_RTCSRC, (__RCC_RTCKERSOURCE__)  )

/** @brief  Macro to get the clock source used as RTC kernel source clock.
  * @retval The clock source used as RTC kernel source clock. The returned value can be one
  *         of the following:
  *            @arg RCC_RTCKERCLKSOURCE_CLK_NONE:         No clock source
  *            @arg RCC_RTCKERCLKSOURCE_LSE_KER_CLK:     "RCC_XBAR_CLKSRC_LSE" RCC_Xbar_sourc
  *            @arg RCC_RTCKERCLKSOURCE_LSI_KER_CLK:     "RCC_XBAR_CLKSRC_LSI" RCC_Xbar_source
  *            @arg RCC_RTCKERCLKSOURCE_HSE_RTCDIV:       RTC HSE PRESCALER
  */
#define __HAL_RCC_RTCKERCLK_GETSOURCE() (RCC->BDCR & RCC_BDCR_RTCSRC_Msk)

/**
  * @brief  Macro to select HSE Prescaler for RTC Clock
  *
  * @param  __RCC_RTCPRESCALER__: specifies the RTC prescaler value
  *          This parameter can be one of the following values:
  *         @arg  RCC_RTC_HSE_DIV_1
  *         @arg  RCC_RTC_HSE_DIV_2
  *         @arg  RCC_RTC_HSE_DIV_3
  *         @arg  RCC_RTC_HSE_DIV_4
  *         @arg  RCC_RTC_HSE_DIV_5
  *         @arg  RCC_RTC_HSE_DIV_6
  *         @arg  RCC_RTC_HSE_DIV_7
  *         @arg  RCC_RTC_HSE_DIV_8
  *         @arg  RCC_RTC_HSE_DIV_9
  *         @arg  RCC_RTC_HSE_DIV_10
  *         @arg  RCC_RTC_HSE_DIV_11
  *         @arg  RCC_RTC_HSE_DIV_12
  *         @arg  RCC_RTC_HSE_DIV_13
  *         @arg  RCC_RTC_HSE_DIV_14
  *         @arg  RCC_RTC_HSE_DIV_15
  *         @arg  RCC_RTC_HSE_DIV_16
  *         @arg  RCC_RTC_HSE_DIV_17
  *         @arg  RCC_RTC_HSE_DIV_18
  *         @arg  RCC_RTC_HSE_DIV_19
  *         @arg  RCC_RTC_HSE_DIV_20
  *         @arg  RCC_RTC_HSE_DIV_21
  *         @arg  RCC_RTC_HSE_DIV_22
  *         @arg  RCC_RTC_HSE_DIV_23
  *         @arg  RCC_RTC_HSE_DIV_24
  *         @arg  RCC_RTC_HSE_DIV_25
  *         @arg  RCC_RTC_HSE_DIV_26
  *         @arg  RCC_RTC_HSE_DIV_27
  *         @arg  RCC_RTC_HSE_DIV_28
  *         @arg  RCC_RTC_HSE_DIV_29
  *         @arg  RCC_RTC_HSE_DIV_30
  *         @arg  RCC_RTC_HSE_DIV_31
  *         @arg  RCC_RTC_HSE_DIV_32
  *         @arg  RCC_RTC_HSE_DIV_33
  *         @arg  RCC_RTC_HSE_DIV_34
  *         @arg  RCC_RTC_HSE_DIV_35
  *         @arg  RCC_RTC_HSE_DIV_36
  *         @arg  RCC_RTC_HSE_DIV_37
  *         @arg  RCC_RTC_HSE_DIV_38
  *         @arg  RCC_RTC_HSE_DIV_39
  *         @arg  RCC_RTC_HSE_DIV_40
  *         @arg  RCC_RTC_HSE_DIV_41
  *         @arg  RCC_RTC_HSE_DIV_42
  *         @arg  RCC_RTC_HSE_DIV_43
  *         @arg  RCC_RTC_HSE_DIV_44
  *         @arg  RCC_RTC_HSE_DIV_45
  *         @arg  RCC_RTC_HSE_DIV_46
  *         @arg  RCC_RTC_HSE_DIV_47
  *         @arg  RCC_RTC_HSE_DIV_48
  *         @arg  RCC_RTC_HSE_DIV_49
  *         @arg  RCC_RTC_HSE_DIV_50
  *         @arg  RCC_RTC_HSE_DIV_51
  *         @arg  RCC_RTC_HSE_DIV_52
  *         @arg  RCC_RTC_HSE_DIV_53
  *         @arg  RCC_RTC_HSE_DIV_54
  *         @arg  RCC_RTC_HSE_DIV_55
  *         @arg  RCC_RTC_HSE_DIV_56
  *         @arg  RCC_RTC_HSE_DIV_57
  *         @arg  RCC_RTC_HSE_DIV_58
  *         @arg  RCC_RTC_HSE_DIV_59
  *         @arg  RCC_RTC_HSE_DIV_60
  *         @arg  RCC_RTC_HSE_DIV_61
  *         @arg  RCC_RTC_HSE_DIV_62
  *         @arg  RCC_RTC_HSE_DIV_63
  *         @arg  RCC_RTC_HSE_DIV_64
  * @retval None
  */
#define __HAL_RCC_RTC_SETPRESCALER(__RCC_RTCPRESCALER__) \
  MODIFY_REG( RCC->RTCDIVR, RCC_RTCDIVR_RTCDIV, (__RCC_RTCPRESCALER__) )

/**
  * @brief  Macro to Get HSE Prescaler for RTC Clock
  *
  * @retval  This parameter can be one of the following values:
  *         @arg  RCC_RTC_HSE_DIV_1
  *         @arg  RCC_RTC_HSE_DIV_2
  *         @arg  RCC_RTC_HSE_DIV_3
  *         @arg  RCC_RTC_HSE_DIV_4
  *         @arg  RCC_RTC_HSE_DIV_5
  *         @arg  RCC_RTC_HSE_DIV_6
  *         @arg  RCC_RTC_HSE_DIV_7
  *         @arg  RCC_RTC_HSE_DIV_8
  *         @arg  RCC_RTC_HSE_DIV_9
  *         @arg  RCC_RTC_HSE_DIV_10
  *         @arg  RCC_RTC_HSE_DIV_11
  *         @arg  RCC_RTC_HSE_DIV_12
  *         @arg  RCC_RTC_HSE_DIV_13
  *         @arg  RCC_RTC_HSE_DIV_14
  *         @arg  RCC_RTC_HSE_DIV_15
  *         @arg  RCC_RTC_HSE_DIV_16
  *         @arg  RCC_RTC_HSE_DIV_17
  *         @arg  RCC_RTC_HSE_DIV_18
  *         @arg  RCC_RTC_HSE_DIV_19
  *         @arg  RCC_RTC_HSE_DIV_20
  *         @arg  RCC_RTC_HSE_DIV_21
  *         @arg  RCC_RTC_HSE_DIV_22
  *         @arg  RCC_RTC_HSE_DIV_23
  *         @arg  RCC_RTC_HSE_DIV_24
  *         @arg  RCC_RTC_HSE_DIV_25
  *         @arg  RCC_RTC_HSE_DIV_26
  *         @arg  RCC_RTC_HSE_DIV_27
  *         @arg  RCC_RTC_HSE_DIV_28
  *         @arg  RCC_RTC_HSE_DIV_29
  *         @arg  RCC_RTC_HSE_DIV_30
  *         @arg  RCC_RTC_HSE_DIV_31
  *         @arg  RCC_RTC_HSE_DIV_32
  *         @arg  RCC_RTC_HSE_DIV_33
  *         @arg  RCC_RTC_HSE_DIV_34
  *         @arg  RCC_RTC_HSE_DIV_35
  *         @arg  RCC_RTC_HSE_DIV_36
  *         @arg  RCC_RTC_HSE_DIV_37
  *         @arg  RCC_RTC_HSE_DIV_38
  *         @arg  RCC_RTC_HSE_DIV_39
  *         @arg  RCC_RTC_HSE_DIV_40
  *         @arg  RCC_RTC_HSE_DIV_41
  *         @arg  RCC_RTC_HSE_DIV_42
  *         @arg  RCC_RTC_HSE_DIV_43
  *         @arg  RCC_RTC_HSE_DIV_44
  *         @arg  RCC_RTC_HSE_DIV_45
  *         @arg  RCC_RTC_HSE_DIV_46
  *         @arg  RCC_RTC_HSE_DIV_47
  *         @arg  RCC_RTC_HSE_DIV_48
  *         @arg  RCC_RTC_HSE_DIV_49
  *         @arg  RCC_RTC_HSE_DIV_50
  *         @arg  RCC_RTC_HSE_DIV_51
  *         @arg  RCC_RTC_HSE_DIV_52
  *         @arg  RCC_RTC_HSE_DIV_53
  *         @arg  RCC_RTC_HSE_DIV_54
  *         @arg  RCC_RTC_HSE_DIV_55
  *         @arg  RCC_RTC_HSE_DIV_56
  *         @arg  RCC_RTC_HSE_DIV_57
  *         @arg  RCC_RTC_HSE_DIV_58
  *         @arg  RCC_RTC_HSE_DIV_59
  *         @arg  RCC_RTC_HSE_DIV_60
  *         @arg  RCC_RTC_HSE_DIV_61
  *         @arg  RCC_RTC_HSE_DIV_62
  *         @arg  RCC_RTC_HSE_DIV_63
  *         @arg  RCC_RTC_HSE_DIV_64
  */
#define __HAL_RCC_RTC_GETPRESCALER() (RCC->RTCDIVR & RCC_BDCR_RTCSRC_Msk)
/**
  * @}
  */

/** @defgroup RCC_MCO1_Clock_Output_Source RCC_MCO1_Kernel_Clock_Output_Source
  *  @{
  */

#define RCC_MCO1CLKOUTPUTSOURCE_CLK_MCO1       (0x0U << RCC_MCO1CFGR_MCO1SEL_Pos)
#define RCC_MCO1CLKOUTPUTSOURCE_CLK_CKOBS0     (0x1U << RCC_MCO1CFGR_MCO1SEL_Pos)

