zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rcc.h
#define IS_RCC_MCO1CLKOUTPUTSOURCE(SOURCE) (((SOURCE) == RCC_MCO1CLKOUTPUTSOURCE_CLK_MCO1) || \
                                            ((SOURCE) == RCC_MCO1CLKOUTPUTSOURCE_CLK_CKOBS0) )

/**
  * @brief  Macro to select MCO1 output source clock
  *
  * @param  __RCC_MCO1OUTPUTSOURCE__: specifies the MCO1 output clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_MCO1CLKOUTPUTSOURCE_CLK_MCO1:     "ck_mco1"   Flexiclockgen output 61
  *            @arg RCC_MCO1CLKOUTPUTSOURCE_CLK_CKOBS0:   "ck_obs0"   Flexiclockgen channel 0
  *
  * @retval None
  */
#define __HAL_RCC_MCO1KERCLK_SETSOURCE(__RCC_MCO1OUTPUTSOURCE__) \
  MODIFY_REG( RCC->MCO1CFGR, RCC_MCO1CFGR_MCO1SEL, (__RCC_MCO1OUTPUTSOURCE__)  )

/** @brief  Macro to get the clock source used as MCO1 output source clock.
  * @retval The clock source used as MCO1 output source clock. The returned value can be one
  *         of the following:
  *            @arg RCC_MCO1CLKOUTPUTSOURCE_CLK_MCO1:     "ck_mco1"   Flexiclockgen output 61
  *            @arg RCC_MCO1CLKOUTPUTSOURCE_CLK_CKOBS0:   "ck_obs0"   Flexiclockgen channel 0
  */
#define __HAL_RCC_MCO1KERCLK_GETSOURCE()  (RCC->MCO1CFGR & RCC_MCO1CFGR_MCO1SEL_Msk)
/**
  * @}
  */

/** @defgroup RCC_MCO2_Clock_Output_Source RCC_MCO2_Kernel_Clock_Output_Source
  *  @{
  */

#define RCC_MCO2CLKOUTPUTSOURCE_CLK_MCO2       (0x0U << RCC_MCO2CFGR_MCO2SEL_Pos)
#define RCC_MCO2CLKOUTPUTSOURCE_CLK_CKOBS1     (0x1U << RCC_MCO2CFGR_MCO2SEL_Pos)

#define IS_RCC_MCO2CLKOUTPUTSOURCE(SOURCE) (((SOURCE) == RCC_MCO2CLKOUTPUTSOURCE_CLK_MCO2) || \
                                            ((SOURCE) == RCC_MCO2CLKOUTPUTSOURCE_CLK_CKOBS1) )

/**
  * @brief  Macro to select MCO2 output source clock
  *
  * @param  __RCC_MCO2OUTPUTSOURCE__: specifies the MCO2 output clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_MCO2CLKOUTPUTSOURCE_CLK_MCO2:     "ck_MCO2"   Flexiclockgen output 62
  *            @arg RCC_MCO2CLKOUTPUTSOURCE_CLK_CKOBS1:   "ck_obs0"   Flexiclockgen channel 1
  *
  * @retval None
  */
#define __HAL_RCC_MCO2KERCLK_SETSOURCE(__RCC_MCO2OUTPUTSOURCE__) \
  MODIFY_REG( RCC->MCO2CFGR, RCC_MCO2CFGR_MCO2SEL, (__RCC_MCO2OUTPUTSOURCE__)  )

/** @brief  Macro to get the clock source used as MCO2 output source clock.
  * @retval The clock source used as MCO2 output source clock. The returned value can be one
  *         of the following:
  *            @arg RCC_MCO2CLKOUTPUTSOURCE_CLK_MCO2:     "ck_MCO2"   Flexiclockgen output 62
  *            @arg RCC_MCO2CLKOUTPUTSOURCE_CLK_CKOBS1:   "ck_obs0"   Flexiclockgen channel 1
  */
#define __HAL_RCC_MCO2KERCLK_GETSOURCE()  (RCC->MCO2CFGR & RCC_MCO2CFGR_MCO2SEL_Msk)
/**
  * @}
  */

/** @brief Enable RCC interrupt (Perform Byte access to RCC_CIR[14:8] bits to enable
  *        the selected interrupts).
  * @param  __INTERRUPT__: specifies the RCC interrupt sources to enabled.
  *         This parameter can be any combination of the following values:
  *            @arg RCC_IT_LSIRDY:  LSI ready interrupt
  *            @arg RCC_IT_LSERDY:  LSE ready interrupt
  *            @arg RCC_IT_HSIRDY:  HSI ready interrupt
  *            @arg RCC_IT_HSERDY:  HSE ready interrupt
  *            @arg RCC_IT_MSIRDY:  MSI ready interrupt
  *            @arg RCC_IT_PLL1RDY: PLL1RDY ready interrupt
  *            @arg RCC_IT_PLL2RDY: PLL2RDY ready interrupt
  *            @arg RCC_IT_PLL3RDY: PLL3RDY ready interrupt
  *            @arg RCC_IT_PLL4RDY: PLL4RDY ready interrupt
  *            @arg RCC_IT_PLL5RDY: PLL5RDY ready interrupt
  *            @arg RCC_IT_PLL6RDY: PLL2RDY ready interrupt
  *            @arg RCC_IT_PLL7RDY: PLL3RDY ready interrupt
  *            @arg RCC_IT_PLL8RDY: PLL4RDY ready interrupt
  *            @arg RCC_IT_LSECSS:  LSE Clock security system interrupt
  *            @arg RCC_IT_WKUP:    Wake-up from CSTOP Interrupt
  */
#ifdef CORE_CM33
#define __HAL_RCC_ENABLE_IT(__INTERRUPT__) SET_BIT(RCC->C2CIESETR, (__INTERRUPT__))
#endif /* CORE_CM33 */
#ifdef CORE_CA35
#define __HAL_RCC_ENABLE_IT(__INTERRUPT__) SET_BIT(RCC->C1CIESETR, (__INTERRUPT__))
#endif /* CORE_CA35 */

/** @brief Disable RCC interrupt (Perform Byte access to RCC_CIR[14:8] bits to disable
  *        the selected interrupts).
  * @param  __INTERRUPT__: specifies the RCC interrupt sources to be disabled.
  *         This parameter can be any combination of the following values:
  *           @arg RCC_IT_LSIRDY:  LSI ready interrupt
  *           @arg RCC_IT_LSERDY:  LSE ready interrupt
  *           @arg RCC_IT_HSIRDY:  HSI ready interrupt
  *           @arg RCC_IT_HSERDY:  HSE ready interrupt
  *           @arg RCC_IT_MSIRDY:  MSI ready interrupt
  *           @arg RCC_IT_PLL1RDY: PLL1RDY ready interrupt
  *           @arg RCC_IT_PLL2RDY: PLL2RDY ready interrupt
  *           @arg RCC_IT_PLL3RDY: PLL3RDY ready interrupt
  *           @arg RCC_IT_PLL4RDY: PLL4RDY ready interrupt
  *           @arg RCC_IT_PLL5RDY: PLL5RDY ready interrupt
  *           @arg RCC_IT_PLL6RDY: PLL2RDY ready interrupt
  *           @arg RCC_IT_PLL7RDY: PLL3RDY ready interrupt
  *           @arg RCC_IT_PLL8RDY: PLL4RDY ready interrupt
  *           @arg RCC_IT_LSECSS:  LSE Clock security system interrupt
  *           @arg RCC_IT_WKUP:    Wake-up from CSTOP Interrupt
  */
#ifdef CORE_CM33
#define __HAL_RCC_DISABLE_IT(__INTERRUPT__) CLEAR_BIT(RCC->C2CIESETR, (__INTERRUPT__))
#endif /* CORE_CM33 */
#ifdef CORE_CA35
#define __HAL_RCC_DISABLE_IT(__INTERRUPT__) CLEAR_BIT(RCC->C1CIESETR, (__INTERRUPT__))
#endif /* CORE_CA35 */

/** @brief  Clear the RCC's interrupt pending bits (Perform Byte access to RCC_CIR[23:16]
  *         bits to clear the selected interrupt pending bits.
  * @param  __INTERRUPT__: specifies the interrupt pending bit to clear.
  *         This parameter can be any combination of the following values:
  *           @arg RCC_IT_LSIRDY:  LSI ready interrupt
  *           @arg RCC_IT_LSERDY:  LSE ready interrupt
  *           @arg RCC_IT_HSIRDY:  HSI ready interrupt
  *           @arg RCC_IT_HSERDY:  HSE ready interrupt
  *           @arg RCC_IT_MSIRDY:  MSI ready interrupt
  *           @arg RCC_IT_PLL1RDY: PLL1RDY ready interrupt
  *           @arg RCC_IT_PLL2RDY: PLL2RDY ready interrupt
  *           @arg RCC_IT_PLL3RDY: PLL3RDY ready interrupt
  *           @arg RCC_IT_PLL4RDY: PLL4RDY ready interrupt
  *           @arg RCC_IT_PLL5RDY: PLL5RDY ready interrupt
  *           @arg RCC_IT_PLL6RDY: PLL2RDY ready interrupt
  *           @arg RCC_IT_PLL7RDY: PLL3RDY ready interrupt
  *           @arg RCC_IT_PLL8RDY: PLL4RDY ready interrupt
  *           @arg RCC_IT_LSECSS:  LSE Clock security system interrupt
  *           @arg RCC_IT_WKUP:    Wake-up from CSTOP Interrupt
  */
#ifdef CORE_CM33
#define __HAL_RCC_CLEAR_IT(__INTERRUPT__) (RCC->C2CIFCLRR = (__INTERRUPT__))
#endif /* CORE_CM33 */
#ifdef CORE_CA35
#define __HAL_RCC_CLEAR_IT(__INTERRUPT__) (RCC->C1CIFCLRR = (__INTERRUPT__))
#endif /* CORE_CA35 */

/** @brief  Check the RCC's interrupt has occurred or not.
  * @param  __INTERRUPT__: specifies the RCC interrupt source to check.
  *         This parameter can be one of the following values:
  *           @arg RCC_IT_LSIRDY:  LSI ready interrupt
  *           @arg RCC_IT_LSERDY:  LSE ready interrupt
  *           @arg RCC_IT_HSIRDY:  HSI ready interrupt
  *           @arg RCC_IT_HSERDY:  HSE ready interrupt
  *           @arg RCC_IT_MSIRDY:  MSI ready interrupt
  *           @arg RCC_IT_PLL1RDY: PLL1RDY ready interrupt
  *           @arg RCC_IT_PLL2RDY: PLL2RDY ready interrupt
  *           @arg RCC_IT_PLL3RDY: PLL3RDY ready interrupt
  *           @arg RCC_IT_PLL4RDY: PLL4RDY ready interrupt
  *           @arg RCC_IT_PLL5RDY: PLL5RDY ready interrupt
  *           @arg RCC_IT_PLL6RDY: PLL2RDY ready interrupt
  *           @arg RCC_IT_PLL7RDY: PLL3RDY ready interrupt
  *           @arg RCC_IT_PLL8RDY: PLL4RDY ready interrupt
  *           @arg RCC_IT_LSECSS:  LSE Clock security system interrupt
  *           @arg RCC_IT_WKUP:    Wake-up from CSTOP Interrupt
  * @retval The new state of __INTERRUPT__ (TRUE or FALSE).
  */
#ifdef CORE_CM33
#define __HAL_RCC_GET_IT(__INTERRUPT__) ((RCC->C2CIFCLRR & (__INTERRUPT__)) == (__INTERRUPT__))
#endif /* CORE_CM33 */
#ifdef CORE_CA35
#define __HAL_RCC_GET_IT(__INTERRUPT__) ((RCC->C1CIFCLRR & (__INTERRUPT__)) == (__INTERRUPT__))
#endif /* CORE_CA35 */


/* RCC_Calibration limits */
#define IS_RCC_HSICALIBRATION_VALUE(VALUE) ((VALUE) <= 0x1FFU)
#define IS_RCC_MSICALIBRATION_VALUE(VALUE) ((VALUE) <= 0xFFU)

/* MCO1 clock output control */
#define __HAL_RCC_MCO1_ENABLE()   SET_BIT(RCC->MCO1CFGR, RCC_MCO1CFGR_MCO1ON)
#define __HAL_RCC_MCO1_DISABLE()  CLEAR_BIT(RCC->MCO1CFGR, RCC_MCO1CFGR_MCO1ON)

