zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rcc.h
/* MCO2 clock output control */
#define __HAL_RCC_MCO2_ENABLE()   SET_BIT(RCC->MCO2CFGR, RCC_MCO2CFGR_MCO2ON)
#define __HAL_RCC_MCO2_DISABLE()  CLEAR_BIT(RCC->MCO2CFGR, RCC_MCO2CFGR_MCO2ON)

/** @defgroup RCC_HAL_RIF_Exported_Macros RCC HAL RIF Exported Macros
  * @{
  */
#if !defined(RCC_DERIVATIVE1_LOCAL_RESOURCES_MAPPING)
#define IS_LOCALRES_INDEX(INDEX) (((INDEX) >= RCC_LOCALRES_0) && \
                                  ((INDEX) <= RCC_LOCALRES_113))
#else
#define IS_LOCALRES_INDEX(INDEX) ((((INDEX) >= RCC_LOCALRES_0)    && \
                                   ((INDEX) <= RCC_LOCALRES_113)) && \
                                  (((INDEX) != RCC_LOCALRES_72)   &&\
                                   ((INDEX) != RCC_LOCALRES_80)  &&\
                                   ((INDEX) != RCC_LOCALRES_81)  &&\
                                   ((INDEX) != RCC_LOCALRES_82)  &&\
                                   ((INDEX) != RCC_LOCALRES_89)  &&\
                                   ((INDEX) != RCC_LOCALRES_99)  &&\
                                   ((INDEX) != RCC_LOCALRES_100) &&\
                                   ((INDEX) != RCC_LOCALRES_107)))
#endif /* RCC_DERIVATIVE1_LOCAL_RESOURCES_MAPPING */

/* On secure Cortex core only : */
#if defined(CORTEX_IN_SECURE_STATE)
#define IS_PRIV_ATTRIBUTE(ATTRIBUTE) (((ATTRIBUTE) == RCC_LOCALRES_PRIV)   || \
                                      ((ATTRIBUTE) == RCC_LOCALRES_NOPRIV) || \
                                      ((ATTRIBUTE) == RCC_LOCALRES_ATTR_NONE))

#define IS_LOCK_ATTRIBUTE(ATTRIBUTE) (((ATTRIBUTE) == RCC_LOCALRES_LOCKED) || \
                                      ((ATTRIBUTE) == RCC_LOCALRES_ATTR_NONE))

#define IS_SEC_ATTRIBUTE(ATTRIBUTE) (((ATTRIBUTE) == RCC_LOCALRES_SEC)   || \
                                     ((ATTRIBUTE) == RCC_LOCALRES_NOSEC) || \
                                     ((ATTRIBUTE) == RCC_LOCALRES_ATTR_NONE))

#define IS_CID_ATTRIBUTE(ATTRIBUTE) (((ATTRIBUTE) == RCC_LOCALRES_CID_TYPE_NONE) || \
                                     ((((ATTRIBUTE) & RCC_LOCALRES_ATTR_CID_TYPE_MSK) == \
                                       RCC_LOCALRES_CID_TYPE_STATIC) && \
                                      ((~(ATTRIBUTE) & ~RCC_LOCALRES_CID_STATIC_MSK) == \
                                       ~RCC_LOCALRES_CID_STATIC_MSK)) || \
                                     ((((ATTRIBUTE) & RCC_LOCALRES_ATTR_CID_TYPE_MSK) == \
                                       RCC_LOCALRES_CID_TYPE_DYNAMIC) && \
                                      ((~(ATTRIBUTE) & ~RCC_LOCALRES_CID_DYNAMIC_MSK) == \
                                       ~RCC_LOCALRES_CID_DYNAMIC_MSK )))
#endif /* CORTEX_IN_SECURE_STATE */
/**
  * @}
  */

/**
  * @}
  */
/* Include RCC HAL Extended module */
#include "stm32mp2xx_hal_rcc_ex.h"

/* Exported functions --------------------------------------------------------*/
/** @addtogroup RCC_Exported_Functions RCC Exported Functions
  * @{
  */

uint32_t HAL_RCC_GetFreq(uint32_t clk);
uint32_t HAL_RCC_GetSource(uint32_t clk_id);
uint32_t HAL_RCC_GetCM33Freq(void);
#if defined(CORE_CA35)
uint32_t HAL_RCC_GetCA35Freq(void);
#endif /* CORE_CA35 */

/** @addtogroup RCC_Exported_Functions_Group1
  * @{
  */

/* Initialization and de-initialization functions  ******************************/
HAL_StatusTypeDef HAL_RCC_DeInit(void);
HAL_StatusTypeDef HAL_RCC_OscConfig(const RCC_OscInitTypeDef *pRCC_OscInitStruct);
void HAL_RCC_GetOscConfig(RCC_OscInitTypeDef  *pRCC_OscInitStruct);
HAL_StatusTypeDef HAL_RCC_ClockConfig(const RCC_ClkInitTypeDef *const pRCC_ClkInitStruct, uint32_t FLatency);
void HAL_RCC_GetClockConfig(RCC_ClkInitTypeDef  *pRCC_ClkInitStruct, const uint32_t *pFLatency);
void HAL_RCC_IRQHandler(void);
void HAL_RCC_WAKEUP_IRQHandler(void);
void HAL_RCC_HSIMON_Callback(uint32_t Flags);
void HAL_RCC_WAKEUP_Callback(uint32_t Flags);
void HAL_RCC_Callback(uint32_t Flags);
/**
  * @}
  */

/** @addtogroup RCC_Exported_Functions_Group2
  * @{
  */

/* Peripheral Control functions  **********************************************/
void HAL_RCC_MCOConfig(uint32_t RCC_MCOx, uint32_t RCC_MCOSource, uint32_t RCC_MCODiv);

/**
  * @}
  */

/* Attributes management functions ********************************************/
#if defined(CORTEX_IN_SECURE_STATE)
HAL_StatusTypeDef HAL_RCC_ConfigAttributes(uint32_t LocalResIndex, uint32_t LocalResAttributes);
#endif /* CORTEX_IN_SECURE_STATE */

HAL_StatusTypeDef HAL_RCC_GetConfigAttributes(uint32_t LocalResIndex, uint32_t *pLocalResAttributes);
HAL_StatusTypeDef HAL_RCC_TakeLocalResSemaphore(uint32_t LocalResIndex);
HAL_StatusTypeDef HAL_RCC_ReleaseLocalResSemaphore(uint32_t LocalResIndex);

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */


#ifdef __cplusplus
}
#endif

#endif /* STM32MP2xx_HAL_RCC_H */
